<?PHP
$next = "下一页";
$back = "上一页";

$title[1] = "儿童的教育状况";
$title[2] = "对于以下问题，请从选项中选出您认为最符合的一个。";
$title[3] = "对于以下问题，请从选项中选出您认为最符合的一个。";
$title[4] = "对于以下问题，请从选项中选出您认为最符合的一个。";
$title[5] = "对于以下问题，请从选项中选出您认为最符合的一个。";


$title[6] = "";
$title[7] = "";

$title[8] = "对于以下问题，请从选项中选出您认为最符合的一个。";
$title[9] = "对于以下问题，请从选项中选出您认为最符合的一个。";

/*
$title[10] = "对于以下问题，请从选项中选出您认为最符合的一个。";
$title[11] = "对于以下问题，请从选项中选出您认为最符合的一个。";
$title[12] = "对于以下问题，请从选项中选出您认为最符合的一个。";
$title[13] = "对于以下问题，请从选项中选出您认为最符合的一个。";
*/
$title[10] = "";
$title[11] = "";
$title[12] = "";
$title[13] = "";

$i2=1;
$question[1][$i2++] = "花在孩子身上的时间（每日平均）";
$question[1][$i2++] = "花在孩子教育上的金额(毎月平均)";
$question[1][$i2++] = "孩子的成绩";

$question[2][$i2++] = "虽然想着对孩子温和一点，但不管对自己还是对孩子都想要求完美。";
$question[2][$i2++] = "虽说是孩子自己的人生，但还是希望孩子可以走我自己觉得幸福的人生之路。";
$question[2][$i2++] = "虽然想要任凭孩子去干，但是总会因不安而去插手。";
$question[2][$i2++] = "自己的意识中“这个是正确的”这种概念很强，并且很难改变看法。";
$question[2][$i2++] = "虽然打算听孩子的意见，但是在这个过程中总会指示，责备孩子。";
$question[2][$i2++] = "虽然想着要把他当做成人来对待，到总是像对小孩一样对他。";
$question[2][$i2++] = "和配偶商量教育的问题，但是得不到他的重视，很苦恼。";
$question[2][$i2++] = "想要夫妻之间围绕教育的问题交谈一下，但是对方不理睬，很苦恼。";
$question[2][$i2++] = "夫妻之间教育观念不一样，很苦恼";
$question[2][$i2++] = "在必须要严厉惩罚孩子的时候，配偶却现在孩子那边，很苦恼。";
$question[2][$i2++] = "是为了孩子的教育，干涉孩子的隐私，还是尊重他的隐私，很迷茫。";
$question[2][$i2++] = "对于孩子让人意外的行为，是改斥责他，还是应该思考这些行为背后的意思，很迷茫。";
$question[2][$i2++] = "孩子有没有隐瞒什么坏的秘密，经常变得不安。";
$question[2][$i2++] = "孩子会逃向对自己有利的一方。";
$question[2][$i2++] = "想要狠狠地斥责孩子，但总是担心两人之间关系会出现裂痕，变差而犹豫。";
$question[2][$i2++] = "该怎样面对社会和教育观念的多样性来教育孩子，找不到方向。";
$question[2][$i2++] = "有时候会迷茫，自己人生经历中的好，和社会所普遍认为的好是否有出入。";
$question[2][$i2++] = "在被问到，活着的意义，学习的意义的时候，不知道该怎么回答。";
$question[2][$i2++] = "想要坚持自己一贯的价值，但是在听到别的信息的时候，会开始迷茫。";
$question[2][$i2++] = "想探索本质上的教育观，但无法找到。";



$question[3][$i2++] = "虽然能够理解孩子的反抗，但总是不自觉得就生气了。";
$question[3][$i2++] = "想把孩子的叛逆当做他成长过程的一部分，但纠结在疼爱和厌烦的矛盾中。";
$question[3][$i2++] = "虽然会意识到要鼓励式教育，但是总会生气。";
$question[3][$i2++] = "开始思考人生的宿命。";
$question[3][$i2++] = "感觉自己不是活着而是被活着。";
$question[3][$i2++] = "喜悦和悲伤全部都是自身的原因。";
$question[3][$i2++] = "自己不改变，孩子就不会改变。";
$question[3][$i2++] = "承认自己不完美，开始以好的方面去接受它。";
$question[3][$i2++] = "认为教育子女是在培育自己。";
$question[3][$i2++] = "对于宗教性的思想和行动更加感兴趣了。";
$question[3][$i2++] = "自己一个人的教育肯定会有局限，这需要大家一起教育。";
$question[3][$i2++] = "认为自己和孩子都是社会的一份子。";
$question[3][$i2++] = "即使受到反抗也不动摇，会相信应该有可以理解的地方。";
$question[3][$i2++] = "会在孩子面前勇敢地承认自己的过错，并道歉。";
$question[3][$i2++] = "开始好好发现孩子自身独特的“优点”，而不是社会一般的优点。";
$question[3][$i2++] = "当孩子偏离正轨时，会首先听取孩子的意见，进行交流。";
$question[3][$i2++] = "等待孩子以自己的节奏成长。";
$question[3][$i2++] = "觉得从孩子身上学到的东西有很多。";
$question[3][$i2++] = "即使孩子偏离正轨，也相信他会回归正轨。";
$question[3][$i2++] = "就算觉得孩子的想法还很幼稚，也会以接受的态度倾听，";

$question[4][$i2++] = "能够很好地控制自己的感情了。";
$question[4][$i2++] = "可以很好地控制人与人之间的距离了。";
$question[4][$i2++] = "会从多方面来看待事物。";
$question[4][$i2++] = "会牢记不忘给自己心灵放松的时间。";
$question[4][$i2++] = "开始吸收不同人的思考方式。";
$question[4][$i2++] = "开始想要好好确立自己的人生。";
$question[4][$i2++] = "能灵活地思考正确的概念。";
$question[4][$i2++] = "诚实地说出自己的心情、感觉。";
$question[4][$i2++] = "对自己心情、感觉的变化变得敏感。";
$question[4][$i2++] = "会更加多的去思考事物的本质。";
$question[4][$i2++] = "经常把“利他”挂在心上。";
$question[4][$i2++] = "即便再忙，也要留时间给孩子。";
$question[4][$i2++] = "意识到要和孩子有共同的话题。";
$question[4][$i2++] = "根据孩子的状况来考虑表达的方法和时机。";
$question[4][$i2++] = "支持孩子，让孩子自己能一步步地去处理事情。";
$question[4][$i2++] = "促导孩子要尽量用自己的力量去处理事情。";
$question[4][$i2++] = "在进行选择和决定的时候，要尽量交给孩子。";
$question[4][$i2++] = "帮助孩子在合适的场合，能压抑自己的欲望。";
$question[4][$i2++] = "促导孩子在需要忍耐的时候，能用自己的力量忍耐。";
$question[4][$i2++] = "牢牢抓住孩子的兴趣，然后给孩子创造能拓展他兴趣的环境。";


$question[5][$i2++] = "让孩子意识到，玩和学习，什么时候开始，什么时候结束。";
$question[5][$i2++] = "促导让孩子能够用自己的力量控制自己的感情。";
$question[5][$i2++] = "让孩子发现自己的成长和变化。";
$question[5][$i2++] = "孩子最喜欢的人是我。";
$question[5][$i2++] = "孩子最信任的人是我。";
$question[5][$i2++] = "孩子和我在一起感到幸福。";
$question[5][$i2++] = "这个孩子在想什么，想怎么做，我比谁都清楚。";
$question[5][$i2++] = "我能够信任这个孩子。";
$question[5][$i2++] = "和这个孩子在一起我很幸福。";
$question[5][$i2++] = "我很喜欢这个孩子";
$question[5][$i2++] = "孩子很明白我的心情。";



$question[6][$i2++] = "你在对待孩子时，是以怎样的方式对待的？请从1～4中选择。";
$question[7][$i2++] = "你的配偶平常是怎样对待孩子的？请从１～４选项中选择。<br />※不会向您的配偶显示回答结果";


$question[8][$i2++] = "我一般很少把感情表现出来。";
$question[8][$i2++] = "我能察觉到对方是如何理解自己的话的。";
$question[8][$i2++] = "要说的话，我是不把自己的感情、心情等表现在外的人。";
$question[8][$i2++] = "如果别人使我感到不愉快的话，我会明白地说出不满。";
$question[8][$i2++] = "要说的话，我是比较能够体会对方心情的人。";
$question[8][$i2++] = "我能够站到对方考虑事物方法的立场，探寻谈话的脉络。";
$question[8][$i2++] = "我很少把自己感情表现出来。";
$question[8][$i2++] = "我会用表情来传达自己的心情。";
$question[8][$i2++] = "我能够从对方的表情、态度等，察知这个人的心情。";
$question[8][$i2++] = "看看对方的眼睛，我能够意识到自己说了什么不恰当的话。";
$question[8][$i2++] = "我能够站到对方的立场听他说话。";
$question[8][$i2++] = "基本上不会作露骨的感情表现。";
$question[8][$i2++] = "能够用表情传达，是喜是忧。";
$question[8][$i2++] = "即使和别人的意见不同，我也明确地主张自己的意见。";
$question[8][$i2++] = "谈话中，我能够敏感的察觉对方心情的变化。";
$question[8][$i2++] = "我会比较敏感地注意到，对方表面上的言辞和心里真心话的不同。";
$question[8][$i2++] = "我是不在人前表现喜怒哀乐的人。";
$question[8][$i2++] = "我会表情丰富地，表达自己的想法。";
$question[8][$i2++] = "我在应该说的时候，会明确地发言。";
$question[8][$i2++] = "要说的话，我是理解人的感情、动机等的直觉比较强的人。";
$question[8][$i2++] = "我会顾及对方心情，自己转为听的一方。";


$question[9][$i2++] = "我能够用表情、动作等，把感情就这样原原本本地表达。";
$question[9][$i2++] = "我是明确地向对方主张自己想法的人。";
$question[9][$i2++] = "我能够感觉到对方话语中包含的感情。";
$question[9][$i2++] = "我通常想不断地了解人们的想法。";
$question[9][$i2++] = "我能够随着对方感情的变动，理解话的内容。";
$question[9][$i2++] = "我通常不表现出自己的感情。";
$question[9][$i2++] = "我能够通过姿态、动作等传达自己的感情。";
$question[9][$i2++] = "如果我认为是正确的意见，不管对方是谁，我都会坚持说。";
$question[9][$i2++] = "我能够敏感地感受到我接触的人的感情。";
$question[9][$i2++] = "我通常会分析他人的心理活动。";
$question[9][$i2++] = "我通常会接纳着对方的心情，同时来把握对话的内容变化。";
$question[9][$i2++] = "我能够借助动作、表情等传达自己的感受。";
$question[9][$i2++] = "我是讨厌就是讨厌，会明确说的人。";
$question[9][$i2++] = "看看别人的脸，我能够察知这个人感受到的东西。";
$question[9][$i2++] = "我能够站到对方立场上，理解谈话的流程。";


$question[10][$i2][1] = "自己有普通人以上的智力 ";
$question[10][$i2++][2] = "我能够站到对方立场上，理解谈话的流程。";
$question[10][$i2][1] = "经常考虑自己为什么会有这样的心情  ";
$question[10][$i2++][2] = "被要求重做时，如果此指责是正确的，那么会自愿进行重做 ";
$question[10][$i2][1] = "即使处于困境，也会觉得总会有办法的";
$question[10][$i2++][2] = "我的意见经常被朋友认可 ";
$question[10][$i2][1] = "「生气了」或是「不愉快」会经常认识自己的感情";
$question[10][$i2++][2] = "即使处于困境，也会觉得总会有办法的";
$question[10][$i2][1] = "下定决心，将来一定要做大事";
$question[10][$i2++][2] = "擅长耐心地听别人讲话";
$question[10][$i2][1] = "被要求重做时，如果此指责是正确的，那么会自愿进行重做";
$question[10][$i2++][2] = "不破坏气氛，并能条理清楚地主张自己的意见";
$question[10][$i2][1] = "不会在脸上表现出生气与不快，能够迅速地镇静";
$question[10][$i2++][2] = "自己有普通人以上的智力";
$question[10][$i2][1] = "从微妙的表情与会话中，可以感受到对方心情的变化";
$question[10][$i2++][2] = "不会在脸上表现出生气与不快，能够迅速地镇静";
$question[10][$i2][1] = "与朋友一起度过快乐的时光";
$question[10][$i2++][2] = "从微妙的表情与会话中，可以感受到对方心情的变化";
$question[10][$i2][1] = "擅长耐心地听别人讲话";
$question[10][$i2++][2] = "「生气了」或是「不愉快」会经常认识自己的感情 ";



$question[11][$i2][1] = "不破坏气氛，并能条理清楚地主张自己的意见";
$question[11][$i2++][2] = "下定决心，将来一定要做大事";
$question[11][$i2][1] = "我的意见经常被朋友认可";
$question[11][$i2++][2] = "经常考虑自己为什么会有这样的心情";
$question[11][$i2][1] = "时刻注意要在自己擅长的领域里决胜负";
$question[11][$i2++][2] = "有自信说服反对者，且不伤害对方的面子";
$question[11][$i2][1] = "经常确认自己目前处于何种感情，如焦躁・恐惧・喜悦・悲伤等";
$question[11][$i2++][2] = "只需要通过稍许的谈话，就能够掌握对方的爱好与性格";
$question[11][$i2][1] = "磨练自己的技能，不断地提高自己";
$question[11][$i2++][2] = "不希望抢在朋友前面，作为自己的功绩";
$question[11][$i2][1] = "自己拥有获取成功所需要的能力";
$question[11][$i2++][2] = "磨练自己的技能，不断地提高自己";
$question[11][$i2][1] = "能够战胜焦躁与恐惧，冷静地进行行动";
$question[11][$i2++][2] = "计划郊游与聚餐等集会，喜欢做让朋友高兴的事";
$question[11][$i2][1] = "只需要通过稍许的谈话，就能够掌握对方的爱好与性格";
$question[11][$i2++][2] = "有引领他人的力量";
$question[11][$i2][1] = "我相信与失败的恐惧相比，更期待成功的喜悦";
$question[11][$i2++][2] = "时刻注意要在自己擅长的领域里决胜负";
$question[11][$i2][1] = "经常有人会与我商量烦恼的事情 ";
$question[11][$i2++][2] = "我相信与失败的恐惧相比，更期待成功的喜悦";
$question[11][$i2][1] = "有自信说服反对者，且不伤害对方的面子";
$question[11][$i2++][2] = "经常有人会与我商量烦恼的事情";



$question[12][$i2][1] = "计划郊游与聚餐等集会，喜欢做让朋友高兴的事";
$question[12][$i2++][2] = "自己拥有获取成功所需要的能力";
$question[12][$i2][1] = "有引领他人的力量";
$question[12][$i2++][2] = "能够战胜焦躁与恐惧，冷静地进行行动";
$question[12][$i2][1] = "不希望抢在朋友前面，作为自己的功绩";
$question[12][$i2++][2] = "经常确认自己目前处于何种感情，如焦躁・恐惧・喜悦・悲伤等";
$question[12][$i2][1] = "经常考虑自己到底想做什么，是怎样的心情";
$question[12][$i2++][2] = "在集团中发挥领导力";
$question[12][$i2][1] = "我喜欢自己，并能够给予自己肯定";
$question[12][$i2++][2] = "爱掉眼泪，看见别人哭，自己也会感到悲伤哭泣";
$question[12][$i2][1] = "即使勃然大怒，也会下意识地不发火";
$question[12][$i2++][2] = "重视团队合作";
$question[12][$i2][1] = "了解自己的弱点，在自己的弱项上不逞强";
$question[12][$i2++][2] = "即使勃然大怒，也会下意识地不发火";
$question[12][$i2][1] = "能够随机应变地变换优先顺序快乐地处理课题";
$question[12][$i2++][2] = "即使在有难伺候的客人的店里从事接待工作（临时工），也不觉得难受";
$question[12][$i2][1] = "爱掉眼泪，看见别人哭，自己也会感到悲伤哭泣";
$question[12][$i2++][2] = "对于难以理解的说明，毫不犹豫地直率地进行提问";
$question[12][$i2][1] = "只要我努力，情况一定会好转的";
$question[12][$i2++][2] = "经常考虑自己到底想做什么，是怎样的心情";
$question[12][$i2][1] = "即使在有难伺候的客人的店里从事接待工作（临时工），也不觉得难受";
$question[12][$i2++][2] = "能够随机应变地变换优先顺序快乐地处理课题";



$question[13][$i2][1] = "在集团中发挥领导力";
$question[13][$i2++][2] = "我能够迅速地认清真心话与客套话的不同";
$question[13][$i2][1] = "我能够迅速地认清真心话与客套话的不同";
$question[13][$i2++][2] = "我喜欢自己，并能够给予自己肯定";
$question[13][$i2][1] = "重视团队合作";
$question[13][$i2++][2] = "只要我努力，情况一定会好转的";
$question[13][$i2][1] = "对于难以理解的说明，毫不犹豫地直率地进行提问";
$question[13][$i2++][2] = "了解自己的弱点，在自己的弱项上不逞强";






$selects = array();
$selects[1][1] = "小时";
$selects[1][2] = "元";
$selects[1][3][1] = "下等";
$selects[1][3][2] = "中等偏下";
$selects[1][3][3] = "中等";
$selects[1][3][4] = "中等偏上";
$selects[1][3][5] = "上等";

$i3=4;
for($j=2;$j<=5;$j++){
    $selects[$j][1] = "完全不吻合";
    $selects[$j][2] = "不吻合";
    $selects[$j][3] = "基本不吻合";
    $selects[$j][4] = "基本吻合";
    $selects[$j][5] = "吻合";
    $selects[$j][6] = "非常吻合";
}
for($j=6;$j<=7;$j++){
    $selects[$j][1] = "即“无论何事都交给孩子自己处理”，不会做出对孩子进行指导、命令、帮助、表扬、批评等积极的举动。";
    $selects[$j][2] = "对任何事情都会插手，不知不觉中对孩子各方面照料等。";
    $selects[$j][3] = "将孩子的想法放在一边，什么事情都你来主导。";  
    $selects[$j][4] = "任何事都引导孩子自己做判断，自己推进。";
}

for($j=8;$j<=9;$j++){
    $selects[$j][1] = "基本不符合";
    $selects[$j][2] = "不太符合";
    $selects[$j][3] = "有点符合";  
    $selects[$j][4] = "非常符合";
}



//$ave = array(8.1,8.1,8.1,8.1,8.1,8.1,8.1,8.1,8.1,8.1,8.1,8.1,8.1);
$ave = array(15,15,15,15,15,15,15,15,15,15,15,15,15);
$hensa = array(2.43,2.43,2.43,2.43,2.43,2.43,2.43,2.43,2.43,2.43,2.43,2.43,2.43);

$raw_data = array(
  1  => array( '-:q4',  '+:q10', '-:q14', '+:q24', '-:q25', '+:q31', 'モニタリング' ),
  2  => array( '-:q2',  '+:q12', '-:q13', '+:q19', '-:q28', '+:q36', '適切な自己評価' ),
  3  => array( '-:q1',  '+:q7' , '-:q16', '+:q22', '-:q26', '+:q34', '肯定的自己像' ),
  4  => array( '-:q7',  '+:q8' , '-:q17', '+:q23', '-:q27', '+:q28', '克己抑制' ),
  5  => array( '-:q5',  '+:q11', '-:q15', '+:q16', '-:q31', '+:q35', '達成動機' ),
  6  => array( '-:q3',  '+:q4' , '-:q19', '+:q20', '-:q29', '+:q32', '楽観性' ),
  7  => array( '+:q5',  '-:q10', '-:q20', '+:q21', '+:q26', '-:q30', '共感性' ),
  8  => array( '-:q8',  '+:q9' , '+:q14', '-:q18', '+:q33', '-:q34', 'センシブル' ),
  9  => array( '+:q2',  '-:q6' , '+:q17', '-:q22', '+:q29', '-:q32', 'サービス精神' ),
  10 => array( '+:q3',  '-:q12', '+:q18', '-:q23', '+:q25', '-:q33', 'リーダーシップ' ),
  11 => array( '+:q6',  '-:q11', '+:q13', '-:q21', '+:q30', '-:q36', 'アサーション' ),
  12 => array( '+:q1',  '-:q9' , '+:q15', '-:q24', '+:q27', '-:q35', 'チームワーク' )
);

$dev_data = array(
  1 => array( -2.22094564737075, 3.83810209584864, 'モニタリング' ),
  2 => array( -0.607158638974812, 3.40571923193921, '適切な自己評価' ),
  3 => array( -3.52261010458094, 3.5371486665457, '肯定的自己像' ),
  4 => array( -1.63816467815584, 3.45374535910044, '克己抑制' ),
  5 => array( 0.0233465900721756, 3.4974037775748, '達成動機' ),
  6 => array( 1.22433348063043, 3.52077641367019, '楽観性' ),
  7 => array( 2.23619089703933, 3.94365874100903, '共感性' ),
  8 => array( 1.54116953896008, 3.39747930063903, 'センシブル' ),
  9 => array( 1.18846663720725, 3.48025199197222, 'サービス精神' ),
  10 => array( -0.486669612608632, 4.32246024919477, 'リーダーシップ' ),
  11 => array( -0.524230372661659, 3.30271067209346, 'アサーション' ),
  12 => array( 2.78627191044336, 3.49133504881389, 'チームワーク' ),
);


?>