<?PHP
$array_answer = array(
					 "ans1"=>3
					,"ans2"=>1
					,"ans3"=>2
					,"ans4"=>1
					,"ans5"=>3
					,"ans6"=>2
					,"ans7"=>5
					,"ans8"=>4
					,"ans9"=>5
					,"ans10"=>3

				);
$array_number = array(
					1=>"①"
					,2=>"②"
					,3=>"③"
					,4=>"④"
					,5=>"⑤"
					,6=>"⑥"
					,7=>"⑦"
					,8=>"⑧"
					,9=>"⑨"
					,10=>"⑩"

				);

$question[1][1][0] = "";
$question[1][1][1] = "昨今、企業社会全体が「人権を尊重する必要性」を強調するようになっています。では、なぜその必要性が強調されるようになったのでしょうか。以下の選択肢から正しいと思われるものを１つ選んでください。";

$question[1][2][0] = " ";
$question[1][2][1] = "ア．東京パラリンピックの開催などの影響もあり、企業が人権尊重を含む社会的責任をまっとうすることの認識が高まったから。";
$question[1][2][2] = "イ．企業が外国で活動することが増える中で、欧米先進国の人権尊重のレベルに合わせることが公的に義務化されたから。";
$question[1][2][3] = "ウ．人権尊重によって従業員が働きやすい職場を作り、多様で優秀な人材の採用と活用が可能となることで、生産性向上につなげることができるから。";
$question[1][2][4] = "エ．職場の安全配慮はもともと企業の義務だが、人権尊重が安全配慮の範囲内であることが近年の裁判で示されたから。";

$question[1][3][1] = "① ア";
$question[1][3][2] = "② エ";
$question[1][3][3] = "③ ア、ウ";
$question[1][3][4] = "④ イ、エ";
$question[1][3][5] = "⑤ ア、イ、ウ";
$question[1][3][6] = "⑥ イ、ウ、エ";


$interprete[1][0] = "③";
$interprete[1][1] = " ア、ウ";
$interprete[1][2] = "東京オリンピック・パラリンピックの開催などの影響もあり、差別がなく、多様な価値観を認める人権意識を高めることの重要性が社会的に強く認識されるようになりました。また、人権を尊重し、従業員が働きやすい職場を作ることで、多様な価値観をもった様々な人材を企業は惹きつけることができるようになり、その結果、生産性や社会的イメージを向上させることもできるようになります。なお、選択肢イ　公的な義務化　の事実はありません。エ　安全配慮と人権尊重は、それぞれ企業の義務としてすでに一般的に認識されています。";

$css[1][3][1] = "";
$css[1][3][2] = "mt50";
$css[1][3][3] = "mt90";
$css[1][3][4] = "mt135";
$css[1][3][5] = "mt180";

$ml[1][1] = "l40";
$ml[1][2] = "l40";
$ml[1][3] = "l40";
$ml[1][4] = "l40";
$ml[1][5] = "l40";





$question[2][1][0] = "";
$question[2][1][1] = "「ダイバーシティ（多様性）」という言葉が一般的に使われるようになりました。さらには「ダイバーシティ」だけではダメで、「ダイバーシティ＆インクルージョン」こそが大事だ、などとも言われます。では、この「ダイバーシティ＆インクルージョン」とはいったい何のことでしょうか。以下の選択肢からもっとも正しいものを選んでください。";

$question[2][3][1] = "① 老若男女、人種、障がいのある人、性的指向などの多様性を排除することなく認め合い、活かし合って価値を生み出すこと。";
$question[2][3][2] = "② 差別を受けている集団に対して、就職や昇進の際、特別枠の設置や点数の割り増しなどの優遇措置をして、積極的に社会に取り込んでいくこと";
$question[2][3][3] = "③ ダイバーシティとは主に、男女や人種、障がいなど、「目に見える違い」を認め合うことであり、インクルージョンとは宗教、性的指向、子育て支援の必要性など、「表面上はわかりにくい違い」を認め合うことである。";

$interprete[2][0] = "①";
$interprete[2][1] = "";
$interprete[2][2] = "ダイバーシティ（多様性）とは、人種、性別、年齢、信仰などにこだわらず多様な人材を受け入れようとする考え方のことをいいます。このダイバーシティを認めるだけにとどまらず、互いの違いを活かしあって組織の目的である価値を生み出す（インクルージョン）までを実行していこうと、最近はダイバーシティのみならず、ダイバーシティ＆インクルージョンの重要性が強調されるようになりました。なお、②は、アファーマティブアクションと呼ばれる優遇措置を表す言葉の説明です。③の記述は本設問では正しくありません。しかし、目に見える違いを尊重するだけでなく、表面上はわかりにくい違いを認めることも大変重要です。";
$css[2][3][1] = "mt10";
$css[2][3][2] = "mt100";
$css[2][3][3] = "mt190";
$css[2][3][4] = "mt120";
$css[2][3][5] = "mt160";
$imgmt[2] = "mt260";

$ml[2][1] = "l20";
$ml[2][2] = "l20";
$ml[2][3] = "l20";
$ml[2][4] = "l40";
$ml[2][5] = "l40";






$question[3][1][0] = "";
$question[3][1][1] = "上司から「部署の全員で飲みに行こう」と誘われましたが、当日都合が悪く、「用事があるので、本日は遠慮させてください」と丁重に断りました。その後、部署の飲み会には誘われなくなり、自分の参加しないその飲み会の中で、仕事に関係する様々なことが決められるようになってしまいました。上司に「仕事の場でちゃんと議論して決めていただけませんか？」と頼んだのですが、「君には部署の集まりよりも重要なことがいろいろあるみたいだから、それを重視すれば良いのでは・・・」とまったく相手にしてくれません。このような上司の態度は「ハラスメント」に該当するのではないかと思うのですが、どうなのでしょうか。以下の選択肢から正しいと思われるものを１つ選んでください。";

$question[3][3][1] = "① 飲み会を断ったことで、アルコールの場を嫌がる人と認識されたと思われる。その後、誘われないのも仕方がない。ハラスメントには該当しない。";
$question[3][3][2] = "② 業務範囲外の時間に関して、業務上の権限を行使していやがらせを行うパワーハラスメントに該当する可能性がある。";
$question[3][3][3] = "③ 確かに飲み会で仕事が進められるのは褒められた行為ではないが、ハラスメントとまでは言えない。ただし上司のマネジメント能力には疑問符が付く。";

$interprete[3][0] = "②";
$interprete[3][1] = "";
$interprete[3][2] = "本ケースの場合、実質的に業務範囲外の飲み会への参加を強制し、参加しなかった者に不利益を与えています。よって権力を利用したいやがらせ（パワーハラスメント）に該当する可能性があると考えられます。パワーハラスメントとは、「職場において、地位や人間関係で弱い立場の労働者に対して、精神的又は身体的な苦痛を与えることにより、結果として労働者の働く権利を侵害し、職場環境を悪化させる行為」のことであり、職位の上にある人は常に相手の立場にたって考えて言動することが必要となります。普段から互いに積極的にコミュニケーションを取り、上司部下間だけでなく、先輩後輩間、同僚間などで、困ったことや悩み事を気軽に相談できるような関係を作りだしていくことも重要です。";


$css[3][3][1] = "";
$css[3][3][2] = "mt70";
$css[3][3][3] = "mt140";
$css[3][3][4] = "mt140";
$css[3][3][5] = "mt160";
$imgmt[3] = "mt260";

$ml[3][1] = "l20";
$ml[3][2] = "l20";
$ml[3][3] = "l20";
$ml[3][4] = "l40";
$ml[3][5] = "l40";




$question[4][1][0] = "";
$question[4][1][1] = "毎週土曜日はゆっくりと起床し、好きな読書や映画鑑賞に時間を使っていました。ところが、上司から「メンバーが一人足りないので、ゴルフに付き合ってほしい」と半ば強制的にゴルフに駆り出されるようになりました。気が付けばほぼ毎週土曜日にゴルフをしています。自分としては、「行きたくない」のが本音なのですが、上司の機嫌を損ねると人事考課などでも不利な扱いを受けそうでなかなか拒否できません。どうしたらよいでしょうか。以下の選択肢から正しいと思われるものを１つ選んでください。";

$question[4][3][1] = "① 「土曜日のゴルフには参加したくない。自分のやりたいことのために使いたい」ことを上司にしっかりと言う。もし不利な扱いを受けるようであれば、相談窓口などに連絡する。";
$question[4][3][2] = "②  不利な扱いをされることを避けるために。絶対参加しなければならない行事を土曜日に入れ、ゴルフに参加できない口実を作って、「申し訳ないけれども参加できない」と上司に伝える。";
$question[4][3][3] = "③ 「ゴルフに無理やり付き合わされ、多大な精神的苦痛を受けている。これはパワハラなので会社に報告する」と宣言して、すぐに相談窓口に連絡する。";

$interprete[4][0] = "①";
$interprete[4][1] = "";
$interprete[4][2] = "まずは、ゴルフに駆り出されていることが自分にとって「うれしくない状況であること」「嫌であること」を上司に率直に伝えてみてください。上司は「喜んで参加してくれている」「土曜日のゴルフがとても好き」と誤解している可能性も高いものです。それでも無理に参加を強制されたり、参加しないことをもって嫌がらせを受けるようなことがあれば問題です。さらに上の上司や相談窓口などに相談を持ち掛けてみてください。また上司や先輩社員などは、普段からコミュニケーションを取り、「嫌なことを強制していないか？」「無理難題を押し付けていないか？」など、相手にとって不快な言動をしていないかを聞く場を積極的に作っていくことが求められます。 ";


$css[4][3][1] = "mt10";
$css[4][3][2] = "mt100";
$css[4][3][3] = "mt190";


$imgmt[4] = "mt260";

$ml[4][1] = "l20";
$ml[4][2] = "l20";
$ml[4][3] = "l20";




$question[5][1][0] = "";
$question[5][1][1] = "仕事の終わりに異性の後輩を食事に誘ったところ、断ることなく同席してくれました。どうも私に好意を持ってくれているようなので、その後もたびたび食事に誘っているのですが、いつも喜んでついてきます。あるとき、そのことを知った同僚から、「大丈夫か？セクハラしてないだろうな？」と言われました。セクハラにならないためにどんなことを注意しておけばよいでしょうか。以下の選択肢から正しいと思われるものを１つ選んでください。";

$question[5][3][1] = "① 先輩が後輩に対して、2人だけで食事をしようと誘う段階で「セクハラ」と認識される可能性がある。先輩はこのような行為を厳に慎むべきである。";
$question[5][3][2] = "② 一般的に「好意を持っている」と認識の上で2回目の食事まではOKだが、３回目で「セクハラ行為」として認識される可能性がある。";
$question[5][3][3] = "③ この後輩は私に好意をもっているのではなく、不利な扱いをされることを恐れて渋々ついてきている可能性も高い。相手が嫌がっている可能性をしっかりと見極め、無理に誘うことは絶対に慎むべきである。";

$interprete[5][0] = "③";
$interprete[5][1] = "";
$interprete[5][2] = "現段階でセクハラとまでは認定できないものの、勝手に好意を持っていると誤解された上にしつこく誘われているとすれば、この後輩の立場はかなり辛いものである可能性があります。会社の役職者や先輩は、自分の何気ない「誘い」であっても、場合によっては立場の弱い相手に「従わないと不利な扱いを受けるかもしれない」といった負担感や強制感を与えている可能性があることを認識し、慎重に行動するように心がけてください。また誘われた方も、不快な状況が続くようなときは、はっきりと「嫌であること」を伝えることも重要です。";



$css[5][3][1] = "mt10";
$css[5][3][2] = "mt100";
$css[5][3][3] = "mt190";


$imgmt[5] = "mt260";

$ml[5][1] = "l20";
$ml[5][2] = "l20";
$ml[5][3] = "l20";






$question[6][1][0] = "";
$question[6][1][1] = "現場の事務所はあまり広くなく男女別々の更衣室がありません。男の人たちは皆とてもおおらかで女性がいるところでも気にせず着替えをしています。一部の女性社員はかなり気まずそうにしているのですが、こういった行為には何か問題があるでしょうか。以下の選択肢から正しいと思われるものを１つ選んでください。";

$question[6][3][1] = "① 問題なし：事務所が広くないのでしかたがない。";
$question[6][3][2] = "② 問題あり：職場環境を悪化させる「環境型セクハラ」に相当する可能性がある。女性が着替えをする際には、男性は外に出るなどの配慮が絶対に必要である。";
$question[6][3][3] = "③ 問題なし：現場での業務は綺麗ごとばかりを言っておられる状況にはないのでしかたがない。

";

$interprete[6][0] = "②";
$interprete[6][1] = "";
$interprete[6][2] ="セクハラとは「相手の意思に反して不快や不安な状態に追いこむ性的なことばや行為」を指します。さらに、その内容は対価型セクハラと環境型セクハラに分かれます。対価型セクハラとは、性的な言動に対する労働者の対応により、その労働者が解雇、降格、減給等の不利益を受けることを言います。環境型セクハラとは、性的な言動により労働者の就業環境が不快なものとなり、その労働者が働く上で支障が生じることを言います。本ケースは、女性社員の働く環境を不快にしていることもあり、環境型セクハラに該当する可能性が高いと言えます。着替えの前に「一声かける」、「女性がいない時間に着替える」、「着替え中」の掲示をする、などの配慮をすることが求められます。また受け手側も、不快な状況が続くようなときは、はっきりと「改善してほしい」と要望することも重要です。";


$css[6][3][1] = "mt20";
$css[6][3][2] = "mt100";
$css[6][3][3] = "mt190";

$imgmt[6] = "mt260";

$ml[6][1] = "l10";
$ml[6][2] = "l20";
$ml[6][3] = "l0";

$texttop[6] = "txt20";

$question[7][1][0] = "";
$question[7][1][1] = "今年（2017年）の秋、あるTV局が、性的マイノリティをイメージさせる昔の（80年代後半）キャラクター「保毛尾田保毛男」（ほもおだほもお）の出ている映像を放送しました。するとLGBT支援団体から「性的少数者への差別・偏見を助長する」との抗議が出され、翌日、当該TV局の社長が謝罪をすることになりました。80年代後半には愛すべきキャラクターとして社会に受け入れられたものであっても、今日では問題ありと認識される状況になっています。いったい何が変化したのでしょうか。以下の選択肢から正しいと思われるものを１つ選んでください。";


$question[7][2][0] = " ";
$question[7][2][1] = "ア　80年代後半にも、すでに性的マイノリティの心の痛みや社会的偏見が存在していたのに、社会的にはあまり認識されていなかった。今はそれらが社会的に共有され認識されるようになった。";
$question[7][2][2] = "イ　人権を大事にすべきという意識や、性的マイノリティに対する配慮が必要であるという意識が、社会的な規範になってきた。";
$question[7][2][3] = "ウ　TVなど放送にかかわる人たちも、番組の内容そのものに人権や社会的な責任を考慮していこうという姿勢が強くなった。";



$question[7][3][1] = "① ア";
$question[7][3][2] = "② イ";
$question[7][3][3] = "③ イ、ウ";
$question[7][3][4] = "④ ア、ウ";
$question[7][3][5] = "⑤ ア、イ、ウ";

$interprete[7][0] = "⑤";
$interprete[7][1] = "";
$interprete[7][2] = "現在では、性的マイノリティの心の痛みや社会的偏見の存在に対しての社会的認識がかなり共有されるようになり、またマイノリティへの配慮の必要性も社会的な規範になりつつあります。TV局もBPO（放送倫理・番組向上機構）などを通じて、人権が十分に配慮される番組作りに気を配っています。とはいえ、常に注意をしておかないと、悪気なく配慮のない言動をしてしまい、社会の批判を浴びることにもなりかねないので、互いに注意しあいながらしっかりと対応していく必要があります。なお性的マイノリティとは、一般的に同性愛者、両性愛者、トランスジェンダー（性同一性障害の当事者含む）などが含まれます。";


$css[7][3][1] = "";
$css[7][3][2] = "mt50";
$css[7][3][3] = "mt90";
$css[7][3][4] = "mt140";
$css[7][3][5] = "mt190";

$imgmt[7] = "mt120";




$question[8][1][0] = "";
$question[8][1][1] = "障がいを持つ人々が普段の生活をしていく上で、克服すべき4つの障壁があると言われています。この4つの壁を全員で乗り越え、バリアフリーな社会を目指すことを政府は掲げています。下記にその4つの障壁について述べています。（　）内に入れることばとして適切な選択肢を１つ選んでください。";

$question[8][2][0] = " ";

$question[8][2][1] = "ア　歩道の段差、車いす使用者の通行を妨げる障害物、乗降口や出入口の段差等の（　　１　　）障壁";
$question[8][2][2] = "イ　障害があることを理由に資格・免許等の付与を制限する等の（　　２　　　）障壁";
$question[8][2][3] = "ウ　音声案内、点字、手話通訳、字幕放送、分かりやすい表示の欠如などによる（　　　３　　　）障壁";
$question[8][2][4] = "エ　心ない言葉や視線、障害者を庇護されるべき存在としてとらえる等の（　　　４　　　　）障壁である";

$question[8][3][1] = "① １　制度的な　２　意識上の　３　物理的な　４　意識上の";
$question[8][3][2] = "② １　文化・情報面でも　２　制度的な　３　意識上の　４　物理的な";
$question[8][3][3] = "③ １　制度的な　　２　文化・情報面での　３　意識上の４　物理的な";
$question[8][3][4] = "④ １　物理的な　２　制度的な　３　文化・情報面での　４　意識上の";

$interprete[8][0] = "④";
$interprete[8][1] = "";
$interprete[8][2] = "物理的障壁、制度的障壁、文化・情報面での障壁、意識上の障壁　の4つの障壁をなくすバリアフリーの社会を目指すことで、障がいを持つ人たちと一緒に仕事を進めていく環境が生まれます。なお「障害者の雇用の促進等に関する法律」では、事業主に対して、その雇用する労働者に占める身体障がい者・知的障がい者の割合が一定率（法定雇用率）以上になるよう義務づけています。2018年4月より法定雇用率は2．2％以上となります。";

$css[8][3][2] = "mt40";
$css[8][3][3] = "mt40";

$css[8][3][1] = "mt0";
$css[8][3][2] = "mt40";
$css[8][3][3] = "mt80";
$css[8][3][4] = "mt120";

$imgmt[8] = "mt180";




$question[9][1][0] = "";
$question[9][1][1] = "同和問題とは、日本社会の歴史的発展の過程で形づくられた身分階層構造に基づく差別により、日本国民の一部の人々が長い間、経済的、社会的、文化的に低位の状態を強いられ、日常生活の上で様々な差別を受けるなどの、我が国固有の重大な人権問題が発生してきたことを指します。残念ながら，今なお，こうした人々に対する差別発言，差別待遇等の事案が発生しています。これらは個人の尊厳を踏みにじるもので絶対に許すことはできません。では、具体的にどのような人権問題が発生しているのでしょうか。以下の選択肢からもっとも実態を示していると考えられものを１つ選んでください。";

$question[9][2][0] = " ";
$question[9][2][1] = "ア　結婚問題で周囲の反対を受けること";
$question[9][2][2] = "イ　差別的な言動をされること";
$question[9][2][3] = "ウ　就職活動で不利な扱いを受けること";
$question[9][2][4] = "エ　インターネットで差別的な情報が掲載されること";


$question[9][3][1] = "① ア、ウ";
$question[9][3][2] = "② イ、エ";
$question[9][3][3] = "③ ア、イ、ウ";
$question[9][3][4] = "④ ア、ウ、エ";
$question[9][3][5] = "⑤ ア、イ、ウ、エ";


$interprete[9][0] = "⑤";
$interprete[9][1] = "";
$interprete[9][2] = "ア～エのすべての人権問題がいまだに発生しています。法務省では，人権相談及び人権侵犯事件の調査・処理を通じ，被害の救済・予防を図っています。例えば，結婚差別や差別発言等について，行為者や関係者に対して人権尊重の意識を啓発することにより，自発的・自主的に人権侵害の事態を改善，停止，回復させたり，将来再びそのような事態が発生しないよう注意喚起したりしています。また，インターネット上で，不当な差別的取扱いを助長・誘発する目的で特定の地域を同和地区であると指摘するなどの内容の情報を認知した場合は，その情報の削除をプロバイダ等に要請するなどの対応をしています。わが社の社員は、選択肢に出ているような差別的な言動を行わないよう、常に意識を高くもたなくてはなりません。";

$css[9][3][1] = "";
$css[9][3][2] = "mt50";
$css[9][3][3] = "mt90";
$css[9][3][4] = "mt140";
$css[9][3][5] = "mt190";


$ml[9][3] = "";

$imgmt[9] = "mt20";


$question[10][1][0] = "";
$question[10][1][1] = "SNSに、部長と一緒にとった写真を添えて、（とくに部長に断ることもなく）以下の投稿をしました。この投稿には問題があるでしょうか。あるとすればどんな問題でしょう。
<br /><br />
「仕事でＸ県に行ってきました。同行した〇〇部長がX県の郷土史に詳しいことを知ってビックリです。興味をもったので次のＸ県出張の際は、帰りに○○寺に寄ってみようと思っています。」
<br /><br />
以下の選択肢からもっとも正しいと考えられものを選んでください。
";

$question[10][2][0] = " ";
$question[10][2][1] = "ア　部長のプライバシー情報が許可なく載せられている。";
$question[10][2][2] = "イ　当社がX県の会社と一緒に何らかの業務をしていることを暗に公開してしまっている。";
$question[10][2][3] = "ウ　仕事以外の情報が載せられている。";


$question[10][3][1] = "① アが問題";
$question[10][3][2] = "② ウが問題";
$question[10][3][3] = "③ アとイが問題";
$question[10][3][4] = "④ イとウが問題";
$question[10][3][5] = "⑤ アとイとウが問題";


$interprete[10][0] = "③";
$interprete[10][1] = "";
$interprete[10][2] = "SNSとは、人と人との社会的な繋がりを維持・促進する様々な機能を提供する会員制のオンラインサービスのことをいい、代表的なものにはfacebook、インスタグラム、ツイッターなどがあります。SNSなどのオンラインサービスでは、非常に便利で使用するメリットも大きい反面で、多数の人に公開されるため、ちょっとした不注意の情報発信から人権侵害の問題になることが多く発生しています。そのため、SNSでの投稿には注意が必要であり、たとえば他人の顔写真や名前を載せる際には許可を取るなど、プライバシーへの配慮が必要です。本ケースでは、部長の顔写真と趣味、そして仕事に関連する場所の情報を掲載しています。些細なことだと思い勝手に投稿すると、会社や個人に迷惑がかかったり、企業戦略についてのヒントを外部に意図せずもらしてしまう可能性がありますので、注意が必要となります。";

$css[10][3][1] = "mt10";
$css[10][3][2] = "mt55";
$css[10][3][3] = "mt100";
$css[10][3][4] = "mt150";
$css[10][3][5] = "mt200";


$imgmt[10] = "mt120";
/*
$ml[10][1] = "l20";
$ml[10][2] = "l20";
$ml[10][3] = "l20";
$ml[10][4] = "l40";
$ml[10][5] = "l40";
*/

?>