<?PHP
$question[1][1][1] = "思考自己现在是什么心情，「悲伤」?「担心」?";
$question[2][1][1] = "知道自己不擅长之处 <br />不擅长的事情能够坦率的拜托别人。";
$question[3][1][1] = "认为自己比别人聪明";
$question[4][1][1] = "即使「讨厌」也不表现在脸上，能马上恢复到平常的心情";
$question[5][1][1] = "决心将来从事伟大的工作";
$question[6][1][1] = "即使发生严重的问题也认为总会有办法";
$question[7][1][1] = "善于安静地倾听别人讲话";
$question[8][1][1] = "从对方的表情及谈话中能够想象出对方的心情";
$question[9][1][1] = "喜欢考虑给朋友过生日，让朋友高兴";
$question[10][1][1] = "朋友们经常能够听取自己的意见";
$question[11][1][1] = "能够让朋友不讨厌的说出自己想做的事情";
$question[12][1][1] = "能和朋友一起度过快乐的时光";
$question[13][1][1] = "被批评时，能思考自己哪里没做好";
$question[14][1][1] = "经常思考自己现在是什么心情";
$question[15][1][1] = "了解自己擅长和不擅长的事情";
$question[16][1][1] = "对自己的才能有信心";
$question[17][1][1] = "即使遇到讨厌或恼火的事情，也不立即发脾气";
$question[18][1][1] = "认为只要我努力，能够做的事情就会越来越多";
$question[19][1][1] = "即使因转校需要和新朋友打交到，也有自信能做好";
$question[20][1][1] = "朋友伤心时，自己也会变得伤心";
$question[21][1][1] = "能冷静的思考发生了什么事情";
$question[22][1][1] = "如果能让人感到高兴，即使讨厌的事情也能坚持做";
$question[23][1][1] = "在朋友圈中是核心人物";
$question[24][1][1] = "谈话的内容没听懂时，能够坦率地提问";
$question[25][1][1] = "当朋友感到寂寞时，能够说些温柔的话";
$question[26][1][1] = "当没能如愿以偿时，不是想怨谁，而是认为自己要更加努力";
$question[27][1][1] = "确认自己现在是什么心情，想要了解自己";
$question[28][1][1] = "自己做错时能坦率地承认，并立即改正错误";
$question[29][1][1] = "喜欢自己";
$question[30][1][1] = "即使失败了，也不拿周围人撒气";
$question[31][1][1] = "认为只要自己努力，就没有做不到的事情";
$question[32][1][1] = "不成功时，不拘泥于一种方法，能不断地尝试不同的方法";
$question[33][1][1] = "当朋友遇到困难时，能主动帮忙";
$question[34][1][1] = "对方没说实话时能立即知道";
$question[35][1][1] = "和难以相处的朋友也能很好地一起玩";
$question[36][1][1] = "善于让吵架的朋友和好";
$question[37][1][1] = "当朋友做了讨厌的事情时，能不生气的告诉他不要做了";
$question[38][1][1] = "能注意周围是否有被排斥或没有朋友的人";
$question[39][1][1] = "失败时会反省自己的做法不够好";


for($i=1;$i<=39;$i++){
	$question[$i][3][1] = "① 完全是";
	$question[$i][3][2] = "② 有一点点是";
	$question[$i][3][3] = "③ 不太是";
	$question[$i][3][4] = "④ 完全不是";


	$css[$i][3][1] = "mt10";
	$css[$i][3][2] = "mt50";
	$css[$i][3][3] = "mt90";
	$css[$i][3][4] = "mt130";
	$css[$i][3][5] = "mt170";
	$css[$i][3][6] = "mt210";

	$imgmt[$i] = "mt180";
}



?>