<?PHP
$array_answer = array(
					 "ans1"=>2
					,"ans2"=>1
					,"ans3"=>1
					,"ans4"=>3
					,"ans5"=>1
					,"ans6"=>1
					,"ans7"=>3


				);
$array_number = array(
					1=>"a"
					,2=>"b"
					,3=>"c"
					,4=>"d"
					,5=>"e"
					,6=>"f"
					,7=>"g"
					,8=>"h"
					,9=>"i"
					,10=>"j"

				);

$question[1][1][0] = "内部の課題・外部の課題、利害関係者のニーズと期待";
$question[1][1][1] = "内部・外部の課題、および利害関係者のニーズと期待について記述した下記文書のうち、<u>正しくないもの</u>を1つ選べ。";

$question[1][2][0] = " ";
$question[1][2][1] = "当社は、外部の課題を、支社・事業部単位で事業計画策定時の「事業環境及び行動計画(様式3)」により年度毎に明確にしている。";
$question[1][2][2] = "内部の課題とは、例えば熟練技術者の退職に伴う技術伝承や、外部環境に対応するための社内組織の再構築、あるいは意思決定迅速化の為の方策の検討、などを指すが、これらは「監視データ(FA-003M,D,P,C,F)」等により半期ごとに測定・監視し、明確にしている。";
$question[1][2][3] = "当社の利害関係者（例）は品質マニュアルの表２に明記しており、また、そのニーズと期待は「監視データ(FA-003M,D,P,C,F)」等により半期ごとに測定・監視し、明確にしている。";




$interprete[1][0] = "b";
$interprete[1][1] = " b";
$interprete[1][2] = "
bの前半部分「･･･などを指すが、」までは正しい記述ですが、このような内部の課題を測定・監視し、明確にする為の、QMSルール、定型フォーマットは当社には有りません。特記課題として、適宜、個別に担当部署が取り組んでいます。<br />
<br />
a、ｃは正しい記述です。
";







$question[2][1][0] = "年度目標・PDCA・リスク機会";
$question[2][1][1] = "
当社の、各部門の品質目標（PDCA）の設定方法として、<u>正しくないもの</u>を１つ選べ。
";


$question[2][2][0] = " ";
$question[2][2][1] = "品質方針のみを徹底的に読み込み理解し、自部門の業務として書き下して品質目標とした。";
$question[2][2][2] = "内部の課題と外部の課題、利害関係者のニーズと期待を明らかにし、それらを考慮してリスク及び機会を明確にし、リストアップした。その中で必要な取り組みを品質目標に挙げた。";
$question[2][2][3] = "自部門の品質目標を設定するにあたり、品質方針との整合性を確認し、達成の判定が可能であることを確認した。また進捗の管理・報告として、自部門内で月末または毎週確認し、四半期に１回支社・事業部報告等で経営者への報告を行った。";






$interprete[2][0] = "a";
$interprete[2][1] = "";
$interprete[2][2] = "
品質方針を十分理解して自部門の品質目標を定めることは非常に重要なことですが、品質方針は「方針」であり、理念や共通事項に関するものとなっています。従って個々の部門に固有の具体的な情報は含まれていません。これのみを基にして各部門が品質目標を設定するというのは間違いです。
<br />
<br />
ｂ、ｃは正しい記述です。
";








$question[3][1][0] = "力量";
$question[3][1][1] = "
力量、教育計画について、<u>正しいもの</u>を１つ選べ。
";


$question[3][2][0] = " ";
$question[3][2][1] = "
力量とは、ISOで使われる独特の表現であるが、業務を遂行する能力、実力などを示す。ISOでは『意図した結果を達成するために、知識及び技能を適用する能力』と定義されている。当社は各職種の必要な力量を品質マニュアルの表５に定めている。また、部門員が必要な力量に到達できるように教育計画を立て、実行することとしている。
";
$question[3][2][2] = "
力量とは、業務を遂行する能力、実力などを示す。ISOでは『意図した結果を達成するために、知識及び技能を適用する能力』と定義されている。このような能力・実力は、実地で個々人が自分一人の努力で身に着けるべきものであり、当社は組織として、その育成のための教育計画などは設定していない。
";
$question[3][2][3] = "
力量とは、文字通り力強さの尺度で有り、個々人の忍耐力、体力、胆力、交渉での押しの強さなどを示す。計画的な教育で身につくものではなく、これに関する組織としての育成プログラムは無い。
";




$interprete[3][0] = "a";
$interprete[3][1] = "";
$interprete[3][2] = "

ａが力量の正しい定義です。一般にはあまり使われない用語ですが、ISO9001では基本的な言葉であり、重要な事項です。

";






$question[4][1][0] = "組織の知識、認識";
$question[4][1][1] = "組織の知識、認識について記述した下記文章の内、<u>正しくないもの</u>を１つ選べ。";

$question[4][2][0] = " ";

$question[4][2][1] = "プロセスの運用（業務の遂行）に必要な知識、製品及びサービスの適合を達成する為に必要な知識を明確にし、維持し、必要な範囲で利用出来る状態にしなければならない。当社はこれを、内部の知識源については各種規程・QMS文書、あるいは情報を案件フォルダ等に保管しており、外部の知識源としては、顧客仕様書、外部文書、営業情報等として保存している。";


$question[4][2][2] = "各部門長は、部員が自らの活動の持つ意味及び重要性と、年度活動計画（品質目標）の達成にむけてどのように貢献できるかについて、評価面談（春・秋対話）を通して、共通認識を持たせなければならない。";


$question[4][2][3] = "
各部門の部員は、自らの活動の持つ意味及び重要性と、年度活動計画（品質目標）の達成にむけてどのように貢献できるかについては、自分自身で良く考えて一人で理解しなければならない。これに関し部門長は直接関与しない。
";


$interprete[4][0] = "c";
$interprete[4][1] = "";
$interprete[4][2] = "
部員自らよく考えることは必要ですが、部門長が主導的に関与して共通認識を持つことは必須です。このために評価面談シートを活用することが重要です。
<br />
<br />
ａ、ｂは正しい記述です。
";







$question[5][1][0] = "マネジメントレビュー";
$question[5][1][1] = "
マネジメントレビューについて説明した次の文章のうち、<u>正しくないもの</u>を１つ選べ

";



$question[5][2][0] = " ";
$question[5][2][1] = "
マネジメントレビューとは、経営者（社長）が、QMSが継続して適切、妥当、かつ有効で更に戦略的な方向性と一致していることを確認するために定期的に行うものである。当社はこれを年１回実施している。
";
$question[5][2][2] = "
マネジメントレビューへのインプット（報告事項）には次の事項を含めている。
(1)予防処置、不適合の是正処置を立案・実施した場合の内容  (2) 内部監査結果、外部審査結果 (3) 活動計画（品質目標)実施状況、監視及び測定の結果 (4) 以前のマネジメントレビューの結果に対するフォロ－アップ (5) 顧客情報、顧客からのフィードバック、製品の適合性、プロセスのパフォー マンス、外部提供者のパフォーマンス (6)品質マネジメントシステムに影響を与える可能性のある変更(外部及び内部の課題の変化を含む)、資源の妥当性 (7)リスク及び機会への取組の有効性 (8)品質マネジメントシステム改善のための提案

";
$question[5][2][3] = "
当社は、マネジメントレビューを行う会議体を設定してこれを行っているが、報告事項のうち、活動計画（品質目標）は、支社・事業部報告会及び本社部門連絡会で、外部及び内部の課題と資源の妥当性は、事業計画審議時に、経営者のレビューを受けることとしている。

";


$interprete[5][0] = "a";
$interprete[5][1] = "";
$interprete[5][2] = "
当社は年２回、概ね６月と１２月にマネジメントレビューを行っています。１２月は当該年度の中間報告として上期のレビューを行い、６月は前年度全体のレビューを行っています。

ｂ、ｃは正しい記述です。

";








$question[6][1][0] = "ISO9001基本①";
$question[6][1][1] = "
ISO9001の説明として、<u>正しくないもの</u>を1つ選べ。
<br />
<br />
※ISO9001:2015(JIS Q 9001:2015)の基礎に関する問題です。外部審査の場で理解を問われる可能があり、このeラーニングで頭に入れておいてください。

";
$question[6][2][0] = " ";
$question[6][2][1] = "ISO9001は、製品（モノ）の品質に関する規格であり、PDCAサイクル、プロセスアプローチ、リスクに基づく考え方　を基本概念として採用している。";
$question[6][2][2] = "ISO9001による品質マネジメントを実施した組織は、①顧客要求事項および適用法令・規制要求事項を満たした製品およびサービスの一貫した提供　②顧客満足向上の機会増大、③組織の状況・目標に直結する取組み、④ＱＭＳ要求事項への適合の実証　を達成する可能性が増大する。";
$question[6][2][3] = "ISO9001は「購入者の立場」からの品質保証を目的としたマネジメントシステムであり、したがってISO9001の認証を取得している企業の製品購入や、サービスを受けることは一定の安心感を与えるものである。";



$interprete[6][0] = "a";
$interprete[6][1] = "";
$interprete[6][2] ="
ISO9001は、マネジメントシステム、即ち「組織が方針及び目標を定め、その目標を達成するための仕組み」に関する規格であり、仕事の仕組みが規定されています。製品の品質のみに限定された規格ではありません。
　なお、ａの後半部分、すなわち「PDCAサイクル、プロセスアプローチ、リスクに基づく考え方を基本を基本概念として採用している」こと、および
ｂ、ｃは正しい記述です。



";




$question[7][1][0] = "ISO9001基本②";
$question[7][1][1] = "

プロセス、プロセスアプローチ、リスクに基づく考え方、それぞれの説明として<u>正しくないもの</u>を１つ選べ。
<br />
<br />
※ISO9001:2015(JIS Q 9001:2015)の基礎に関する問題です。外部審査の場で理解を問われる可能があり、このeラーニングで頭に入れておいてください。

";


$question[7][2][0] = " ";
$question[7][2][1] = "プロセスとは、インプットを使用して意図した結果を生み出す、相互に関連する又は相互に作用する一連の活動を指す。当社業務においては、営業、設計、工事などの職種そのものを指す場合と、応札プロセス、実行プロセスなどのプロジェクトの進行段階を指す場合がある。";

$question[7][2][2] = "プロセスアプローチとは、意図した結果（目的）を達成するために、個々のプロセスを結びつけて（システムとして運用して）マネジメントすることを言う。通常各プロセスのインプットは他のプロセスからのアウトプットであり、またアウトプットは他のプロセスのインプットとなる為、自プロセス(自分の業務)のインプットのチェック、アウトプットの確認は重要である。";

$question[7][2][3] = "リスクに基づく考え方とは、計画・想定・期待している結果から、外れてしまう原因は何か？それを防止する方法は何か？を事前に考えておくことを言う。なお、外れた時にどう対処するか？までを事前に考えることは杞憂であり、これは必要のないこととされている。";





$interprete[7][0] = "c";
$interprete[7][1] = "";
$interprete[7][2] = "
「外れた時にどう対処するか」も含みます。なお、想定しているより良い方向、機会が生まれた時もそれを最大限利用することができる。

ａ、ｂは正しい記述です。

";

?>