<?PHP
$array_answer = array(
					 "ans1"=>3
					,"ans2"=>5
					,"ans3"=>3
					,"ans4"=>3
					,"ans5"=>2
					,"ans6"=>2
					,"ans7"=>3
					,"ans8"=>2
					,"ans9"=>2
					,"ans10"=>2

				);
$array_number = array(
					1=>"１"
					,2=>"２"
					,3=>"３"
					,4=>"４"
					,5=>"５"
					,6=>"６"
					,7=>"７"
					,8=>"８"
					,9=>"９"
					,10=>"１０"

				);

$ans_number = array(
    1=>"1."
    ,2=>"2."
    ,3=>"3."
    ,4=>"4."
    ,5=>"5."
    ,6=>"6."
    ,7=>"7."
    ,8=>"8."
    ,9=>"9."
    ,10=>"10."

);


$question[1][1][0] = "企業が人権に注目する必然性";
$question[1][1][1] = "
「CSR（企業の社会的責任）の観点から、従業員全員の人権に配慮し、働きやすい職場を作ります」という発言を聞いたのですが、CSRがなぜ従業員の人権と関係するのかよくわかりません。
このことについて述べた以下の選択肢から<u>もっとも</u>適切なものを選んでください。
";

$question[1][2][0] = " ";
$question[1][2][1] = "人権を配慮しない会社という評判が立つと、ブラック企業と言われ、良い人が採用できなくなるから。";
$question[1][2][2] = "CSRは社会のトレンドであり、このトレンドが下火になるまでは、しっかりと従うべき規範であるから。";
$question[1][2][3] = "企業もまた社会の一員であり、社会が個人の人権を尊重するように、会社が従業員の人権に配慮することは当然のことだから。";
$question[1][2][4] = "";
$question[1][2][5] = "";



$question[1][3][1] = "１";
$question[1][3][2] = "２";
$question[1][3][3] = "３";
$question[1][3][4] = "";


$interprete[1][0] = "3";
$interprete[1][1] = " ";
$interprete[1][2] = "
企業活動における<u>あらゆる面で人権を尊重</u>し配慮することは、社会の一員である企業にとって社会的責任の基本となるものです。
したがって従業員の人権への配慮も社会的責任に含まれます。
従業員に対する人権の配慮とは、具体的には、労働時間の配慮、差別の禁止、プライバシーの保護などです。
人権に配慮しないとブラック企業と呼ばれ採用などで不利になることも事実ですが、それだから人権を尊重するというのではなく、企業が従業員を含むあらゆる人の人権を尊重するのは、当たり前で自然なことだからと考えるのが一般的です。
";

$css[1][3][1] = "";
$css[1][3][2] = "mt50";
$css[1][3][3] = "mt90";
$css[1][3][4] = "mt135";
$css[1][3][5] = "mt180";

$ml[1][1] = "l40";
$ml[1][2] = "l40";
$ml[1][3] = "l40";
$ml[1][4] = "l40";
$ml[1][5] = "l40";


$listype[1] = "kana";


$question[2][1][0] = "多様性の尊重";
$question[2][1][1] = "
最近は、ダイバーシティが大事とよく言われます。「ダイバーシティを尊重する」とは具体的にどのようなことを指すでしょうか。
このことについて述べた以下の選択肢から<u>もっとも</u>適切なものを選んでください。
";
$listype[2] = "kana";

$question[2][2][0] = " ";
$question[2][2][1] = "多様な性的嗜好（LGBTなど）を受け入れる";
$question[2][2][2] = "国籍や年齢、宗教が違うことを受け入れる";
$question[2][2][3] = "ライフスタイルや価値観の違いを受け入れる";
$question[2][2][4] = "障がい者と健常者がともに働くことを当たり前のこととする";
$question[2][2][5] = "１～４のすべて";



$question[2][3][1] = "１";
$question[2][3][2] = "２";
$question[2][3][3] = "３";
$question[2][3][4] = "４";
$question[2][3][5] = "５";



$interprete[2][0] = "5";
$interprete[2][1] = "";
$interprete[2][2] = "
企業において「ダイバーシティを尊重する」とは、国籍、性別、年齢、価値観、ライフスタイル、障がいの有無、宗教などにこだわらず、
様々な人材を登用し、多様な働き方を受容していこうという考え方のことです。ダイバーシティとは多様性という意味の英語です。
差別のない処遇をすることで、誰にとっても働きやすい職場を作ることを目指しており、
日本においても、ダイバーシティ推進に積極的な企業が増加しています。
";
$css[2][3][1] = "mt0";
$css[2][3][2] = "mt40";
$css[2][3][3] = "mt80";
$css[2][3][4] = "mt120";
$css[2][3][5] = "mt160";
$imgmt[2] = "mt0";

$ml[2][1] = "";
$ml[2][2] = "";
$ml[2][3] = "";
$ml[2][4] = "";
$ml[2][5] = "";




$listype[3] = "kana";

$question[3][1][0] = "パワハラ的行為とは何か①";
$question[3][1][1] = "
大きなミスをした部下に反省してもらうため、毎日1対1で深夜までみっちり説教していたら、「パワハラ」として訴えられてしまいました。これは法的に問題行為になりえるのでしょうか。以下の選択肢のなかから、適切なものを選んでください。
";


$question[3][2][0] = " ";
$question[3][2][1] = "優越的な関係を背景としたパワハラ的言動";
$question[3][2][2] = "業務上の必要かつ相当な範囲を超えたパワハラ的指導";
$question[3][2][3] = "就業環境を害するパワハラ的言動。";
$question[3][2][4] = "パワハラには該当しない言動";
$question[3][2][5] = "";



$question[3][3][1] = "1";
$question[3][3][2] = "2";
$question[3][3][3] = "3";
$question[3][3][4] = "4";
$question[3][3][5] = "";



$interprete[3][0] = "3";
$interprete[3][1] = "";
$interprete[3][2] = "
上司は自らの職位・職能に応じて権限を発揮し、業務上の指揮監督や教育指導を行い、上司としての役割を遂行することが求められます。しかしながら、指示や注意・指導が具体的でなかったり、行き過ぎていたりすると、パワハラだと判断される可能性が高くなります。本件は、一方的な説教を続けている状況にあり、業務上の必要かつ相当な範囲を超えたパワハラ的指導になりえます。
";


$css[3][3][1] = "";
$css[3][3][2] = "mt40";
$css[3][3][3] = "mt80";
$css[3][3][4] = "mt120";
$css[3][3][5] = "mt160";
//$imgmt[3] = "mt220";

$ml[3][1] = "l30";
$ml[3][2] = "l30";
$ml[3][3] = "";
$ml[3][4] = "";
$ml[3][5] = "";


$listype[4] = "kana";

$question[4][1][0] = "パワハラ的行為とは何か②";
$question[4][1][1] = "
「ハラスメントは当人同士の問題であり、会社や職場の問題ではない」と、言って、職場内で嫌がらせをし合っている人々がいるにも関わらず放置したままの管理職がいます。これは法的に見て正しい考え方でしょうか。
";


$question[4][2][0] = " ";
$question[4][2][1] = "正しい。基本的には個人間で解決すべき問題で法は関知しない。";
$question[4][2][2] = "原則的に正しい。ただし、トラブルが大きくなり、他の社員にも影響が出そうになると会社と法の問題となる。";
$question[4][2][3] = "正しくない。会社には職場環境をよくする義務が法で定められている。";
$question[4][2][4] = "";
$question[4][2][5] = "";



$question[4][3][1] = "1";
$question[4][3][2] = "2";
$question[4][3][3] = "3";
$question[4][3][4] = "";
$question[4][3][5] = "";


$interprete[4][0] = "3";
$interprete[4][1] = "";
$interprete[4][2] = "
会社には職場環境に配慮をする義務があり、使用者（管理者）は労働者にとって働きやすい職場環境を保つように配慮しなければなりません。（労働契約法）したがって、ハラスメントは個人間の問題でもありますが、会社の問題でもあります。このような場合、管理職は嫌がらせをし合っている状況を改善させるべく、両者と対話し、健全な職場をつくるためにリーダーシップを発揮しなければいけません。
";


$css[4][3][1] = "mt0";
$css[4][3][2] = "mt40";
$css[4][3][3] = "mt80";
$css[4][3][4] = "mt120";
$css[4][3][5] = "mt160";

$imgmt[4] = "mts0";

$ml[4][1] = "l30";
$ml[4][2] = "l30";
$ml[4][3] = "l30";




$listype[5] = "kana";

$question[5][1][0] = "セクハラ的行為とは何か①";
$question[5][1][1] = "
上司からの夜の食事の誘いを何度か断りました。そうすると仕事に必要な書類を私にだけ回してくれなくなりました。「困ります」と言ったら、「デートしてくれないからだ」と言われました。この行為は十分セクハラになるのではないかと思うのですが、どうでしょうか？
";

$question[5][2][0] = " ";
$question[5][2][1] = "環境型セクハラになる可能性がある。";
$question[5][2][2] = "対価型セクハラになる可能性がある。";
$question[5][2][3] = "褒められた言動ではないが、これだけではセクハラにはならない。";
$question[5][2][4] = "";
$question[5][2][5] = "";


$question[5][3][1] = "1";
$question[5][3][2] = "2";
$question[5][3][3] = "3";
$question[5][3][4] = "";
$question[5][3][5] = "";


$interprete[5][0] = "2";
$interprete[5][1] = "";
$interprete[5][2] = "
性的な言動に対する当人の対応（拒否や抵抗）によって、その人が解雇、降格、減給、昇進・昇格の対象からの除外、客観的に見て不利益な配置転換など、業務上の不利益を受ける嫌がらせを「対価型のセクハラ」と言います。上位者は、相手の立場が弱く断りづらい可能性があることに常に配慮しなければいけません。まず大前提として、相手にとって不快な性的言動は慎むように心がけることが重要です。また、例えば机の上等他の人の目が触れるところに水着のグラビア写真を置くことなども「環境型セクハラ」になりますので注意が必要です。
";

$sanko[5]="
（参考）<br />
環境型セクハラとは：労働者の意に反する性的な言動により、就業環境が不快なものとなったため、能力の発揮 に重大な悪影響が生じるなどその労働者の就業上の支障が生じることです。
<br /><br />
対価型セクハラとは：労働者の意に反する性的な言動に対する労働者の対応（拒否や抵抗）により、その労働者が解雇、降格、昇進・昇格の対象からの除外など、客観的に見て不利益な配置転換 などの不利益を受けることです。　
";

$css[5][3][1] = "mt0";
$css[5][3][2] = "mt40";
$css[5][3][3] = "mt80";
$css[5][3][4] = "mt120";
$css[5][3][5] = "mt160";

$imgmt[5] = "mt0";

$ml[5][1] = "l30";
$ml[5][2] = "l30";
$ml[5][3] = "l30";
$ml[5][4] = "l30";




$listype[6] = "kana";

$question[6][1][0] = "セクハラ的行為とは何か②";
$question[6][1][1] = "
上司は会うたびに「今日は化粧が濃いね」「ちょっと大きくなった？」といったように私の外見についていろいろ言ってきます。悪気も特別の意図も無いようなのですが、実はかなり不快です。上司に「やめてください」と言っても大丈夫でしょうか。どうするのが良いでしょう。
";

$question[6][2][0] = " ";
$question[6][2][1] = "言い方を間違えるとこちらが嫌がらせをしていると取られるので沈黙しておく。";
$question[6][2][2] = "自分が不快であることを相手に伝えるのには何の問題もない。";
$question[6][2][3] = "相手に自分のやっていることを自覚させるために「あなたも太りましたね」などと言い返す。";
$question[6][2][4] = "";
$question[6][2][5] = "";

$question[6][3][1] = "1";
$question[6][3][2] = "2";
$question[6][3][3] = "3";
$question[6][3][4] = "";
$question[6][3][5] = "";


$interprete[6][0] = "2";
$interprete[6][1] = "";
$interprete[6][2] ="
ハラスメントと感じるかどうかには、個人差があります。自分が平気だからと言って、相手も平気とは限りません。特に身体的なことに関する言動は不快と感じる程度に個人差があります。不快な場合は率直に伝えましょう。あわせて自分の言動が他人にとって不愉快な思いをさせていないかにも注意をすることが重要です。本設問の場合には、ハラスメントになる可能性があります。職場だけでなく、飲み会でその場を盛り上げようと、身体的なことや性別にかかわる相手が嫌がること言ったり、異性がいるにもかかわらず性的なことを話題にすることも慎むよう心掛けることが必要です。
<br />
その他にも以下のようなことはハラスメントになる可能性がありますので注意しましょう。
<ul class='f18'>
<li>社員旅行や懇親会で女性に浴衣やスカートを着るよう求める、お酒をつがせる、料理を取り分け、取引先の隣に異性を座らせることを強要すること</li>
<li>ミニスカートやタンクトップなど肌の露出が多い服を着るよう求めること</li>
<li>職場内での他の人の容姿、恋愛関係、恋人に関する噂話をすること</li>
<li>ファッションセンス、身体的特徴について話すこと</li>
<li>恋愛経験等をしつこく聞くこと</li>
<li>男女問わず結婚に関する話を聞くこと、女性に出産に関する話を聞くこと</li>
<li>「男のくせに」「女のくせに」という言葉をかけること</li>

</ul>
";


$css[6][3][1] = "mt0";
$css[6][3][2] = "mt40";
$css[6][3][3] = "mt80";
$css[6][3][4] = "mt120";
$css[6][3][5] = "mt160";

$imgmt[6] = "mt0";

$ml[6][1] = "l10";
$ml[6][2] = "l30";
$ml[6][3] = "l30";

//$texttop[6] = "txt20";





$listype[7] = "kana";


$question[7][1][0] = "同和問題の正しい認識を持つ";
$question[7][1][1] = "
「えせ同和」に注意するように、と先輩から言われました。えせ同和とは何のことでしょうか
";


$question[7][2][0] = " ";
$question[7][2][1] = "差別的言動をなくすために、社会的に目立って活動すること";
$question[7][2][2] = "偽の経歴を騙って、入社面接などを突破しようとすること";
$question[7][2][3] = "同和問題の解決を口実に、寄付の強要をするなど、不当な利益や義務のないことを要求すること";



$question[7][3][1] = "1";
$question[7][3][2] = "2";
$question[7][3][3] = "3";
$question[7][3][4] = "";



$interprete[7][0] = "3";
$interprete[7][1] = "";
$interprete[7][2] = "
えせ同和とは、「同和問題はこわい問題である」という人々の誤った意識が根深く残っていることに乗じて、何らかの利益を得るために、同和問題を口実として、企業や行政機関などに不当な圧力をかけることです。このような「えせ同和行為」は、これまでなされてきた啓発の効果を一挙にくつがえし、同和問題の解決に真剣に取り組んでいる民間運動団体に対するイメージを損ね、ひいては、同和問題に対する誤った意識を植えつける大きな原因となっています。（東京都総務局人権部ホームページより）
<br />
具体的には、機関紙・図書等物品購入の強要、寄附金・賛助金の強要、講演会・研修会への参加強要などを通して、違法・不当な要求をする行為が該当します。同和を口実に、不当な要求を受けたときは、まずは会社に相談し、その指示に従ってください。法務局・地方法務局の本局及び支局が、えせ同和行為排除のための相談を受けてくれるので、会社はそちらと連絡を取りあって問題の解決をすべく進めていきます。

";

$css[7][3][1] = "mt0";
$css[7][3][2] = "mt40";
$css[7][3][3] = "mt80";
$css[7][3][4] = "mt120";


$imgmt[7] = "mt0";

$ml[7][1] = "l30";
$ml[7][2] = "l30";
$ml[7][3] = "l30";




$listype[8] = "kana";


$question[8][1][0] = "障がい者とともに仕事をしていく";
$question[8][1][1] = "
障がいのある人の雇用の安定を実現するため、政府が民間企業や国、地方公共団体などの事業主に対し、義務付けている制度は以下のうちのどれでしょう？
";


$question[8][2][0] = " ";
$question[8][2][1] = "障がいのある人の就業可能性を実際に試してみる「障害者インターンシップ制度」";
$question[8][2][2] = "労働者のうち、障がいのある人の割合が一定の率以上になるよう義務づける「障害者雇用率制度」";
$question[8][2][3] = "障がいのある人が働く場所を安易に奪われないようにするための「障害者終身雇用制度」";
$question[8][2][4] = "";


$question[8][3][1] = "1";
$question[8][3][2] = "2";
$question[8][3][3] = "3";
$question[8][3][4] = "";

$interprete[8][0] = "2";
$interprete[8][1] = "";
$interprete[8][2] = "
障がい者がごく普通に地域で暮らし、地域の一員として共に生活できる「共生社会」実現の理念の下、すべての事業主には、法定雇用率以上の割合で障害者を雇用する義務があります。現在、44.5人以上の民間企業は2.2％の法定雇用率が定められており、2021年には更に0.1％引き上げとなります。企業は、募集・採用において、障がい者に対して障がい者でない者と均等な機会を与えなければなりません。また、均等待遇の確保や、障がいの特性に配慮した、施設整備、援助者の配置などの必要な措置を講じなければなりません。ただし、事業主に対して「過重な負担」を及ぼすこととなる場合は、この限りではありません。（障害者雇用促進法）";

$css[8][3][2] = "mt40";
$css[8][3][3] = "mt40";

$css[8][3][1] = "mt0";
$css[8][3][2] = "mt40";
$css[8][3][3] = "mt80";
$css[8][3][4] = "mt120";

$imgmt[8] = "mt0";




$listype[9] = "kana";

$question[9][1][0] = "外国人と一緒に仕事をしていく心構え";
$question[9][1][1] = "
多国籍×多人数のプロジェクトチームに加入することになりました。入れ替わりで日本に帰る先輩社員から申し送り事項として、以下のような話を聞かされました。「●●人は論理的だからプログラムを書くような仕事が良い。〇〇人は忍耐強いから長時間労働をさせても大丈夫。△△人は宗教のことでからんでくるから要注意・・・」先輩のこのような申し送り事項は、はたして有効なものなのでしょうか。グローバルな多国籍チームで仕事をしていく際に、ふさわしい考え方を以下の選択肢から選んでください。
";


$question[9][2][0] = " ";
$question[9][2][1] = "国民性を深く知るために、もっと多くの先輩社員の意見を聞く";
$question[9][2][2] = "特性を、国籍や民族に帰属させるのではなく、個人に帰属させるようにする。";
$question[9][2][3] = "誰が優秀で使えるかを判断して、使えない人とはできるだけ仕事をしないようにする。";
$question[9][2][4] = "";


$question[9][3][1] = "1";
$question[9][3][2] = "2";
$question[9][3][3] = "3";
$question[9][3][4] = "";


$interprete[9][0] = "2";
$interprete[9][1] = "";
$interprete[9][2] = "
国籍や民族、肌の色や顔の特徴、その他の視覚情報で相手の特性を決めつけず、個人を個人としてしっかり見て把握し、その人の特質にあわせた付き合いをすることが重要です。日本人も人によって千差万別であるように、外国人も同じです。宗教観や食生活の習慣も、同国人だから同じというわけではありません。失礼がない範囲でパーソナル情報を教えてもらい、それに配慮することで、気持ちよく一緒に働ける環境を作ることが重要です。
";


$css[9][3][1] = "";
$css[9][3][2] = "mt40";
$css[9][3][3] = "mt80";
$css[9][3][4] = "mt120";
$css[9][3][5] = "mt160";

$ml[9][1] = "l30";
$ml[9][2] = "l30";
$ml[9][3] = "l30";

$imgmt[9] = "mt0";



$listype[10] = "kana";

$question[10][1][0] = "SNSの利用";
$question[10][1][1] = "
社会のあり方に対してSNSで積極的に意見を発信している部下がいます。実名かつ所属の会社名も公表しています。正義感が強いのはよいことだと思うのですが、ときおり舌鋒が鋭くなり、反対意見を持っている人を罵倒したり、誹謗中傷したりすることもあります。このままにしておいてよいのでしょうか。
";

$question[10][2][0] = " ";
$question[10][2][1] = "相手を罵倒するのであれば、匿名かつ会社名を名乗らせないようにする。";
$question[10][2][2] = "他人を誹謗中傷する内容を書き込まないように要望する。";
$question[10][2][3] = "即刻SNSをやめさせるようにする。";
$question[10][2][4] = "";



$question[10][3][1] = "1";
$question[10][3][2] = "2";
$question[10][3][3] = "3";
$question[10][3][4] = "";


$interprete[10][0] = "2";
$interprete[10][1] = "";
$interprete[10][2] = "
社会的発言をすることは、憲法で守られた表現の自由です。しかしながら、他人を誹謗中傷する内容や、差別的な発言、公序良俗に反する内容、わいせつな内容、不確かな情報、他人のプライバシーに関わる情報などは、相手の方の迷惑（人権侵害）になる可能性もあるので、厳に慎まなくてはいけません。ましてや会社名が公表されていれば、当人だけでなく、会社の業務に影響が及ぶこともあるので注意が必要です。SNSにおける書き込みは、不特定多数の人に見られる可能性があるということを常に意識し、節度を保った内容にすることが求められます。
";
$css[10][3][1] = "mt0";
$css[10][3][2] = "mt40";
$css[10][3][3] = "mt80";
$css[10][3][4] = "mt120";
$css[10][3][5] = "mt160";


$imgmt[10] = "mt0";
/*
$ml[10][1] = "l20";
$ml[10][2] = "l20";
$ml[10][3] = "l20";
$ml[10][4] = "l40";
$ml[10][5] = "l40";
*/

?>