<?PHP
$array_answer = array(
					 "ans1"=>5
					,"ans2"=>1
					,"ans3"=>2
					,"ans4"=>3
					,"ans5"=>3
					,"ans6"=>2
					,"ans7"=>4
					,"ans8"=>2
					,"ans9"=>3
					,"ans10"=>1

				);
$array_number = array(
					1=>"①"
					,2=>"②"
					,3=>"③"
					,4=>"④"
					,5=>"⑤"
					,6=>"⑥"
					,7=>"⑦"
					,8=>"⑧"
					,9=>"⑨"
					,10=>"⑩"

				);

$question[1][1][0] = "";
$question[1][1][1] = "「人権を大事にすべき」とは思ってはいるのですが、実際には「人権とは何か」ということが良くわかっていません。たとえば、どんなことをすると人権侵害にあたるのでしょうか。以下の選択肢からもっとも当てはまるものを１つ選んでください。";

$question[1][2][0] = "事象";
$question[1][2][1] = "ア．人を精神的に追い詰めるように怒鳴ること";
$question[1][2][2] = "イ．選挙の際に特定候補の応援を強制すること";
$question[1][2][3] = "ウ．嫌がる後輩に無理やり酒を飲ませること";
$question[1][2][4] = "エ．宴会の際に嫌がる人もいる中で裸踊りをすること";

$question[1][3][1] = "① アとウ";
$question[1][3][2] = "② イとエ";
$question[1][3][3] = "③ アとイとウ";
$question[1][3][4] = "④ アとウとエ";
$question[1][3][5] = "⑤ アとイとウとエ";


$interprete[1][0] = "⑤";
$interprete[1][1] = "アとイとウとエ";
$interprete[1][2] = "人権とは、人間一人ひとりが等しく尊く大切な存在であることを前提に、法の下での平等、経済的自由権、身体的自由権（人身の自由）などの権利を保有していることを言います。本人の同意なく強制して何かをさせたり、許容範囲を超えて精神的に追い詰めたり、性的な嫌がらせを行うことなどが該当します。基本的な考え方として、自分自身が楽しくても、他人が嫌がることはしないということです。例えば個室の宴会場で裸踊りをすることは、したい人は楽しいかもしれませんが、実際には嫌がっている人がいるということを忘れてはなりません。問では、ア～エのすべてが人権侵害と言えます。";
$css[1][3][1] = "mt10";
$css[1][3][2] = "mt50";
$css[1][3][3] = "mt90";
$css[1][3][4] = "mt130";
$css[1][3][5] = "mt170";

$question[2][1][0] = "";
$question[2][1][1] = "わが社が従業員の皆さんに「人権を尊重してほしい」と考えている理由のうち、<u>当てはまらない</u>ものはどれでしょうか。以下の選択肢の中から一つ選んでください。";

$question[2][3][1] = "① 人権尊重の立場を示さないと、マスコミや社会から糾弾されるから。";
$question[2][3][2] = "② 住みやすく生きやすい社会を作っていくことに貢献するのは、会社の社会的責任であるから。";
$question[2][3][3] = "③ 社内においても従業員全員が働きやすい職場環境を作っていきたいから。";

$interprete[2][0] = "①";
$interprete[2][1] = "人権尊重の立場を示さないと、マスコミや社会から糾弾されるから。";
$interprete[2][2] = "マスコミや社会から糾弾されるから人権を尊重するということではありません。わが社は、社会とともに歩む存在として外に対しても内に対しても人権を尊重し、よりよい社会や働きやすい職場を作っていきたいと考えています。人権の尊重は企業の社会的責任（CSR）の中でももっとも重要なことの一つだと考えています。";

$css[2][3][1] = "mt10";
$css[2][3][2] = "mt50";
$css[2][3][3] = "mt90";
$css[2][3][4] = "mt120";
$css[2][3][5] = "mt160";
$imgmt[2] = "mt180";



$question[3][1][0] = "";
$question[3][1][1] = "部下の外国人が、休み時間に変わったお祈りを始めました。不思議な光景が気になり、「そういう宗教的なことはやめろ！」と禁止しました。これでよかったのでしょうか？このような場面での考え方としてもっとも適切な選択肢を１つ選んでください。";

$question[3][3][1] = "① 職場に宗教を持ちこむことは厳禁であり、言葉づかいに気をつける必要はあるものの、指示そのものに問題はない。";
$question[3][3][2] = "② 個人の思想信条宗教を尊重すべきであり、業務上の差しさわりが無いのであれば認めるべき。";
$question[3][3][3] = "③ どんな宗教であるかを調査し、もし邪教に分類されるようなものであれば、禁止すべき。";

$interprete[3][0] = "②";
$interprete[3][1] = "個人の思想信条宗教を尊重すべきであり、業務上の差しさわりが無いのであれば認めるべき。";
$interprete[3][2] = "わが社は従業員の宗教観や思想、信条を、業務に差しさわりがない限り最大限に尊重します。内容についても公序良俗に反するものでない限り、問題としません。したがって、本問の答は、業務上の差しさわりが無いのであれば認めるべき、となります。部下に対して、場と時間をわきまえるように指導することは問題ありません。";

$css[3][3][1] = "mt10";
$css[3][3][2] = "mt50";
$css[3][3][3] = "mt90";
$css[3][3][4] = "mt120";
$css[3][3][5] = "mt160";
$imgmt[3] = "mt180";


$question[4][1][0] = "";
$question[4][1][1] = "自分の机の上に、取引先がもってきたヌードカレンダーを置いていたところ、「それはセクハラですよ！」と他の社員から指摘がありました。特定の異性に性的な嫌がらせをしているわけではないのですが、こういったものもセクハラに該当するのでしょうか？以下の選択肢の中から正しいものを１つ選んでください。";

$question[4][3][1] = "① セクハラには相当しないと考えられるが、控えたほうが良い。";
$question[4][3][2] = "② 「対価型セクハラ」と呼ばれるセクハラ行為と考えられる。";
$question[4][3][3] = "③ 「環境型セクハラ」と呼ばれるセクハラ行為と考えられる。";

$interprete[4][0] = "③";
$interprete[4][1] = "「環境型セクハラ」と呼ばれるセクハラ行為と考えられる。";
$interprete[4][2] = "セクシャルハラスメントとは「職場に限らず一定の集団内で、性的価値観により快不快の評価が分かれ得るような言動を行ったり、そのような環境を作り出すことを広く指して用いる」ことを言います。代表的なものに、職場や学校などにおける立場・同調圧力・階級の上下関係と自身の権限を利用し、下位にある者に対する性的な言動や行為を行う（強要する）<b>対価型セクハラ</b>と呼ばれるものと、異性の容姿や恋人関係などに関する噂話や、職場や学校などでヌードカレンダーや水着ポスターなど人によっては不快感を起こすものの掲示、性的な冗談、容姿、身体などについての会話などを行う<b>環境型セクハラ</b>があります。本問は環境型セクハラに該当します。";

$css[4][3][1] = "mt10";
$css[4][3][2] = "mt50";
$css[4][3][3] = "mt90";
$css[4][3][4] = "mt120";
$css[4][3][5] = "mt160";
$imgmt[4] = "";



$question[5][1][0] = "";
$question[5][1][1] = "となりの課長は部下を呼びつけては、｢アホ、ボケ、カス｣などと罵っています。おそるおそる｢もう少し柔らかな口調にされたらどうでしょうか｣と言ってみたところ、「強い愛情を持って部下を指導しているのだから問題はない」ととりつくしまもありません。さらに部下のほうも皆がつらい顔を見せているわけでもありません。ただ、そうはいっても、やはり課長の言動はパワハラの一種ではないかと思うのですが。<br />このような場合に私はどうすればよいでしょうか。もっとも適切と考えられる対応を以下の選択肢から１つ選んでください。";

$question[5][3][1] = "① 「いじめたい」という意志の有無が、パワハラかどうかを決める基準なので、この場合、問題はない。放置しておけばよい。";
$question[5][3][2] = "② 部下たちが無断欠勤をしたり、メンタルに異変が起こった段階でハラスメントとなる。そういう段階が来たら、さらに上の上司か人事部に相談してみる。";
$question[5][3][3] = "③ 平気そうに見えても、実際には受け手の精神的なダメージが大きい可能性もあるので、早めにさらに上の上司か人事部に相談してみる。";

$interprete[5][0] = "③";
$interprete[5][1] = "平気そうに見えても、実際には受け手の精神的なダメージが大きい可能性もあるので、早めにさらに上の上司か人事部に相談してみる。";
$interprete[5][2] = "ハラスメントについては、常に受け手の立場で考えることが大事です。たとえ表面上は平気な顔を見せていたとしても、実際には強い精神的なダメージを受けているケースも多いものです。したがって、本問のような場合は、できればさらに上司の方に相談するか、人事部などに相談してみてください。その人の体調に異変が起こってからでは問題も深刻になってしまいます。";
$css[5][3][3] = "mt40";

$css[5][3][1] = "mt10";
$css[5][3][2] = "mt60";
$css[5][3][3] = "mt160";

$imgmt[5] = "mt220";




$question[6][1][0] = "";
$question[6][1][1] = "国は、障がい者の雇用を促進するために、「障がい者の雇用の促進等に関する法律」を定めています。この法の目指している社会の姿はどのようなものでしょうか。以下の選択肢のうちから最もふさわしいと思われるものを一つ選んでください。";

$question[6][3][1] = "① 法定雇用率を守らせることで雇用を増加させ、個人消費を高めてGDPを増大させる。";
$question[6][3][2] = "② 障がいを持っていても、その能力に合う仕事を通じて自立して働ける社会を作る。";
$question[6][3][3] = "③ 障がい者を支援するための負担を、企業にも分かち合ってもらう。";

$interprete[6][0] = "②";
$interprete[6][1] = "他人から、“変わっている、異常である”などと思われ、様々な差別や迫害を受ける、または受ける可能性を感じる。";
$interprete[6][2] = "「障がい者の雇用の促進等に関する法律」は、身体障がい者又は知的障がい者等が、その能力に合う職業に就くことを通じて自立することを促進するために、一定割合（法定雇用率）以上の身体障がい者、知的障がい者及び精神障がい者を雇用しなければならないと定めています。法定雇用率は、国、地方公共団体などは2.3%、都道府県等の教育委員会は 2.2%、民間企業は2.0%です。障がいを持つ人に働くことを通じて社会参画をしてもらい、健常者とともによりよい社会を作っていくことが法のねらいです。";
$css[6][3][1] = "mt10";
$css[6][3][2] = "mt50";
$css[6][3][3] = "mt90";

$imgmt[6] = "mt100";



$question[7][1][0] = "";
$question[7][1][1] = "日本で働く外国人に対しては、生活習慣の違いなどから、こちらに侵害する意志のある無しに関わらず、いろいろな人権侵害の問題を起こしがちです。では、実際に起こっている人権侵害はどのようなものがあるでしょうか。下記の選択肢から実際に起こっている問題を選んでください。";

$question[7][2][0] = "事象";
$question[7][2][1] = "ア．住まいへの入居を拒否される";
$question[7][2][2] = "イ．公衆浴場への入浴を拒否される";
$question[7][2][3] = "ウ．外国人であることを理由に入店を拒否される";
$question[7][2][4] = "エ．特定の国籍の外国人という理由で排斥する言動を起こされる";
$question[7][2][5] = "オ．本国に強制送還される ";

$question[7][3][1] = "① アとウ";
$question[7][3][2] = "② イとオ";
$question[7][3][3] = "③ アとウとオ";
$question[7][3][4] = "④ アとイとウとエ";
$question[7][3][5] = "⑤ アとイとウとエとオ";

$interprete[7][0] = "④";
$interprete[7][1] = "アとイとウとエ";
$interprete[7][2] = "　　言語，宗教，文化，習慣などの違いから、外国人をめぐって様々な人権問題が発生しています。
外国人であることを理由にアパートへの入居や公衆浴場での入浴を拒否したり、理容サービスの提供を拒否するといった事件が生じています。特定の国籍の外国人を排斥する趣旨の言動である「ヘイトスピーチ」なども起こっています。なお、強制送還は行政処分の一つであり、法に定められた手続きの上に執行されますので人権侵害には該当しません。なお、外国人への人権侵害については、法務局が英語や中国語などの通訳を配置した「外国人のための人権相談所」を東京，大阪，神戸，名古屋，広島，福岡，高松，松山において曜日を指定して開設しており、相談に乗ってくれます。";
$css[7][3][1] = "mt10";
$css[7][3][2] = "mt50";
$css[7][3][3] = "mt90";
$css[7][3][4] = "mt130";
$css[7][3][5] = "mt170";

$imgmt[7] = "";


$question[8][1][0] = "";
$question[8][1][1] = "特定の地域の出身であることや、その地域に住んでいることを理由に差別を受ける同和問題と呼ばれるものがあります。このような差別が続いている理由は何なのでしょうか。以下の選択肢のうちから最も該当するものを一つ選んでください。";

$question[8][3][1] = "① 「同和問題はこわい問題である」という人々の意識に乗じ、その地域の人達が、同和問題に対する理解が足りないなどという理由で難癖を付けて高額の書籍を売りつけるなどの行為をしているから。";
$question[8][3][2] = "② 江戸時代に人為的に作られた身分制度によって、一部の集団が経済的・社会的・文化的に低位の状態におかれたのだが、その時にできた古くてゆがんだ考え方が社会の一部で残ったままになっているから。";
$question[8][3][3] = "③ そもそも、そのような差別意識など誰も持っていないのに、報道機関が差別の問題を言いたてるから。";

$interprete[8][0] = "②";
$interprete[8][1] = "江戸時代に人為的に作られた身分制度によって、一部の集団が経済的・社会的・文化的に低位の状態におかれたのだが、その時にできた古くてゆがんだ考え方が社会の一部で残ったままになっているから。";
$interprete[8][2] = "同和問題とは、日本社会の歴史的発展の過程で形づくられた身分階層構造に基づく差別により、日本国民の一部の人々が長い間、経済的、社会的、文化的に低位の状態を強いられ、今なお結婚を妨げられたり、日常生活の上で様々な差別を受けるなどの我が国固有の重大な人権問題です。（法務省ホームページより）①は“えせ同和問題”と呼ばれるもので、「何らかの利権を得るため、同和問題を<u>口実にして</u>企業、行政機関等へ不当な圧力をかける行為」です。反社会的勢力などがこういった不当行為の実行者となっています。③の報道のありかたについては、いろいろな意見がありますが、偏見に左右されないためにも正しい知識が必要であり、そのためのより正しい報道が必要だと考えられています。";
$css[8][3][2] = "mt40";
$css[8][3][3] = "mt40";

$css[8][3][1] = "mt10";
$css[8][3][2] = "mt80";
$css[8][3][3] = "mt160";


$imgmt[8] = "mt200";


$question[9][1][0] = "";
$question[9][1][1] = "男女雇用機会均等法という法律が1986年から施行されています。一般的には「こきんほう」と呼ばれていますが、この法律が制定された趣旨について説明した文章はどれでしょうか。以下の選択肢から正しいものを一つ選んでください。";

$question[9][3][1] = "① より多くの人が結婚し少子化に歯止めをかけるために作られた法律です。";
$question[9][3][2] = "② 職場において女性の人権を確保し、セクハラやパワハラを受けないようにするために作られた法律です。";
$question[9][3][3] = "③ 職場での男女平等を確保し、女性が差別を受けずに働ける環境を作るために作られた法律です。";

$interprete[9][0] = "③";
$interprete[9][1] = "職場での男女平等を確保し、女性が差別を受けずに働ける環境を作るために作られた法律です。";
$interprete[9][2] = "男女雇用機会均等法では、募集・採用、配置、昇進・降格・教育訓練、一定範囲の福利厚生、職種・雇用形態の変更、退職の勧奨・定年・解雇・労働契約の更新などの際に性別を理由とする差別を禁止しています。また、実質的に性別を理由とする差別になるおそれがあるものとして、労働者の身長、体重又は体力を要件とした採用条件を禁じているほか、コース別雇用管理における「総合職」の労働者の募集又は採用に当たって、転居を伴う転勤に応じることができることを要件にすることなどを禁じています。";

$css[9][3][1] = "mt10";
$css[9][3][2] = "mt50";
$css[9][3][3] = "mt90";


$imgmt[9] = "mt120";


$question[10][1][0] = "";
$question[10][1][1] = "同性を愛する人や両性ともに愛せる人などを、異性を愛する多数派（マジョリティ）に対比する形で、性的マイノリティと呼ぶことがあります。このような性的マイノリティの人達は、普段の生活の中でどのようなことに苦しめられているのでしょうか。下記の選択肢の中からもっとも当てはまると思われるものを１つ選んでください。";

$question[10][3][1] = "① 他人から、“変わっている、異常である”などと思われ、様々な差別や迫害を受ける、または受ける可能性を感じる。";
$question[10][3][2] = "② TV番組などに出ている性的マイノリティのタレントに似ていることでからかわれる。";
$question[10][3][3] = "③ 銭湯やサウナ、旅館の温泉などへの入室を拒否される。";

$interprete[10][0] = "①";
$interprete[10][1] = "他人から、“変わっている、異常である”などと思われ、様々な差別や迫害を受ける、または受ける可能性を感じる。";
$interprete[10][2] = "生まれつき性に関して異なる意識を持つ人がいます。こういう人を性的マイノリティと呼びますが、その苦労や被差別感はかなり大きいものです。私たちは、このような性的意識の少数派の人達の存在や考え方を当たり前のことと受け入れ、ともによりよい社会を作っていく意識を持つことが大切です。レズビアン（女性に惹かれる女性）、ゲイ（男性に惹かれる男性）、バイ・セクシャル（両性愛者）、トランスジェンダー（性同一性障害）などがそれに相当します。トランスジェンダーは、ある人の「割り当てられた性」 （身体的特徴ないし遺伝子上の性に基づく男性か女性かの他人による識別）とは違う「性自認」 （女か男か、あるいはそのどちらでもないか）の状態にある。ということを指します。";

$css[10][3][1] = "mt10";
$css[10][3][2] = "mt50";
$css[10][3][3] = "mt90";

$imgmt[10] = "mt100";


?>