<?PHP
$array_answer = array(
					 "ans1"=>5
					,"ans2"=>3
					,"ans3"=>2
					,"ans4"=>3
					,"ans5"=>2
					,"ans6"=>1
					,"ans7"=>3
					,"ans8"=>4
					,"ans9"=>1
					,"ans10"=>2

				);
$array_number = array(
					1=>"①"
					,2=>"②"
					,3=>"③"
					,4=>"④"
					,5=>"⑤"
					,6=>"⑥"
					,7=>"⑦"
					,8=>"⑧"
					,9=>"⑨"
					,10=>"⑩"

				);

$question[1][1][0] = "";
$question[1][1][1] = "最近、「企業も社会的責任（CSR）を大事にし、人権を守り、多様性を尊重することが重要」などと強調されることが多くなっているように思います。なぜこのようなことが言われるようになってきたのでしょうか。以下の選択肢からもっとも正しいものを選んでください。";

$question[1][2][0] = "事象";
$question[1][2][1] = "ア．企業がグローバル化して、多様な人と一緒に仕事をするようになってきたから。";
$question[1][2][2] = "イ．消費者や地域社会から「よい企業」として認識されることによってビジネス上のメリットがあるから。";
$question[1][2][3] = "ウ．人権が尊重される会社は、仕事がしやすい環境がうまれ、生産性もあがりやすいから。";

$question[1][3][1] = "① ア";
$question[1][3][2] = "② ウ";
$question[1][3][3] = "③ ア、イ";
$question[1][3][4] = "④ イ、ウ";
$question[1][3][5] = "⑤ ア、イ、ウ";


$interprete[1][0] = "⑤";
$interprete[1][1] = " ア、イ、ウ";
$interprete[1][2] = "世界人権宣言では、人種、肌の色、性別、言語、宗教、政治的またはその他の意見、国籍または社会的出自、財産、家系またはその他の立場を理由とする区別をいずれも禁じています。ますますグローバル化する企業にあっては、多様な人々との仕事をする機会が増えますが、そこでは誰もが同様に尊重されることが重要です。また、企業は、コミュニケーション技術の進歩によって全世界の幅広い消費者にとって目に見える存在となりました。人権問題に積極的に取り組めば、現地レベルや地域社会レベルではもちろん、企業が事業を展開するグローバル社会全体においてもその恩恵を得ることができます。また、労働者に尊厳を持って待遇し、労働に対して公平かつ公正な報酬を与えれば、生産性が増し、使用者に対する誠実性が一層高まる傾向がありビジネスにも好影響を与えます。（国連グローバルコンパクト参照）";
$css[1][3][1] = "";
$css[1][3][2] = "mt50";
$css[1][3][3] = "mt90";
$css[1][3][4] = "mt135";
$css[1][3][5] = "mt180";

$ml[1][1] = "l40";
$ml[1][2] = "l40";
$ml[1][3] = "l40";
$ml[1][4] = "l40";
$ml[1][5] = "l40";



$question[2][1][0] = "";
$question[2][1][1] = "部内での情報のやり取りを、SNSを使って迅速に行おうということになりました。そうしたところ、「それ一体何のことですか？よくわからないし、そういうのはやったことも無いから、使いたくないんですけども・・・」という年配の社員がいました。部員たちは一斉に、「今どきSNSを使ってないなんて、時代遅れも甚だしい。だから年寄りは困る・・・・」といった発言が飛び出しました。これってある種のハラスメントではないでしょうか。以下の選択肢からもっとも正しいものを選んでください。";

$question[2][3][1] = "① 仕事の遂行に対しての能力不足を示しているだけなので、好ましくはないがハラスメントとまでは言えない。（ただし控えるべき）";
$question[2][3][2] = "② 新しい技術や道具についていけないことをあげつらう「テクノロジー・ハラスメント」に該当する。非難するのではなく、使い方をしっかりと教えてあげる必要がある。";
$question[2][3][3] = "③ 世代や年齢から来る行動などを対象とする「エイジ・ハラスメント」に該当する。嫌味を言うのではなく、相手の状況を考慮し、足りない知識は支援する等の対応が必要である。";

$interprete[2][0] = "③";
$interprete[2][1] = "";
$interprete[2][2] = "エイジ・ハラスメントとは、エイジ（age＝年齢）を理由としたハラスメントのことで、もともとは中高年の社員に対する差別や嫌がらせを意味します。誰でも高齢になると、新しい技術や道具、時代の価値観の変化などにキャッチアップできないようなことも多くなってきます。だからといって、それをあげつらったり、非難するのはよくありません。使い方や新しい価値観を教えたり、場合によっては相手の状況を配慮して、別の手段や別の考え方を採用することも必要となります。なお、このケースとは反対に、「だから今どきの若い者は・・」「ゆとりだからな、君は」といったように若い人を対象とした「エイジ・ハラスメント」も発生することがありますので注意が必要です。";
$css[2][3][1] = "mt10";
$css[2][3][2] = "mt100";
$css[2][3][3] = "mt190";
$css[2][3][4] = "mt120";
$css[2][3][5] = "mt160";
$imgmt[2] = "mt260";

$ml[2][1] = "l20";
$ml[2][2] = "l20";
$ml[2][3] = "l20";
$ml[2][4] = "l40";
$ml[2][5] = "l40";


$question[3][1][0] = "";
$question[3][1][1] = "上司から頼まれた仕事を「私は向いてないのでやりたくありません」と言って断ったところ、その後、私を公然と無視し、仕事も割り振ってくれなくなりました。一度、上司に質問してみたところ、「君の要望通り、君に向いている適任の仕事があったらお願いする」といわれました。もともと私の発言にも問題があったのかもしれませんが、まったく無視され仕事がない状態というのは、一種のいじめではないかと思います。どうすればよいでしょうか。以下の選択肢からもっとも正しいものを選んでください。";

$question[3][3][1] = "① もともとの自分の発言が発端になっているので、残念ながら我慢するしかない。";
$question[3][3][2] = "② さらに上の上司に相談するか、会社の相談窓口に相談する。";
$question[3][3][3] = "③ 仕事がなくても給料がもらえるのだから、開き直って何もしないまま過ごす。";

$interprete[3][0] = "②";
$interprete[3][1] = "";
$interprete[3][2] = "職場における権力をもとに、人格を否定する行為をしているので、一種のパワーハラスメントに該当します。可能な場合は、上司ともう一度話し合うことも検討しても結構ですが、解決のイメージが立たない場合は、早めにさらに上の上司に相談するか、会社の相談窓口に連絡してください。職場においては普段から互いに積極的にコミュニケーションを取り、上司部下間だけでなく、先輩後輩間、同僚間などで、困ったことや悩み事を気軽に相談できるような関係を作りだしていくことが重要です。";

$css[3][3][1] = "";
$css[3][3][2] = "mt50";
$css[3][3][3] = "mt90";
$css[3][3][4] = "mt120";
$css[3][3][5] = "mt160";
$imgmt[3] = "";



$question[4][1][0] = "";
$question[4][1][1] = "なかなか仕事を覚えることができない後輩がいます。そして真面目に仕事に取り組む姿勢も見せてくれません。結局いつも後輩の仕事を別の誰かが肩代わりをしています。私自身、いい加減に腹がたってきたので、「そんなに仕事に真面目に取り組めないならいっそ辞めたらどうか、君の代わりなどいくらでもいるから」と言ってしまいました。ちょっとまずいかな、と思うのですが、どのように対応すればよいでしょうか。以下の選択肢からもっとも正しいものを選んでください。";

$question[4][3][1] = "① 仕事に対して真面目に取り組まない後輩の問題は大きい。発言自体は少しきついものの気にすることはない。";
$question[4][3][2] = "② 「辞めたらどうか」、は退職勧奨にあたるので絶対に言ってはいけない言葉。すぐに謝罪をするとともに上司にも報告する。";
$question[4][3][3] = "③ 「君の代わりなんどいくらでもいる」、というのは後輩の人権を尊重していない発言。すぐに謝罪をするとともに上司にも報告する。";

$interprete[4][0] = "③";
$interprete[4][1] = "";
$interprete[4][2] = "一人ひとりの尊厳が守られる職場を作っていくことが大切です。本ケースの場合、なかなか仕事を覚えられない後輩に対して思わず口にした言葉でしょうが、やはり行き過ぎた表現があります。「君の代わりなどいくらでもいる」というのは後輩の人としての尊厳を傷つけるハラスメント的な表現であり、すぐに謝罪し上司にも報告しておいたほうがよいでしょう。なお、辞めたらどうか、という発言も安易に行うべきではないと考えられます。 ";


$css[4][3][1] = "mt10";
$css[4][3][2] = "mt100";
$css[4][3][3] = "mt190";


$imgmt[4] = "mt260";

$ml[4][1] = "l20";
$ml[4][2] = "l20";
$ml[4][3] = "l20";




$question[5][1][0] = "";
$question[5][1][1] = "お酒の席で、上司はいつも「綺麗どころは、皆さんにお酌をするように」と女性にビールを注ぐように促します。“綺麗どころ”という柔らかい言い方ですし、女性社員は皆さん特に不満な顔は見せていないので、何気なく続いているのですが、なんとなく腑に落ちません。こういう言動は一種のセクシャルハラスメントになるのではないでしょうか。以下の選択肢からもっとも正しいものを選んでください。";

$question[5][3][1] = "① 女性社員が嫌がっているわけではないので、セクハラにはならないため、問題なし。受け手の感覚が重要である。";
$question[5][3][2] = "② 性差別的であり、また女性社員も不快に思っている可能性もあるため、やめるべき。セクハラと認定される可能性も高い。";
$question[5][3][3] = "③ 性差別的な発言ではあるが、社会的な慣行なので、褒められる行為ではないものの、やめるべきというほどでもない。";

$interprete[5][0] = "②";
$interprete[5][1] = "";
$interprete[5][2] = "女性にだけお酌を（なかば）強要しており、性差別的で不快に思う女性がいる可能性の高い発言です。即刻やめるべきでしょう。「やめてください」と言われていないから嫌がっていないと思うのは間違っています。嫌だと思っていてもなかなか言い出せないことも多いのです。これまで慣行化されてきた行為のなかには、両性に特定の役割を押し付けるようなものもありますので、注意が必要です。とくに管理職や先輩社員などは、普段から「何か皆さんに嫌なことしたり、言ったりしてないかな？」と異性に対して不快な言動をしていないかを指摘してもらう場を作っていくことが予防対策としてお薦めです。";



$css[5][3][1] = "mt10";
$css[5][3][2] = "mt100";
$css[5][3][3] = "mt190";


$imgmt[5] = "mt260";

$ml[5][1] = "l20";
$ml[5][2] = "l20";
$ml[5][3] = "l20";






$question[6][1][0] = "";
$question[6][1][1] = "後輩のC君は、自分で決められず、何から何まで私に相談してくるので、「男のくせいにハッキリしないやつだな、自分でバシっと決めろよ」と言いました。すると、どうもかなり傷ついてしまったようで、そのあと元気がありません。私の発言には何か問題があったのでしょうか。以下の選択肢からもっとも正しいものを選んでください。";

$question[6][3][1] = "① 法的に問題となる可能性がある。「男のくせに」は性的役割分担意識に基づく発言であり、セクハラと認定される可能性がある。";
$question[6][3][2] = "② 道義的に問題のある発言である。「ハッキリしない奴」は侮蔑的発言であり、社会的に糾弾される可能性がある。";
$question[6][3][3] = "③ とくに問題はない。このくらいの発言で元気のなくなるC君を鍛え直す必要がある。";

$interprete[6][0] = "①";
$interprete[6][1] = "";
$interprete[6][2] ="この発言をもってすぐにセクハラとして大問題になる可能性はそれほど高くはありませんが、「男のくせに」「女のくせに」などという発言をすることは、性別役割分担意識に基づいており、セクハラと認定される可能性があります。育った環境、年代の違いから「差別をしている」という意識はなくとも、無意識のうちに「セクハラ発言」と受け取られる可能性がありますので注意が必要です。まずはコミュニケーションを十分にとって、一人ひとりをよく理解し、指導を行う際にもその人に合わせた最適な言葉を選ぶようにしましょう。";


$css[6][3][1] = "mt10";
$css[6][3][2] = "mt100";
$css[6][3][3] = "mt190";

$imgmt[6] = "mt260";

$ml[6][1] = "l20";
$ml[6][2] = "l20";
$ml[6][3] = "l40";



$question[7][1][0] = "";
$question[7][1][1] = "戸籍上は女性であるものの医師に性同一性障害と診断されている部下から、「職場で男性用施設(更衣室等)を使用させてもらえず、精神的に苦痛なので男性用の施設を使わせてほしい」という申し出を受けました。このとき、どのように対応したらよいでしょうか。以下の選択肢からもっとも正しいものを選んでください。";

/*
$question[7][2][0] = "事象";
$question[7][2][1] = "ア．住まいへの入居を拒否される";
$question[7][2][2] = "イ．公衆浴場への入浴を拒否される";
$question[7][2][3] = "ウ．外国人であることを理由に入店を拒否される";
$question[7][2][4] = "エ．特定の国籍の外国人という理由で排斥する言動を起こされる";
$question[7][2][5] = "オ．本国に強制送還される ";
*/

$question[7][3][1] = "① 戸籍上の分類に従い、女性用の施設を使ってもらうようにする。";
$question[7][3][2] = "② すでに性同一障害と診断されている状態なので、男性用の施設を使ってもらうようにする。";
$question[7][3][3] = "③ すぐに人事部などの担当部署に連絡し、当人ともよく話合いながら協力しあって対応する。";


$interprete[7][0] = "③";
$interprete[7][1] = "";
$interprete[7][2] = "このケースは実際にあった問題です。以下は法務省のホームページより<br />
事情を確認するため、法務省が被害者の職場の上司と面談したところ、当該上司は、被害者から本件申告と同趣旨の相談を受けつつも、同人と十分なコミュニケーションがとれていない状況が伺われたことから、その旨を指摘したところ、当該上司はできるだけの対応をしたいとの意向を示した。その後、職場における対話が促され、被害者は職場の男性用施設の利用ができるようになった。
<br />
当社としては、当人とも十分なコミュニケーションを行い、場合によっては公的な機関とも相談しながらしっかりとした対応を進めさせていただきます。";
$css[7][3][1] = "";
$css[7][3][2] = "mt50";
$css[7][3][3] = "mt90";
$css[7][3][4] = "mt130";
$css[7][3][5] = "mt170";

$imgmt[7] = "mt120";


$question[8][1][0] = "";
$question[8][1][1] = "障がい者への差別をなくすために2016年4月に障がい者差別解消法が施行されました。この法律では、障がい者に対して「不当な差別的取り扱い」と「合理的配慮をしないこと」を禁じています。それぞれ具体的にはどんなことを指しているでしょうか。以下の選択肢からもっとも正しいものを選んでください。";

$question[8][2][0] = "「不当な差別的取り扱い」：障がいを理由として、正当な理由なく、サービスの提供を拒否したり、制限したり、条件を付けたりするような行為をしないこと。<br />
「合理的配慮をしないこと」：障がいのある方などから何らかの配慮を求める意思の表明があった場合には、負担になり過ぎない範囲で、社会的障壁を取り除くために必要な行為を行うこと。";

$question[8][2][1] = "ア．車椅子だからレストランに入れない";
$question[8][2][2] = "イ．知的障がいのある人にわかりやすく話さない。";
$question[8][2][3] = "ウ．聴覚障がいのある人に声だけで話す。";
$question[8][2][4] = "エ．障がいがあることが理由で賃貸アパートの契約ができない。";

$question[8][3][1] = "① 不当な差別的取り扱い　：　ア、イ　　　合理的配慮をしないこと　：　ウ、エ";
$question[8][3][2] = "② 不当な差別的取り扱い　：　ア、ウ　　　合理的配慮をしないこと　：　イ、エ";
$question[8][3][3] = "③ 不当な差別的取り扱い　：　イ、ウ　　　合理的配慮をしないこと　：　ア、エ";
$question[8][3][4] = "④ 不当な差別的取り扱い　：　ア、エ　　 合理的配慮をしないこと　：　イ、ウ";

$interprete[8][0] = "④";
$interprete[8][1] = "";
$interprete[8][2] = "障がい者差別解消法は、全ての国民が、障がいの有無によって分け隔てられることなく、相互に人格と個性を尊重し合いながら共生する社会の実現に向けて、障がいを理由とする差別の解消を推進することを目的として制定されました。この法律では、「不当な差別的取扱い」として、例えば、障がいを理由として、正当な理由なく、サービスの提供を拒否したり、制限したり、条件を付けたりするような行為を禁止しています。また、障がいのある方などから何らかの配慮を求める意思の表明があった場合には、負担になり過ぎない範囲で、社会的障壁を取り除くために必要で合理的な配慮を行うことが求められます。こうした配慮を行わないことで、障がいのある方の権利利益が侵害される場合には、差別に当たります。（内閣府ホームページ参照）";

$css[8][3][2] = "mt40";
$css[8][3][3] = "mt40";

$css[8][3][1] = "mt0";
$css[8][3][2] = "mt40";
$css[8][3][3] = "mt80";
$css[8][3][4] = "mt120";

$imgmt[8] = "mt180";




$question[9][1][0] = "";
$question[9][1][1] = "とても優秀な社員がいます。昇進してもらおうと思っているのですが、もともとこの社員は、障がい者の雇用枠で採用した人なので、昇進して重い責任を担ってもらってよいのか心配です。どのような考え方で判断すればよいでしょうか。以下の選択肢からもっとも正しいものを選んでください。";

$question[9][3][1] = "① 新しい職務に適した方であれば、普通に昇進してもらえばよい。";
$question[9][3][2] = "② 障がい者の雇用枠の方の場合、当然、昇進には特別な検討と配慮をしたうえで対応すべき。";
$question[9][3][3] = "③ 基本的に重圧のかかる昇進は止めておいた方が良いが、特別に優秀で業務上の支障がない場合に限ってOKとすべき。";

$interprete[9][0] = "①";
$interprete[9][1] = "";
$interprete[9][2] = "障がい者として症状をオープンにして入社されたいわゆる障がい者採用枠での採用者も、健常者としての採用者も、基本的に同じです。
    したがって、新しい職務に適した方であれば、普通に昇進してもらえばよい、ということになります。ただし、その際には、合理的な配慮としての職場環境の整備（例　車椅子でも動きやすいように段差をなくす）をする場合はあります。
    また、②の“特別な検討と配慮”では『障害者だから』という理由での異なる取り扱いをしていることになります。
    設問にある通り、“障がい者雇用枠での採用した方”としておりますので、障がいの範囲は各種面接や手帳等に記載内容にて明らかとされています。
    それに基づき合理的配慮を提供し、労働能力などを適正に評価する必要があります。";

$css[9][3][1] = "";
$css[9][3][2] = "mt50";
$css[9][3][3] = "mt90";

$ml[9][3] = "l20";

$imgmt[9] = "mt180";


$question[10][1][0] = "";
$question[10][1][1] = "海外からお客様が多数来日され、東京で会議をやることになりました。朝から夜までの一日の会議なので、昼食や夕食の用意をしなければなりません。そうすると上司から「ハラルのことはしっかり考慮しといてね」と言われましたが、何のことかわかりません。ハラルとは何を意味し、また、なぜそれを考慮しなくてはならないのでしょうか。以下の選択肢からもっとも正しいものを選んでください。";


$question[10][3][1] = "① ハラルとは人種を超えたユニバーサルな倫理のこと。世界各地ごとに寄って立つ道徳や倫理感が違うので、食前、食中、食後のしきたりにしっかりと対応する必要がある。";
$question[10][3][2] = "② ハラルとはイスラム教の法律に則った食べ物のこと。イスラム教に限らず、単なる好き嫌いではなく宗教上の理由で食べられない物があるので配慮が必要である。";
$question[10][3][3] = "③ ハラルとは多国籍集団における士気のこと。おいしい食べ物を出すことで本社との関係もよくなり、会議もうまくいく可能性が高まるので、おいしく食べやすいものを用意する必要がある。";

$interprete[10][0] = "②";
$interprete[10][1] = "";
$interprete[10][2] = "ハラルは、イスラム法上で食べることが許されている食材や料理のことを指します。イスラム法の下では豚肉を食べることは禁じられていますが、その他の食品でも加工や調理に関して一定の作法が要求されているため、配慮が必要です。イスラム教徒の飲食の特徴としては①豚肉や豚肉成分は食べない　②お酒やそれに類するもの（例ノンアルコールビール）は飲まない。③断食月は日の入りから日の出までは飲食をしない、などがあります。また、その他の宗教にも食べ物のタブー（例 多くのヒンズー教徒は牛を食べない）の存在があるので、国際会議などの食事に関してはいろいろ注意をしなくてはなりません。";

$css[10][3][1] = "mt10";
$css[10][3][2] = "mt80";
$css[10][3][3] = "mt160";

$imgmt[10] = "mt220";

$ml[10][1] = "l20";
$ml[10][2] = "l20";
$ml[10][3] = "l20";
$ml[10][4] = "l40";
$ml[10][5] = "l40";


?>