<?PHP
$array_exam[1] = array(
					1=>"１．連続した欠勤はない"
					,2=>"２．風邪等で２、３日休む程度 "
					,3=>"３．４日以上連続して休んだことがある"
					,4=>"４．回答を見送ります"
				);
$array_exam[2] = array(
					1=>"１．ない"
					,2=>"２．ある "
					,3=>"３．回答を見送ります "
				);

$array_exam[3] = array(
					1=>"１．ない"
					,2=>"２．ある "
					,3=>"３．回答を見送ります "
				);

$array_exam[4] = array(
					1=>"１．不要"
					,2=>"２．希望する "
					,3=>"３．回答を見送ります "
				);
$array_exam[5] = array(
					1=>"１．現在会員である。"
					,2=>"２．過去1年以内まで会員であった。"
					,3=>"３．過去1年以上前に会員であった。"
					,4=>"４．会員になったことは一度もない。"
				);
?>
