<?PHP
require_once(D_PATH_HOME."t/lib/include_ba.php");
require_once(D_PATH_HOME."t/lib/include_EAB.php");

$obj = new BAmethod();
$ea  = new EABmethod();

$array_exam[1] = array(
			"key"=>1
			,"title"=>"セクションＡ"
			,"ans"=>array(
						1=>"怒り",
						2=>"軽蔑",
						3=>"嫌悪",
						4=>"恐れ",
						5=>"喜び",
						6=>"悲しみ",
						7=>"驚き"
				),
			"img"=>"secA1.jpg"
	);
$array_exam[2] = array(
			"key"=>2
			,"title"=>"セクションＡ"
			,"code"=>"上の写真の表情に下記のａ～ｇの感情が、<u>それぞれ</u>どの程度表れていると思いますか "
			,"code1"=>"全く表れていない"
			,"code2"=>"完全に表れている"
			,"ans"=>array(
						1=>"ａ．幸せ",
						2=>"ｂ．悲しみ",
						3=>"ｃ．恐れ",
						4=>"ｄ．怒り",
						5=>"ｅ．嫌悪",
						6=>"ｆ．驚き",
						7=>"ｇ．軽蔑"
				),
			"img"=>"secA2.jpg"
	);

$array_exam[3] = array(
			"key"=>3
			,"title"=>"セクションＡ"
			,"code"=>"上の写真の表情に下記のａ～ｇの感情が、<u>それぞれ</u>どの程度表れていると思いますか "
			,"code1"=>"全く表れていない"
			,"code2"=>"完全に表れている"
			,"img"=>"secA3.jpg"
			,"ans"=>array(
				 "1"=>"ａ．幸せ"
				,"2"=>"ｂ．悲しみ"
				,"3"=>"ｃ．恐れ"
				,"4"=>"ｄ．怒り"
				,"5"=>"ｅ．嫌悪"
				,"6"=>"ｆ．驚き"
				,"7"=>"ｇ．軽蔑"
			)
			
	);


$array_exam[4] = array(
			"key"=>4
			,"title"=>"セクションＢ"
			,"code"=>"次の<u>それぞれ</u>の質問について、あてはまると思う数字を１つ選んで答えてください。"
			,"code1"=>"役に立たたない"
			,"code2"=>"役に立つ"
			,"detail"=>array(
				1=>
				array(
					"no"=>1
					,"tle"=>"親友の結婚式の２次会を盛り上げるための催しを企画するときに、下の３つの気分はどの程度役に立つでしょうか。a～cの気分（感情）それぞれについて答えてください"
					,"a"=>"喜び"
					,"b"=>"退屈"
					,"c"=>"後悔"
				),
				2=>
				array(
					"no"=>2
					,"tle"=>"人を奮い立たせるような絵を上手く描くために、下の３つの気分はどの程度役に立つでしょうか。<br />a～cの気分（感情）それぞれについて答えてください。"
					,"a"=>"感傷"
					,"b"=>"いらだち"
					,"c"=>"興奮"
				),
				3=>
				array(
					"no"=>3
					,"tle"=>"とても複雑なプラモデルを失敗せずに作るために、下の３つの気分はどの程度役に立つでしょうか。a～cの気分（感情）それぞれについて答えてください"
					,"a"=>"不安"
					,"b"=>"悲しみ"
					,"c"=>"落ち着いた気持ち"
				),
				4=>
				array(
					"no"=>4
					,"tle"=>"あなたは、今後のプロジェクトの進め方を決めるための会議の進行役です。その会議中に、２人のメンバーが口論を始めました。プロジェクトの進捗の遅れを双方とも相手に責任があると	思っているようです。このままでは、会議の目的が達成されません。２人の口論を止め、この会議の目的を達成するため、会議の進行役であるあなたに、下の３つの気分はどの程度役に立つでしょうか。a～cの気分（感情）それぞれについて答えてください。"
					,"a"=>"悲しみ"
					,"b"=>"驚き"
					,"c"=>"憎しみ"
				),
			)
	);



$array_exam[5] = array(
			"key"=>5
			,"title"=>"セクションＢ"
			,"code"=>"次の<u>それぞれ</u>の質問について、あてはまると思う数字を１つ選んで答えてください。"
			,"code1"=>"役に立たたない"
			,"code2"=>"役に立つ"
			,"detail"=>array(
				5=>
				array(
					"no"=>5
					,"tle"=>"部長は、他の企業で成功事例のある新しい目標管理の手法を、自社でも取り入れることにしました。しかし、実際に取り入れた場合、部下が混乱する可能性があるため、多少の不安を感じています。部長が、自信を持って新しい目標管理の手法を導入するために、下の３つの気分はどの程度役に立つでしょうか。<br />a～cの気分（感情）<u>それぞれ</u>について答えてください。"
					,"a"=>"悲しみ"
					,"b"=>"恐れ"
					,"c"=>"怒り"
				),
				6=>
				array(
					"no"=>6
					,"tle"=>"学生であるAさんが、就職先を探しています。Aさんが、自分の望む就職先を見つけるために、 下の３つの気分はどの程度役に立つでしょうか。<br />a～cの気分（感情）<u>それぞれ</u>について答えてください。"
					,"a"=>"悲しみ"
					,"b"=>"喜び"
					,"c"=>"憎しみ"
				),

			)
	);

$array_exam[6] = array(
			"key"=>6
			,"title"=>"セクションＣ"
			,"code"=>"次の<u>それぞれ</u>の質問について、最も適切な答えを１つ選んで答えてください。"
			,"ans"=>array(
				1=>array(
					"no"=>1
					,"q" => "Aさんは、人前で大失敗をしてしまいました。そのため、恥ずかしさを感じました。その後、Aさんは、<input type='text' readonly class='box'>。"
					,"1"=>"①　やりきれなくなりました"
					,"2"=>"②　意気消沈しました"
					,"3"=>"③　腹が立ってきました"
					,"4"=>"④　感傷的になりました"
					,"5"=>"⑤　不安になりました"
				),
				2=>array(
					"no"=>2
					,"q" => "Bさんは、自分の恵まれた人生を振り返り、幸せを感じています。さらに、これまで人に喜んでもらったことなどを思い出すと、
							Bさんは、<input type='text' readonly class='box'>を感じました。"
					,"1"=>"①　驚き"
					,"2"=>"②　安堵感"
					,"3"=>"③　ゆううつさ"
					,"4"=>"④　満足感"
					,"5"=>"⑤　とても大きな驚き"
				),
				3=>array(
					"no"=>3
					,"q" => "Cさんは、経営していた企業が倒産し、これまでの人生で最大の喪失感を感じました。<br />
							しかし、時間が経過するうちに少し喪失のショックから立ち直り、この状況から何かしら得るものがあるはずだ、と気づき、Cさんは、<input type='text' readonly class='box' >。"
					,"1"=>"①　とても驚きました"
					,"2"=>"②　混乱しました"
					,"3"=>"③　不安を感じました"
					,"4"=>"④　希望をもちました"
					,"5"=>"⑤　物思いに沈みました"
				),
			),
		
	);


$array_exam[7] = array(
			"key"=>7
			,"title"=>"セクションＣ"
			,"code"=>"次の<u>それぞれ</u>の質問について、最も適切な答えを１つ選んで答えてください。"
			,"ans"=>array(
				4=>array(
					"no"=>4
					,"q" => "Eさんは、現在、家庭円満で、仕事にも満足しています。自分の給与についても特に不満もなく、同僚と比較しても良い方だと思っています。
								今日、上司との面談で、「Eさん、昨年の実績と周囲の評価を総合し、来年度から課長に昇格です」と伝えられました。
								そのとき、Eさんは、<input type='text' readonly class='box'>を感じました。"
					,"1"=>"①　驚きとショック"
					,"2"=>"②　平和と和らいだ気持ち"
					,"3"=>"③　満足感といい気分"
					,"4"=>"④　謙虚な気持ちと罪の意識"
					,"5"=>"⑤　誇りと優越感"
				),
				5=>array(
					"no"=>5
					,"q" => "Fさんは、高校で同じ部活の同性の先輩のことが誰よりも好きでした。その先輩は、成績優秀なうえ、運動神経も抜群です。
								さらに、思いやりのある性格なので誰からも好かれており、欠点がまるでないように感じられました。Fさんは、<input type='text' readonly class='box'>。"
					,"1"=>"①　先輩を尊敬していました"
					,"2"=>"②　先輩をうらやんでいました"
					,"3"=>"③　先輩に夢中でした"
					,"4"=>"④　先輩に嫉妬していました"
					,"5"=>"⑤　先輩に憤りを感じました"
				),
				6=>array(
					"no"=>6
					,"q" => "Gさんは、学校の掃除の時間にさぼっていた学友が、先生に「自分もみんなと一緒にきちんと掃除しました」と言ったことにいらだちを感じました。
							学友がもう一度同じことをしたときに、Gさんは、<input type='text' readonly class='box' >を感じました。"
					,"1"=>"①　怒り"
					,"2"=>"②　憎しみ"
					,"3"=>"③　強い憤り"
					,"4"=>"④　非常に強い驚き"
					,"5"=>"⑤　憂鬱さ"
				),

				7=>array(
					"no"=>7
					,"q" => "Jさんは、酔っていた友人に、普段なら決して口にしないような言葉でからかわれました。Jさんは、不快感を感じました。
							そこで、次の日、「いくら酔っていても、ひどすぎる」と、素直に気持ちを伝えたところ、友人は「申し訳ない」と謝りました。
							にもかかわらず、その夜、また同じことを友人がしたとき、Jさんは、<input type='text' readonly class='box' >を感じました。"
					,"1"=>"①　怒りました"
					,"2"=>"②　心配しました"
					,"3"=>"③　非常に苛立ちました"
					,"4"=>"④　恐れました"
					,"5"=>"⑤　激怒しました"
				),
			),
		
	);



$array_exam[8] = array(

			"key"=>8
			,"title"=>"セクションＣ"
			,"code"=>"次のそれぞれの質問について、<input type='text' readonly class='box'>に最も当てはまる出来事を１つ選んで答えてください。"
			,"ans"=>array(
				8=>array(
					"no"=>8
					,"q" => "Lさんは、「自分は、所属しているテニスサークルの仲間に受け入れられている」と感じて、安心していました。その後、<input type='text' readonly class='box'>ために、Lさんは、憂鬱になりました。"
					,"1"=>"①　サークルの友人の１人がけがをした"
					,"2"=>"②　サークルの人たちが自分の悪口を言っているのを偶然耳にした"
					,"3"=>"③　テニスの団体戦で試合に負けた"
					,"4"=>"④　練習場の使用が困難になり、別の場所を探さなければならなくなった"
					,"5"=>"⑤　サークル内の恋人が、別の異性と仲良くしていた"
				),
				9=>array(
					"no"=>9
					,"q" => "Mさんは、親友からのメールを楽しみに待っていました。そして、メールが届きました。しかし、<input type='text' readonly class='box'>ために、Mさんは、悲しいと感じました。"
					,"1"=>"①　メールに聞きたかったことが書かれていなかった"
					,"2"=>"②　メールに自分の大好きな友人の悪口が書いてあった"
					,"3"=>"③　メールの字が小さくて読みにくかった"
					,"4"=>"④　メールの文末に「お返事下さいね」と書かれていた"
					,"5"=>"⑤　メールが長文で読むのに時間がかかった"
				),
				10=>array(
					"no"=>10
					,"q" => "ある男性は、休日、自宅でくつろいでいました。その時、<input type='text' readonly class='box' >ために、男性は、感心しました。"
					,"1"=>"①　応募していた懸賞が当たった"
					,"2"=>"②　電車のホームから線路に人が落ちて、周囲の人が協力して無事救出したと言う話を<br />聞いた"
					,"3"=>"③　あるアイデアが浮かび、そのおかげで困っていたことが解決した"
					,"4"=>"④　以前から欲しかった絵画を落札して手に入れたことがわかった"
					,"5"=>"⑤　心配していたセキが、かぜのせいだとわかった"
				),

				11=>array(
					"no"=>11
					,"q" => "ある女性は、これから起こることに期待していました。その後、<input type='text' readonly class='box' >ために、女性は愛を感じました。"
					,"1"=>"①　文通相手とはじめて会うことになり、どこに出かけようか、と考えた"
					,"2"=>"②　学校のクラス替えで、仲の良い友達と同じクラスになった"
					,"3"=>"③　誕生会に友達を招待したら、ほとんど全員が来た"
					,"4"=>"④　誕生日に、両親からプレゼントをもらった"
					,"5"=>"⑤　あまり気乗りのしないデートに出掛けたら、相手が理想的な異性であることがわかった"
				),
			),

	);


$array_exam[9] = array(
			"key"=>9
			,"title"=>"セクションＣ"
			,"code"=>"次のそれぞれの質問について、<input type='text' readonly class='box'>に最も当てはまる出来事を１つ選んで答えてください。"
			,"ans"=>array(
				12=>array(
					"no"=>12
					,"q" => "気持ちが平常の状態から、恐れへの気持ちの変遷を表しているのは、下記の①～⑤の中でどれでしょうか。"
					,"1"=>"①　平常→疑い→注意深い→不安→神経質な→恐れ"
					,"2"=>"②　平常→神経質な→不安→注意深い→疑い→恐れ"
					,"3"=>"③　平常→不安→疑い→神経質な→注意深い→恐れ"
					,"4"=>"④　平常→注意深い→神経質な→疑い→不安→恐れ"
					,"5"=>"⑤　平常→注意深い→疑い→神経質な→不安→恐れ"
				),
				13=>array(
					"no"=>13
					,"q" => "気持ちが平常の状態から、愛への気持ちの変遷を表しているのは、下記の①～⑤の中でどれでしょうか。"
					,"1"=>"①　平常→好意→親しみ→受容→信頼→愛"
					,"2"=>"②　平常→親しみ→好意→信頼→受容→愛"
					,"3"=>"③　平常→親しみ→信頼→好意→受容→愛"
					,"4"=>"④　平常→親しみ→受容→好意→信頼→愛"
					,"5"=>"⑤　平常→好意→信頼→受容→親しみ→愛"
				),
			)
	);


$array_exam[10] = array(
			"key"=>10
			,"title"=>"セクションＣ"
			,"code"=>"次のそれぞれの質問について、最も適切な答えを１つ選んで答えてください。"
			,"ans"=>array(
				14=>array(
					"no"=>14
					,"q" => "Tさんは、同僚が不正をするのを見て、社会的に許せないことだと感じました。同僚に注意すると、「みんなやってるよ」と、当然だという表情で言われました。
						これら一連の出来事によってTさんは、<input type='text' readonly class='box'>。そこで、同僚の不正を止めさせるための方法を考え、実行することにしました。"
					,"1"=>"①　激怒しました"
					,"2"=>"②　怒りました"
					,"3"=>"③　嫌悪感を感じました"
					,"4"=>"④　憂鬱になりました"
					,"5"=>"⑤　悲しみを感じました"
				),
				15=>array(
					"no"=>15
					,"q" => "都心で地震が起こり、電車が止まっています。Kさんは、「都心の学校に通っている子どもが、帰宅できなくなるのではないか」、と心配していましたが、
							電車の運行が再開されたことをニュースで知りました。<br />その時、Kさんは、<input type='text' readonly class='box'>を感じました。"
					,"1"=>"①　喜び"
					,"2"=>"②　驚き"
					,"3"=>"③　安堵感"
					,"4"=>"④　不安"
					,"5"=>"⑤　イライラ感"
				),
			)
	);

$array_exam[11] = array(
			"key"=>11
			,"title"=>"セクションＤ"
			,"code"=>"次の各文章を読んで、その下に示したそれぞれの行動はどの程度役に立つでしょうか。<br />最も適切な答えを１つ選んでください。"
			,"question"=>"Aさんは、会議で部長と課長に対して、発表をしました。発表内容について、課長からは、事前に、「上手くまとまっているね。問題ないよ」
							というコメントをもらっていたため、自信を持って発表に臨みました。しかし、部長からは、「内容が甘い。もっと考えてこい」と言われました。
							さらに、課長も部長と同様な発言をしたため、Aさんは、課長に対して、怒りを感じました。
							Aさんが、この怒りを静めるために、次の<u>それぞれ</u>の行動１～２はどのくらい役に立つでしょうか。"
			,"code1"=>"役に立たない"
			,"code2"=>"役に立つ"
			,"ans"=>array(
				1=>array(
					"no"=>1
					,"q" => "どうして、課長がそのような発言したのかを考えることにした。"
					
				),
				2=>array(
					"no"=>2
					,"q" => "どうして、自分はこんなに怒りを感じるのか考えることにした。"
					
				),

			),

	);


$array_exam[12] = array(
			"key"=>12
			,"title"=>"セクションＤ"
			,"code"=>"次の各文章を読んで、その下に示したそれぞれの行動はどの程度役に立つでしょうか。<br />最も適切な答えを１つ選んでください。"
			,"question"=>"Bさんは、営業職です。会社から「営業目標を設定し、年度末に達成状況を報告するように」という指示がありました。
						Bさんは、高い目標を設定しましたが、同僚のCさんは、楽をするために、目標を低く設定しました。
						結果として、BさんもCさんも目標を達成したのですが、会社は年度末の目標達成率だけで評価を行ったため、Bさんの評価はCさんより低くなってしまいました。
						Bさんは、正当に評価されなかったことに対して、非常に強い憤りを感じました。Bさんが、この怒りを静めるために、次の<u>それぞれ</u>の行動1～2はどのくらい役に立つでしょうか。"
			,"code1"=>"役に立たない"
			,"code2"=>"役に立つ"
			,"ans"=>array(
				1=>array(
					"no"=>1
					,"q" => "自分が今回の業務を通じて、「どれくらい成長ができたのか」、<br />「どのような能力を身に付けたのか」を書き出してみることにした"
					
				),
				2=>array(
					"no"=>2
					,"q" => "Cさんの仕事ぶりに対する自分の不満を、周囲の人に<br />話すことにした。更に、自分と同意見の人を、見つける<br />ことにした"
					
				),
			),
	);
$array_exam[13] = array(
			"key"=>13
			,"title"=>"セクションＤ"
			,"code"=>"次の各文章を読んで、その下に示したそれぞれの行動はどの程度役に立つでしょうか。<br />最も適切な答えを１つ選んでください。"
			,"question"=>"Cさんは、近頃、急激に仕事量が増えたため、毎日締め切りに間に合うかどうか不安で、心身共に疲れきっています。最近は、夜も眠れなくなり、とても悩んでいます。
						Cさんが、少しでも悩みや不安を軽くするために、次の<u>それぞれ</u>の行動1～2はどのくらい役に立つでしょうか。"
			,"code1"=>"役に立たない"
			,"code2"=>"役に立つ"
			,"ans"=>array(
				1=>array(
					"no"=>1
					,"q" => "仕事の内容や量と期日を整理することにした"
					
				),
				2=>array(
					"no"=>2
					,"q" => "気持ちを落ち着かせるためのさまざまな手法を学んだ"
					
				),

			),
	);

$array_exam[14] = array(
			"key"=>14
			,"title"=>"セクションＤ"
			,"code"=>"次の各文章を読んで、その下に示したそれぞれの行動はどの程度役に立つでしょうか。<br />最も適切な答えを１つ選んでください。"
			,"question"=>"Aさんは、タクシーで、駅から客先まで行くことにしました。タクシーに乗り、「A社までお願いします。」と、伝えたところ、何も答えませんでした。
							わかったのだろうと思い、顧客先で使う資料に目を通すことにしました。気がつくと15分経っていました。通常であれば、15分程度で着くのですが、外の風景には見覚えがありません。
							運転手に確認したところ、まったく違うところに行こうとしていたようです。どうも、運転手は聞き間違えたようです。
							Aさんは、運転手が確認しなかったことと、約束の時間も迫っているため、焦りと怒りを感じました。
							Aさんが、目的の場所にできる限り早くたどり着くためには、次の<u>それぞれ</u>の行動1～3はどのくらい役に立つでしょうか。"
			,"code1"=>"役に立たない"
			,"code2"=>"役に立つ"
			,"ans"=>array(
				1=>array(
					"no"=>1
					,"q" => "「なぜ、確認しなかったのか。」と、怒りをぶつけて、<br />
								「もう、降りる。間違えたから無料にするべきだ。」と言った。"
					
				),
				2=>array(
					"no"=>2
					,"q" => "A社の場所を伝え、しっかり伝わったか確認し、<br />
							運転手が持っている地図で、道案内をした。"
				),
				3=>array(
					"no"=>3
					,"q" => "車を止めて、A社の場所を確認し、再度A社に向か<br />
							ってもらい、走行中には、冷静になって料金交渉をした。"
				),
			),
	);


$array_exam[15] = array(
			"key"=>15
			,"title"=>"セクションＤ"
			,"code"=>"次の各文章を読んで、その下に示したそれぞれの行動はどの程度役に立つでしょうか。<br />最も適切な答えを１つ選んでください。"
			,"question"=>"Aさんは、会社の経理処理の専門家だと自負がありました。しかし、新しい会計システムが導入されることが決まり、Aさんは不安を感じています。
							コンピュータについては、あまり知識がなく、使いこなせる自信がありません。Aさんが不安を取り除くためには、次の<u>それぞれ</u>
							の行動1～4はどのくらい役に立つでしょうか。"
			,"code1"=>"役に立たない"
			,"code2"=>"役に立つ"
			,"ans"=>array(
				1=>array(
					"no"=>1
					,"q" => "「社員に説明も無く、突然変更するのはおかしい。」<br />と同僚に文句を言った。"
					
				),
				2=>array(
					"no"=>2
					,"q" => "同僚・後輩と新しいシステムの使い方についての勉強<br />会を開催しようと提案した。"
				),
				3=>array(
					"no"=>3
					,"q" => "新システムをなるべく使わず、従来のやり方で処理<br />しようと決めた。"
				),
				4=>array(
					"no"=>4
					,"q" => "コンピュータに慣れるため、自宅にコンピュータを<br />購入した。"
				),
			),

	);


$array_exam[16] = array(
			"key"=>16
			,"title"=>"セクションＤ"
			,"code"=>"次の各文章を読んで、その下に示したそれぞれの行動はどの程度役に立つでしょうか。適切な答えを１つ選んでください "
			,"question"=>"Eさんは、限定販売の商品を買うために、長い時間並んで待っていました。いざ販売が始まると、後ろに並んでいた人に背中を押されて突き飛ばされ、
						商品を買うことができませんでした。痛い思いをした上に、結局商品を買うこともできず、強い怒りを感じました。Eさんが、この怒りを静めるために、
						次の<u>それぞれ</u>の行動1～2はどのくらい役に立つでしょうか。"
			,"code1"=>"役に立たない"
			,"code2"=>"役に立つ"
			,"ans"=>array(
				1=>array(
					"no"=>1
					,"q" => "次回以降、「どうすれば、限定販売の商品を購入できるか」、<br />計画を立てることにした。"
					
				),
				2=>array(
					"no"=>2
					,"q" => "二度と限定販売の商品を買わないことにした"
					
				),

			),
	);

$array_exam[17] = array(
			"key"=>17
			,"title"=>"セクションＥ"
			,"code"=>"次の各文章を読んで、それぞれの「対応」に対する答えを、1～5から1つ選んで答えてください。"
			,"question"=>"Aさんは、会社の仲の良い同僚であるBさんから、ある日、突然「実は転職するんだ」と伝えられて、とても驚きました。
						最近、よそよそしさを感じていましたが、転職する予定があるとは全く知らなかったからです。次の<u>それぞれ</u>の対応1～2は、
						Aさんが、今後、Bさんとの関係を保つのにどのくらい役に立つでしょうか。"
			,"code1"=>"役に立たない"
			,"code2"=>"役に立つ"
			,"ans"=>array(
				1=>array(
					"no"=>1
					,"q" => "「Bさん、おめでとう。新しい職場でも頑張れよ」と伝えた。"
					
				),
				2=>array(
					"no"=>2
					,"q" => "今まで内緒にされていたことに腹を立てた。<br />
							そのため、Bさんを無視することで不満の気持ちを表し、<br />
							Bさんがどのような対応をするのか様子をみることにした。"
					
				),

			),
	);


$array_exam[18] = array(
			"key"=>18
			,"title"=>"セクションＥ"
			,"code"=>"次の各文章を読んで、それぞれの「対応」に対する答えを、1～5から1つ選んで答えてください。"
			,"question"=>"Aさんは、ある会社の課長です。ある日、部長から呼び出されました。そこで、
						「君の部下のB君は、営業もせずに毎日さぼってぶらぶらしているそうじゃないか。そのような社員がいると、部署全体のやる気が下がって困るよ」
						と言われました。Aさんが知っているB君は、仕事に対して前向きに取り組んでいたため、あまりにも違っていると感じました。
						しかし、部長が、「今後、B君の行動に改善が見られなければ、Aさんの降格も考える」と強い口調で言ったため、怒りを感じました。
						次の<u>それぞれ</u>の対応１～２は、Aさんが、部長、Aさん、B君、３人の関係を改善するために、どのくらい役に立つでしょうか。"
			,"code1"=>"役に立たない"
			,"code2"=>"役に立つ"
			,"ans"=>array(
				1=>array(
					"no"=>1
					,"q" => "「B君の行動が、自分の知っている行動とは違うのでショック<br />
								を受けています。そのような行動を、本当にB君が取ってい<br />
								るのか調べさせてください。」と部長に伝えた。"
					
				),
				2=>array(
					"no"=>2
					,"q" => "なぜ、このようなうわさが流れているのかをB君に確認した。"
					
				),

			),
	);

$array_exam[19] = array(
			"key"=>19
			,"title"=>"セクションＥ"
			,"code"=>"次の各文章を読んで、それぞれの「対応」に対する答えを、1～5から1つ選んで答えてください。"
			,"question"=>"Cさんは、現在の生活すべてに満足しています。やりがいのある職務に就き、職場の人間関係も 上手くいっていますし、家庭も円満です。
							この生活が、いつまでも続けば良いと思っています。 最近、友人や同僚、部下に、「自分の幸せな生活について自慢したい」、
							という気持ちが生じて いました。次の<u>それぞれ</u>の対応1～2は、今後、Cさんが、現在の良好な人間関係を保つために、 どのくらい役に立つでしょうか。"
			,"code1"=>"役に立たない"
			,"code2"=>"役に立つ"
			,"ans"=>array(
				1=>array(
					"no"=>1
					,"q" => "友人や同僚、部下の話を積極的に聞くようにした。"
					
				),
				2=>array(
					"no"=>2
					,"q" => "家族に、自分の正直な気持ちを伝え、感謝をした。"
					
				),
			),
	);

$array_exam[20] = array(
			"key"=>20
			,"title"=>"セクションＥ"
			,"code"=>"次の各文章を読んで、それぞれの「対応」に対する答えを、1～5から1つ選んで答えてください。 "
			,"question"=>"Aさんは、多くの仕事を抱えて、残業の毎日です。そこに、突然上司のBさんがやってきて、
						「最近、仕事のスピードが落ちてるぞ。気持ちがゆるんでるんじゃないか。」と怒鳴られました。
						Aさんは、言いようのない怒りを感じました。次の<u>それぞれ</u>の対応1～3は、
						Aさんが、今後、上司との関係を保つのにどのくらい役に立つでしょうか。"
			,"code1"=>"役に立たない"
			,"code2"=>"役に立つ"
			,"ans"=>array(
				1=>array(
					"no"=>1
					,"q" => "上司がいなくなった後、後輩に怒りをぶつけた。"
					
				),
				2=>array(
					"no"=>2
					,"q" => "自分が上司に嫌われていると感じ、あまり<br />
							コミュニケーションを取らないようにした。"
					
				),
				3=>array(
					"no"=>3
					,"q" => "「わかりました。超特急で終わらせたら、<br />
							おごってくださいね。」と場を和ませた。"
					
				),
			),
	);



$array_exam[21] = array(
			"key"=>21
			,"title"=>"セクションＥ"
			,"code"=>"次の各文章を読んで、それぞれの「対応」に対する答えを、1～5から1つ選んで答えてください。 "
			,"question"=>"Aさんは、課の会議で、新しい企画を提案しました。その内容について、足りない部分の指摘はあったものの、
						参加者から色々なアイデアが出て、和やかな雰囲気で会議が進んでいました。ところが、遅れてきた同僚のBさんが、
						開口一番、「ぜんぜん駄目だよ。」と言ってきました。Bさんは、いつも何かと他人の企画に文句をつけることが多く、
						Aさんは、怒りを感じました。会議を建設的なものにするのに、次の<u>それぞれ</u>の対応1～3は、どのくらい役に立つでしょうか。"
			,"code1"=>"役に立たない"
			,"code2"=>"役に立つ"
			,"ans"=>array(
				1=>array(
					"no"=>1
					,"q" => "Bさんの意見は、いつも否定的なものばかりなので、<br />
							無視することにし、会議を終了することにした。"
					
				),
				2=>array(
					"no"=>2
					,"q" => "「Bさんには、いつも欠点を見つけてもらって助かるよ。<br />
								どうすれば、君も認めるような企画になるかな。」と、<br />
								場の空気を和ました上で、Bさんに代替案を求めた。"
					
				),
				3=>array(
					"no"=>3
					,"q" => "「他に意見はないですか。」と周りの人に意見を聞き、<br />
								議論を進めることにした。"
					
				),
			),
	);


$array_exam[22] = array(
			"key"=>22
			,"title"=>"セクションＥ"
			,"code"=>"次の各文章を読んで、それぞれの「対応」に対する答えを、1～5から1つ選んで答えてください。 "
			,"question"=>"Aさんは、風邪を引いてしまいました。近くの病院で予約を取り、翌日、会社の出勤前に行くことにしました。
						受付を済ませて待っていると、予定の時間を２０分程過ぎているのに、名前を呼ばれません。
						この後、別の予定があるため、看護師に確認したところ、予約が重なっていたため、知らないうちに、
						診察の順番が遅くなっていたようです。突然の話にAさんは、怒りを感じました。Aさんが、
						なるべく早く診察してもらうのに、次の<u>それぞれ</u>の対応1～3は、どのくらい役に立つでしょうか。"
			,"code1"=>"役に立たない"
			,"code2"=>"役に立つ"
			,"ans"=>array(
				1=>array(
					"no"=>1
					,"q" => "「そんなことは、聞いていない。予約していたのだから早<br />く診るべきだ。」と、看護師に怒鳴った。"
					
				),
				2=>array(
					"no"=>2
					,"q" => "自分にもこの後予定があることを伝え、できるだけ早く診<br />てもらうことができないか看護師に相談することにした。"
					
				),
				3=>array(
					"no"=>3
					,"q" => "言ってもしょうがないと割り切って、黙って待つ<br />ことにした。"
					
				),
			),


	);


$array_exam[23] = array(
			"key"=>23
			,"title"=>"セクションＦ"
			,"code"=>"次のそれぞれの質問に対して、最もあてはまるものを①～⑤までの選択肢の中から１つ選んでください。"
			,"ans"=>array(
				1=>array(
					"no"=>1
					,"q" => "<input type='text' readonly class='box'>が強まると恐怖、弱まると混乱になる。"
					,"1"=>"①　喜び"
					,"2"=>"②　驚き"
					,"3"=>"③　嫌悪"
					,"4"=>"④　受容"
					,"5"=>"⑤　期待"
				),
				2=>array(
					"no"=>2
					,"q" => "受容と恐れの感情が結びつくと、<input type='text' readonly class='box'>が生じる。"
					,"1"=>"①　愛"
					,"2"=>"②　希望"
					,"3"=>"③　優越"
					,"4"=>"④　好奇心"
					,"5"=>"⑤　服従"
				),
				3=>array(
					"no"=>3
					,"q" => "悲しみと驚きが結びつくと、<input type='text' readonly class='box' >を生み出す。"
					,"1"=>"①　期待"
					,"2"=>"②　憎悪"
					,"3"=>"③　楽観"
					,"4"=>"④　失望"
					,"5"=>"⑤　軽蔑"
				),
				4=>array(
					"no"=>4
					,"q" => "<input type='text' readonly class='box' >が強まると驚愕、弱まると心配になる。"
					,"1"=>"①　恐れ"
					,"2"=>"②　怒り"
					,"3"=>"③　受容"
					,"4"=>"④　嫌悪"
					,"5"=>"⑤　憤慨"
				),
				5=>array(
					"no"=>5
					,"q" => "喜びと受容が結びつくと<input type='text' readonly class='box' >になる。"
					,"1"=>"①　尊重"
					,"2"=>"②　幸せ"
					,"3"=>"③　興奮"
					,"4"=>"④　崇拝"
					,"5"=>"⑤　愛"
				),
			),


	);

$array_exam[24] = array(
			"key"=>24
			,"title"=>"セクションＦ"
			,"code"=>"次の<u>それぞれ</u>の質問に対して、最もあてはまるものを①～⑤までの選択肢の中から１つ選んでください。 "
			,"ans"=>array(
				6=>array(
					"no"=>6
					,"q" => "<input type='text' readonly class='box'> が強まると憎悪、弱まるとうんざりになる。"
					,"1"=>"①　怒り"
					,"2"=>"②　混乱"
					,"3"=>"③　嫌悪"
					,"4"=>"④　後悔"
					,"5"=>"⑤　悲しみ"
				),
				7=>array(
					"no"=>7
					,"q" => "喜びと期待が結びつくと、<input type='text' readonly class='box'>が生じる。"
					,"1"=>"①　畏敬"
					,"2"=>"②　楽観"
					,"3"=>"③　心配"
					,"4"=>"④　歓喜"
					,"5"=>"⑤　崇拝"
				),
				8=>array(
					"no"=>8
					,"q" => "恐れと驚きが結びつくと、<input type='text' readonly class='box' >を生み出す。"
					,"1"=>"①　嫌悪"
					,"2"=>"②　怒り"
					,"3"=>"③　攻撃"
					,"4"=>"④　恥辱"
					,"5"=>"⑤　畏敬"
				),
				9=>array(
					"no"=>9
					,"q" => "<input type='text' readonly class='box' >が強まると悲観、弱まると物思いになる。"
					,"1"=>"①　期待"
					,"2"=>"②　驚き"
					,"3"=>"③　悲しみ"
					,"4"=>"④　受容"
					,"5"=>"⑤　警戒"
				),
				10=>array(
					"no"=>10
					,"q" => "<input type='text' readonly class='box' > が強まると激怒、弱まるといらだちになる。"
					,"1"=>"①　後悔"
					,"2"=>"②　警戒"
					,"3"=>"③　攻撃"
					,"4"=>"④　怒り"
					,"5"=>"⑤　畏敬"
				),
			),
	);

$array_exam[25] = array(
			"key"=>25
			,"title"=>"セクションＦ"
			,"code"=>"次の<u>それぞれ</u>の質問に対して、最もあてはまるものを①～⑤までの選択肢の中から１つ選んでください。 "
			,"ans"=>array(
				11=>array(
					"no"=>11
					,"q" => "「意気阻喪（いきそそう）」の意味として最も適切なものはどれかでしょうか。"
					,"1"=>"①　思いを晴らすことができない"
					,"2"=>"②　元気をなくし、沈み込む"
					,"3"=>"③　何をしてもうまくいかず、むなしい"
					,"4"=>"④　気が晴れない"
					,"5"=>"⑤　何もやる気が起こらない"
				),
				12=>array(
					"no"=>12
					,"q" => "「不遜（ふそん）」の意味として最も適切なものはどれでしょうか。"
					,"1"=>"①　人をねたむ気持ち"
					,"2"=>"②　びくびくした気持ち"
					,"3"=>"③　思いあがっている気持ち"
					,"4"=>"④　人を軽蔑する気持ち"
					,"5"=>"⑤　人を信じない気持ち"
				),
				13=>array(
					"no"=>13
					,"q" => "「やるせない」の意味として最も適切なものはどれでしょうか。"
					,"1"=>"①　思いを晴らすことができずせつない"
					,"2"=>"②　怒りを持っていく場所がない"
					,"3"=>"③　何をしてもうまくいかず、むなしい"
					,"4"=>"④　気が晴れない"
					,"5"=>"⑤　何もやる気が起こらない"
				),
				14=>array(
					"no"=>14
					,"q" => "期待と怒りが結びつくと<input type='text' readonly class='box' >になる。"
					,"1"=>"①　恐れ"
					,"2"=>"②　驚き"
					,"3"=>"③　悲しみ"
					,"4"=>"④　愛"
					,"5"=>"⑤　攻撃"
				),

			),

	);
$array_exam[26] = array(
			"key"=>26
			,"title"=>"セクションＧ"
			,"code"=>"次の各項目について、各々の感情を想像して、ａ～ｃのそれぞれに答えてください。<br />もしその感情を想像できなくても、直感で答えてください。 "
			,"code1"=>"似ていない"
			,"code2"=>"非常に似ている"
			,"detail"=>array(
				1=>
				array(
					"no"=>1
					,"tle"=>"卒業を控えた同性の親しい友人がいます。<br />
						卒業前に、一緒に旅行に行こう、と誘われていたのですが、忙しくてすっかり忘れていたことに気づき、 罪悪感を感じていると想像してください。<br />
						その罪悪感は、以下の各々の感じにどれくらい似ているでしょうか。３つの感覚<u>すべて</u>に答えてください。"
					,"a"=>"重い"
					,"b"=>"深い"
					,"c"=>"甘い"
				),
				2=>
				array(
					"no"=>2
					,"tle"=>"滞っていた仕事がやっと完了して、安心するとともに満足感を感じていると想像してください。<br />
						その満足感は、以下の各感情にどれくらい似ているでしょうか。３つの感覚<u>すべて</u>に答えてください。 "
					,"a"=>"暖かい"
					,"b"=>"紫色"
					,"c"=>"塩辛い"
				),
				3=>
				array(
					"no"=>3
					,"tle"=>"暑くて、せかせかして、やる気が起きないと想像してください。<br />
						その感じは、以下の各感情にどれくらい似ているでしょうか。３つの感情<u>すべて</u>に答えてください。 "
					,"a"=>"挑発されている"
					,"b"=>"孤独である"
					,"c"=>"驚いている"
				),
				
			)

	);

$array_exam[27] = array(
			"key"=>27
			,"title"=>"セクションＧ"
			,"code"=>"次の各項目について、各々の感情を想像して、ａ～ｃのそれぞれに答えてください。<br />もしその感情を想像できなくても、直感で答えてください。 "
			,"code1"=>"似ていない"
			,"code2"=>"非常に似ている"
			,"detail"=>array(
				4=>
				array(
					"no"=>4
					,"tle"=>"地味で、小さくて、暗い緑色を感じていると想像してください。<br />その感じは、以下の各感情にどれくらい似ているでしょうか。３つの感情<u>すべて</u>に答えてください。 "
					,"a"=>"興奮している"
					,"b"=>"ねたんでいる"
					,"c"=>"喜んでいる "
				),
				5=>
				array(
					"no"=>5
					,"tle"=>"明るくて、暑くて、潮風の香りがする感じを想像してください。その感じは、以下の各感情にどれくらい似ているでしょうか。<br />３つの感情<u>すべて</u>に答えてください "
					,"a"=>"無力感"
					,"b"=>"恐れを感じている"
					,"c"=>"期待感"
				),
				
			)
	);

$array_exam[28] = array(
			"key"=>28
			,"title"=>"セクションＨ"
			,"code"=>"この写真には、下のA～Cの<u>それぞれ</u>の感情がどの程度表現されていますか。<br />すべての感情について、あてはまると思う番号を１つ選んで答えてください。 "
			,"code1"=>"全く表れていない"
			,"code2"=>"完全に表れている"
			,"img"=>"secH1.jpg"
			,"ans"=>array(
				 "1"=>"Ａ．寂しさ"
				,"2"=>"Ｂ．いらだち "
				,"3"=>"Ｃ．孤独感"
			)
	);

$array_exam[29] = array(
			"key"=>29
			,"title"=>"セクションＨ"
			,"code"=>"この写真には、下のA～Cの<u>それぞれ</u>の感情がどの程度表現されていますか。<br />すべての感情について、あてはまると思う番号を１つ選んで答えてください。 "
			,"code1"=>"全く表れていない"
			,"code2"=>"完全に表れている"
			,"img"=>"secH2.jpg"
			,"ans"=>array(
				 "1"=>"Ａ．あわれみ"
				,"2"=>"Ｂ．うろたえ "
				,"3"=>"Ｃ．失望"
			)
	);

$array_exam[30] = array(
			"key"=>30
			,"title"=>"セクションＨ"
			,"code"=>"この写真には、下のA～Cの<u>それぞれ</u>の感情がどの程度表現されていますか。<br />すべての感情について、あてはまると思う番号を１つ選んで答えてください。 "
			,"code1"=>"全く表れていない"
			,"code2"=>"完全に表れている"
			,"img"=>"secH3.jpg"
			,"ans"=>array(
				 "1"=>"Ａ．疎外感"
				,"2"=>"Ｂ．安堵 "
				,"3"=>"Ｃ．落ち着きのなさ "

			)
	);

$array_exam[31] = array(
			"key"=>31
			,"title"=>"セクションＨ"
			,"code"=>"この写真には、下のA～Cの<u>それぞれ</u>の感情がどの程度表現されていますか。<br />すべての感情について、あてはまると思う番号を１つ選んで答えてください。 "
			,"code1"=>"全く表れていない"
			,"code2"=>"完全に表れている"
			,"img"=>"secH4.jpg"
			,"ans"=>array(
				 "1"=>"Ａ．苦しみ"
				,"2"=>"Ｂ．あわれみ "
				,"3"=>"Ｃ．不安 "
			)
	);

$array_exam[32] = array(
			"key"=>32
			,"title"=>"セクションＨ"
			,"code"=>"この写真には、下のA～Cの<u>それぞれ</u>の感情がどの程度表現されていますか。<br />すべての感情について、あてはまると思う番号を１つ選んで答えてください。 "
			,"code1"=>"全く表れていない"
			,"code2"=>"完全に表れている"
			,"img"=>"secH5.jpg"
			,"ans"=>array(
				 "1"=>"Ａ．あっ気にとられる"
				,"2"=>"Ｂ．みじめさ "
				,"3"=>"Ｃ．やすらぎ "
			)
	);

$array_exam[33] = array(
			"key"=>33
			,"title"=>"セクションＨ"
			,"code"=>"この写真には、下のA～Cの<u>それぞれ</u>の感情がどの程度表現されていますか。<br />すべての感情について、あてはまると思う番号を１つ選んで答えてください。 "
			,"code1"=>"全く表れていない"
			,"code2"=>"完全に表れている"
			,"img"=>"secH6.jpg"
			,"ans"=>array(
				 "1"=>"Ａ．孤独感"
				,"2"=>"Ｂ．うろたえ "
				,"3"=>"Ｃ．恐れ "
			)
	);
$array_exam[34] = array(
			"key"=>34
			,"title"=>"セクションＨ"
			,"code"=>"この写真には、下のA～Cの<u>それぞれ</u>の感情がどの程度表現されていますか。<br />すべての感情について、あてはまると思う番号を１つ選んで答えてください。 "
			,"code1"=>"全く表れていない"
			,"code2"=>"完全に表れている"
			,"img"=>"secH7.jpg"
			,"ans"=>array(
				 "1"=>"Ａ．傷心"
				,"2"=>"Ｂ．恐れ"
				,"3"=>"Ｃ．生きる不安 "
			)
	);

$array_exam[35] = array(
			"key"=>35
			,"title"=>"セクションI"
			,"code"=>"次の3コマの漫画を読んでください。"
			,"code_sub"=>"次に、Aさんが不安を取り除くためには、次のそれぞれの行動１～5がどのくらい役に立つでしょうか。"
			,"code1"=>"役に立たない"
			,"code2"=>"役に立つ"
			,"img"=>"secI1.jpg"

			,"ans"=>array(
				 "1"=>"secI1_1.jpg"
				,"2"=>"secI1_2.jpg"
				,"3"=>"secI1_3.jpg"
				,"4"=>"secI1_4.jpg"
				,"5"=>"secI1_5.jpg"
			)
	);

$array_exam[36] = array(
			"key"=>36
			,"title"=>"セクションI"
			,"code"=>"次の3コマの漫画を読んでください。"
			,"code_sub"=>"次に、Dさんが部長との人間関係を維持するために、次のそれぞれの返答１～5がどのくらい役に立つでしょうか。"
			,"code1"=>"役に立たない"
			,"code2"=>"役に立つ"
			,"img"=>"secI2.jpg"

			,"ans"=>array(
				 "1"=>"secI2_1.jpg"
				,"2"=>"secI2_2.jpg"
				,"3"=>"secI2_3.jpg"
				,"4"=>"secI2_4.jpg"
				,"5"=>"secI2_5.jpg"
			)
	);


$array_exam[37] = array(
			"key"=>37
			,"title"=>"セクションI"
			,"code"=>"次の3コマの漫画を読んでください。"
			,"code_sub"=>"次に、Fさんが、悲しみから立ち直るために、次のそれぞれの行動１～5がどのくらい役に立つでしょうか。"
			,"code1"=>"役に立たない"
			,"code2"=>"役に立つ"
			,"img"=>"secI3.jpg"

			,"ans"=>array(
				 "1"=>"secI3_1.jpg"
				,"2"=>"secI3_2.jpg"
				,"3"=>"secI3_3.jpg"
				,"4"=>"secI3_4.jpg"
				,"5"=>"secI3_5.jpg"
			)
	);

$array_exam[38] = array(
			"key"=>38
			,"title"=>"セクションI"
			,"code"=>"次の3コマの漫画を読んでください。"
			,"code_sub"=>"次に、Dさんが、サークルのみんなとの良い関係を維持するために、次のそれぞれの行動１～5がどのくらい役に立つでしょうか。"
			,"code1"=>"役に立たない"
			,"code2"=>"役に立つ"
			,"img"=>"secI4.jpg"

			,"ans"=>array(
				 "1"=>"secI4_1.jpg"
				,"2"=>"secI4_2.jpg"
				,"3"=>"secI4_3.jpg"
				,"4"=>"secI4_4.jpg"
				,"5"=>"secI4_5.jpg"
			)
		
	);

$array_exam[39] = array(
			"key"=>39
			,"title"=>"セクションI"
			,"code"=>"次の3コマの漫画を読んでください。"
			,"code_sub"=>"次に、Eさんが上手くF君と女の子との仲を取り持つために、次のそれぞれの行動１～3がどのくらい役に立つでしょうか。"
			,"code1"=>"役に立たない"
			,"code2"=>"役に立つ"
			,"img"=>"secI5.jpg"

			,"ans"=>array(
				 "1"=>"secI5_1.jpg"
				,"2"=>"secI5_2.jpg"
				,"3"=>"secI5_3.jpg"
			)
	);




//ページ設定
if($_REQUEST[ 'next' ]){
	$pager = $_REQUEST[nextPage];
}else{
	if($_REQUEST[ 'page' ]){
		$pager = 1;
	}
}

//最大のページ数
$max = count($array_exam);
//where句の作成
$where = array();
//$where[ 'id'        ] = $_SESSION[ 'visit' ][ 'login_id' ];
$where[ 'testgrp_id'] = $_SESSION[ 'visit' ][ 'test_id'  ];
$where[ 'exam_id'   ] = $_SESSION[ 'visit' ][ 'exam_id'  ];
$where[ 'type'      ] = $first;

//受検時間の取得
$times = $ea->getTime($where);


$time = $times[ 'minute_rest' ];
if($_REQUEST[ 'time' ]){
	$time = $_REQUEST[ 'time' ];
}else{
	$time = $time*60;
}
$where[ 'test_id' ] = $times[ 'id' ];
//--------------------------------
//回答登録
//--------------------------------

if(count($_REQUEST[ 'sec' ])){
	$sec = array();
//	foreach($_REQUEST[ 'sec' ] as $key=>$val){
		if($_REQUEST[ 'sec' ][1]){
			$sec[ 'secA1' ] = sprintf("%d",$_REQUEST[ 'sec' ][1]);
		}
		if($_REQUEST[ 'sec' ][2]){
			$sec[ 'secA2a' ] = sprintf("%d",$_REQUEST[ 'sec' ][2][1]);
			$sec[ 'secA2b' ] = sprintf("%d",$_REQUEST[ 'sec' ][2][2]);
			$sec[ 'secA2c' ] = sprintf("%d",$_REQUEST[ 'sec' ][2][3]);
			$sec[ 'secA2d' ] = sprintf("%d",$_REQUEST[ 'sec' ][2][4]);
			$sec[ 'secA2e' ] = sprintf("%d",$_REQUEST[ 'sec' ][2][5]);
			$sec[ 'secA2f' ] = sprintf("%d",$_REQUEST[ 'sec' ][2][6]);
			$sec[ 'secA2g' ] = sprintf("%d",$_REQUEST[ 'sec' ][2][7]);

		}
		if($_REQUEST[ 'sec' ][3]){
			$sec[ 'secA3a' ] = sprintf("%d",$_REQUEST[ 'sec' ][3][1]);
			$sec[ 'secA3b' ] = sprintf("%d",$_REQUEST[ 'sec' ][3][2]);
			$sec[ 'secA3c' ] = sprintf("%d",$_REQUEST[ 'sec' ][3][3]);
			$sec[ 'secA3d' ] = sprintf("%d",$_REQUEST[ 'sec' ][3][4]);
			$sec[ 'secA3e' ] = sprintf("%d",$_REQUEST[ 'sec' ][3][5]);
			$sec[ 'secA3f' ] = sprintf("%d",$_REQUEST[ 'sec' ][3][6]);
			$sec[ 'secA3g' ] = sprintf("%d",$_REQUEST[ 'sec' ][3][7]);
		}

		if($_REQUEST[ 'sec' ][4]){
			$sec[ 'secB1a' ] = sprintf("%d",$_REQUEST[ 'sec' ][4][1][a]);
			$sec[ 'secB1b' ] = sprintf("%d",$_REQUEST[ 'sec' ][4][1][b]);
			$sec[ 'secB1c' ] = sprintf("%d",$_REQUEST[ 'sec' ][4][1][c]);

			$sec[ 'secB2a' ] = sprintf("%d",$_REQUEST[ 'sec' ][4][2][a]);
			$sec[ 'secB2b' ] = sprintf("%d",$_REQUEST[ 'sec' ][4][2][b]);
			$sec[ 'secB2c' ] = sprintf("%d",$_REQUEST[ 'sec' ][4][2][c]);

			$sec[ 'secB3a' ] = sprintf("%d",$_REQUEST[ 'sec' ][4][3][a]);
			$sec[ 'secB3b' ] = sprintf("%d",$_REQUEST[ 'sec' ][4][3][b]);
			$sec[ 'secB3c' ] = sprintf("%d",$_REQUEST[ 'sec' ][4][3][c]);

			$sec[ 'secB4a' ] = sprintf("%d",$_REQUEST[ 'sec' ][4][4][a]);
			$sec[ 'secB4b' ] = sprintf("%d",$_REQUEST[ 'sec' ][4][4][b]);
			$sec[ 'secB4c' ] = sprintf("%d",$_REQUEST[ 'sec' ][4][4][c]);

		}
		if($_REQUEST[ 'sec' ][5]){
			$sec[ 'secB5a' ] = sprintf("%d",$_REQUEST[ 'sec' ][5][5][a]);
			$sec[ 'secB5b' ] = sprintf("%d",$_REQUEST[ 'sec' ][5][5][b]);
			$sec[ 'secB5c' ] = sprintf("%d",$_REQUEST[ 'sec' ][5][5][c]);

			$sec[ 'secB6a' ] = sprintf("%d",$_REQUEST[ 'sec' ][5][6][a]);
			$sec[ 'secB6b' ] = sprintf("%d",$_REQUEST[ 'sec' ][5][6][b]);
			$sec[ 'secB6c' ] = sprintf("%d",$_REQUEST[ 'sec' ][5][6][c]);
		}

		if($_REQUEST[ 'sec' ][6]){
			$sec[ 'secC1' ] = sprintf("%d",$_REQUEST[ 'sec' ][6][1]);
			$sec[ 'secC2' ] = sprintf("%d",$_REQUEST[ 'sec' ][6][2]);
			$sec[ 'secC3' ] = sprintf("%d",$_REQUEST[ 'sec' ][6][3]);
		}

		if($_REQUEST[ 'sec' ][7]){
			$sec[ 'secC4' ] = sprintf("%d",$_REQUEST[ 'sec' ][7][4]);
			$sec[ 'secC5' ] = sprintf("%d",$_REQUEST[ 'sec' ][7][5]);
			$sec[ 'secC6' ] = sprintf("%d",$_REQUEST[ 'sec' ][7][6]);
			$sec[ 'secC7' ] = sprintf("%d",$_REQUEST[ 'sec' ][7][7]);

		}

		if($_REQUEST[ 'sec' ][8]){
			$sec[ 'secC8'  ] = sprintf("%d",$_REQUEST[ 'sec' ][8][8]);
			$sec[ 'secC9'  ] = sprintf("%d",$_REQUEST[ 'sec' ][8][9]);
			$sec[ 'secC10' ] = sprintf("%d",$_REQUEST[ 'sec' ][8][10]);
			$sec[ 'secC11' ] = sprintf("%d",$_REQUEST[ 'sec' ][8][11]);
		}

		if($_REQUEST[ 'sec' ][9]){
			$sec[ 'secC12'  ] = sprintf("%d",$_REQUEST[ 'sec' ][9][12]);
			$sec[ 'secC13'  ] = sprintf("%d",$_REQUEST[ 'sec' ][9][13]);

		}
		if($_REQUEST[ 'sec' ][10]){
			$sec[ 'secC14'  ] = sprintf("%d",$_REQUEST[ 'sec' ][10][14]);
			$sec[ 'secC15'  ] = sprintf("%d",$_REQUEST[ 'sec' ][10][15]);
		}

		if($_REQUEST[ 'sec' ][11]){
			$sec[ 'secD1_1' ] = sprintf("%d",$_REQUEST[ 'sec' ][11][1]);
			$sec[ 'secD1_2' ] = sprintf("%d",$_REQUEST[ 'sec' ][11][2]);
		}

		if($_REQUEST[ 'sec' ][12]){
			$sec[ 'secD2_1' ] = sprintf("%d",$_REQUEST[ 'sec' ][12][1]);
			$sec[ 'secD2_2' ] = sprintf("%d",$_REQUEST[ 'sec' ][12][2]);
		}
		if($_REQUEST[ 'sec' ][13]){
			$sec[ 'secD3_1' ] = sprintf("%d",$_REQUEST[ 'sec' ][13][1]);
			$sec[ 'secD3_2' ] = sprintf("%d",$_REQUEST[ 'sec' ][13][2]);
		}
		if($_REQUEST[ 'sec' ][14]){
			$sec[ 'secD4_1' ] = sprintf("%d",$_REQUEST[ 'sec' ][14][1]);
			$sec[ 'secD4_2' ] = sprintf("%d",$_REQUEST[ 'sec' ][14][2]);
			$sec[ 'secD4_3' ] = sprintf("%d",$_REQUEST[ 'sec' ][14][3]);

		}
		if($_REQUEST[ 'sec' ][15]){
			$sec[ 'secD5_1' ] = sprintf("%d",$_REQUEST[ 'sec' ][15][1]);
			$sec[ 'secD5_2' ] = sprintf("%d",$_REQUEST[ 'sec' ][15][2]);
			$sec[ 'secD5_3' ] = sprintf("%d",$_REQUEST[ 'sec' ][15][3]);
			$sec[ 'secD5_4' ] = sprintf("%d",$_REQUEST[ 'sec' ][15][4]);
		}

		if($_REQUEST[ 'sec' ][16]){
			$sec[ 'secD6_1' ] = sprintf("%d",$_REQUEST[ 'sec' ][16][1]);
			$sec[ 'secD6_2' ] = sprintf("%d",$_REQUEST[ 'sec' ][16][2]);
		}

		if($_REQUEST[ 'sec' ][17]){
			$sec[ 'secE1_1' ] = sprintf("%d",$_REQUEST[ 'sec' ][17][1]);
			$sec[ 'secE1_2' ] = sprintf("%d",$_REQUEST[ 'sec' ][17][2]);
		}

		if($_REQUEST[ 'sec' ][18]){
			$sec[ 'secE2_1' ] = sprintf("%d",$_REQUEST[ 'sec' ][18][1]);
			$sec[ 'secE2_2' ] = sprintf("%d",$_REQUEST[ 'sec' ][18][2]);
		}
		if($_REQUEST[ 'sec' ][19]){
			$sec[ 'secE3_1' ] = sprintf("%d",$_REQUEST[ 'sec' ][19][1]);
			$sec[ 'secE3_2' ] = sprintf("%d",$_REQUEST[ 'sec' ][19][2]);
		}
		if($_REQUEST[ 'sec' ][20]){
			$sec[ 'secE4_1' ] = sprintf("%d",$_REQUEST[ 'sec' ][20][1]);
			$sec[ 'secE4_2' ] = sprintf("%d",$_REQUEST[ 'sec' ][20][2]);
			$sec[ 'secE4_3' ] = sprintf("%d",$_REQUEST[ 'sec' ][20][3]);

		}
		if($_REQUEST[ 'sec' ][21]){
			$sec[ 'secE5_1' ] = sprintf("%d",$_REQUEST[ 'sec' ][21][1]);
			$sec[ 'secE5_2' ] = sprintf("%d",$_REQUEST[ 'sec' ][21][2]);
			$sec[ 'secE5_3' ] = sprintf("%d",$_REQUEST[ 'sec' ][21][3]);

		}
		if($_REQUEST[ 'sec' ][22]){
			$sec[ 'secE6_1' ] = sprintf("%d",$_REQUEST[ 'sec' ][22][1]);
			$sec[ 'secE6_2' ] = sprintf("%d",$_REQUEST[ 'sec' ][22][2]);
			$sec[ 'secE6_3' ] = sprintf("%d",$_REQUEST[ 'sec' ][22][3]);
		}

		if($_REQUEST[ 'sec' ][23]){
			$sec[ 'secF1' ] = sprintf("%d",$_REQUEST[ 'sec' ][23][1]);
			$sec[ 'secF2' ] = sprintf("%d",$_REQUEST[ 'sec' ][23][2]);
			$sec[ 'secF3' ] = sprintf("%d",$_REQUEST[ 'sec' ][23][3]);
			$sec[ 'secF4' ] = sprintf("%d",$_REQUEST[ 'sec' ][23][4]);
			$sec[ 'secF5' ] = sprintf("%d",$_REQUEST[ 'sec' ][23][5]);
		}
		if($_REQUEST[ 'sec' ][24]){
			$sec[ 'secF6'  ] = sprintf("%d",$_REQUEST[ 'sec' ][24][6]);
			$sec[ 'secF7'  ] = sprintf("%d",$_REQUEST[ 'sec' ][24][7]);
			$sec[ 'secF8'  ] = sprintf("%d",$_REQUEST[ 'sec' ][24][8]);
			$sec[ 'secF9'  ] = sprintf("%d",$_REQUEST[ 'sec' ][24][9]);
			$sec[ 'secF10' ] = sprintf("%d",$_REQUEST[ 'sec' ][24][10]);
		}
		if($_REQUEST[ 'sec' ][25]){
			$sec[ 'secF11'  ] = sprintf("%d",$_REQUEST[ 'sec' ][25][11]);
			$sec[ 'secF12'  ] = sprintf("%d",$_REQUEST[ 'sec' ][25][12]);
			$sec[ 'secF13'  ] = sprintf("%d",$_REQUEST[ 'sec' ][25][13]);
			$sec[ 'secF14'  ] = sprintf("%d",$_REQUEST[ 'sec' ][25][14]);
		}


		if($_REQUEST[ 'sec' ][26]){
			$sec[ 'secG1a' ] = sprintf("%d",$_REQUEST[ 'sec' ][26][1][a]);
			$sec[ 'secG1b' ] = sprintf("%d",$_REQUEST[ 'sec' ][26][1][b]);
			$sec[ 'secG1c' ] = sprintf("%d",$_REQUEST[ 'sec' ][26][1][c]);
			$sec[ 'secG2a' ] = sprintf("%d",$_REQUEST[ 'sec' ][26][2][a]);
			$sec[ 'secG2b' ] = sprintf("%d",$_REQUEST[ 'sec' ][26][2][b]);
			$sec[ 'secG2c' ] = sprintf("%d",$_REQUEST[ 'sec' ][26][2][c]);
			$sec[ 'secG3a' ] = sprintf("%d",$_REQUEST[ 'sec' ][26][3][a]);
			$sec[ 'secG3b' ] = sprintf("%d",$_REQUEST[ 'sec' ][26][3][b]);
			$sec[ 'secG3c' ] = sprintf("%d",$_REQUEST[ 'sec' ][26][3][c]);
		}


		if($_REQUEST[ 'sec' ][27]){
			$sec[ 'secG4a' ] = sprintf("%d",$_REQUEST[ 'sec' ][27][4][a]);
			$sec[ 'secG4b' ] = sprintf("%d",$_REQUEST[ 'sec' ][27][4][b]);
			$sec[ 'secG4c' ] = sprintf("%d",$_REQUEST[ 'sec' ][27][4][c]);
			$sec[ 'secG5a' ] = sprintf("%d",$_REQUEST[ 'sec' ][27][5][a]);
			$sec[ 'secG5b' ] = sprintf("%d",$_REQUEST[ 'sec' ][27][5][b]);
			$sec[ 'secG5c' ] = sprintf("%d",$_REQUEST[ 'sec' ][27][5][c]);
		}


		if($_REQUEST[ 'sec' ][28]){
			$sec[ 'secH1A' ] = sprintf("%d",$_REQUEST[ 'sec' ][28][1]);
			$sec[ 'secH1B' ] = sprintf("%d",$_REQUEST[ 'sec' ][28][2]);
			$sec[ 'secH1C' ] = sprintf("%d",$_REQUEST[ 'sec' ][28][3]);

		}
		if($_REQUEST[ 'sec' ][29]){
			$sec[ 'secH2A' ] = sprintf("%d",$_REQUEST[ 'sec' ][29][1]);
			$sec[ 'secH2B' ] = sprintf("%d",$_REQUEST[ 'sec' ][29][2]);
			$sec[ 'secH2C' ] = sprintf("%d",$_REQUEST[ 'sec' ][29][3]);

		}
		if($_REQUEST[ 'sec' ][30]){
			$sec[ 'secH3A' ] = sprintf("%d",$_REQUEST[ 'sec' ][30][1]);
			$sec[ 'secH3B' ] = sprintf("%d",$_REQUEST[ 'sec' ][30][2]);
			$sec[ 'secH3C' ] = sprintf("%d",$_REQUEST[ 'sec' ][30][3]);
		}

		if($_REQUEST[ 'sec' ][31]){
			$sec[ 'secH4A' ] = sprintf("%d",$_REQUEST[ 'sec' ][31][1]);
			$sec[ 'secH4B' ] = sprintf("%d",$_REQUEST[ 'sec' ][31][2]);
			$sec[ 'secH4C' ] = sprintf("%d",$_REQUEST[ 'sec' ][31][3]);
		}
		if($_REQUEST[ 'sec' ][32]){
			$sec[ 'secH5A' ] = sprintf("%d",$_REQUEST[ 'sec' ][32][1]);
			$sec[ 'secH5B' ] = sprintf("%d",$_REQUEST[ 'sec' ][32][2]);
			$sec[ 'secH5C' ] = sprintf("%d",$_REQUEST[ 'sec' ][32][3]);
		}
		if($_REQUEST[ 'sec' ][33]){
			$sec[ 'secH6A' ] = sprintf("%d",$_REQUEST[ 'sec' ][33][1]);
			$sec[ 'secH6B' ] = sprintf("%d",$_REQUEST[ 'sec' ][33][2]);
			$sec[ 'secH6C' ] = sprintf("%d",$_REQUEST[ 'sec' ][33][3]);
		}
		if($_REQUEST[ 'sec' ][34]){
			$sec[ 'secH7A' ] = sprintf("%d",$_REQUEST[ 'sec' ][34][1]);
			$sec[ 'secH7B' ] = sprintf("%d",$_REQUEST[ 'sec' ][34][2]);
			$sec[ 'secH7C' ] = sprintf("%d",$_REQUEST[ 'sec' ][34][3]);
		}

		if($_REQUEST[ 'sec' ][35]){
			$sec[ 'secI1_1' ] = sprintf("%d",$_REQUEST[ 'sec' ][35][1]);
			$sec[ 'secI1_2' ] = sprintf("%d",$_REQUEST[ 'sec' ][35][2]);
			$sec[ 'secI1_3' ] = sprintf("%d",$_REQUEST[ 'sec' ][35][3]);
			$sec[ 'secI1_4' ] = sprintf("%d",$_REQUEST[ 'sec' ][35][4]);
			$sec[ 'secI1_5' ] = sprintf("%d",$_REQUEST[ 'sec' ][35][5]);
		}

		if($_REQUEST[ 'sec' ][36]){
			$sec[ 'secI2_1' ] = sprintf("%d",$_REQUEST[ 'sec' ][36][1]);
			$sec[ 'secI2_2' ] = sprintf("%d",$_REQUEST[ 'sec' ][36][2]);
			$sec[ 'secI2_3' ] = sprintf("%d",$_REQUEST[ 'sec' ][36][3]);
			$sec[ 'secI2_4' ] = sprintf("%d",$_REQUEST[ 'sec' ][36][4]);
			$sec[ 'secI2_5' ] = sprintf("%d",$_REQUEST[ 'sec' ][36][5]);

		}
		if($_REQUEST[ 'sec' ][37]){
			$sec[ 'secI3_1' ] = sprintf("%d",$_REQUEST[ 'sec' ][37][1]);
			$sec[ 'secI3_2' ] = sprintf("%d",$_REQUEST[ 'sec' ][37][2]);
			$sec[ 'secI3_3' ] = sprintf("%d",$_REQUEST[ 'sec' ][37][3]);
			$sec[ 'secI3_4' ] = sprintf("%d",$_REQUEST[ 'sec' ][37][4]);
			$sec[ 'secI3_5' ] = sprintf("%d",$_REQUEST[ 'sec' ][37][5]);
		}

		if($_REQUEST[ 'sec' ][38]){
			$sec[ 'secI4_1' ] = sprintf("%d",$_REQUEST[ 'sec' ][38][1]);
			$sec[ 'secI4_2' ] = sprintf("%d",$_REQUEST[ 'sec' ][38][2]);
			$sec[ 'secI4_3' ] = sprintf("%d",$_REQUEST[ 'sec' ][38][3]);
			$sec[ 'secI4_4' ] = sprintf("%d",$_REQUEST[ 'sec' ][38][4]);
			$sec[ 'secI4_5' ] = sprintf("%d",$_REQUEST[ 'sec' ][38][5]);

		}

		if($_REQUEST[ 'sec' ][39]){
			$sec[ 'secI5_1' ] = sprintf("%d",$_REQUEST[ 'sec' ][39][1]);
			$sec[ 'secI5_2' ] = sprintf("%d",$_REQUEST[ 'sec' ][39][2]);
			$sec[ 'secI5_3' ] = sprintf("%d",$_REQUEST[ 'sec' ][39][3]);
		}


	$ea->setEaRst($sec,$where);
	
}


//スタート時間の登録
//初回ページ
if($_REQUEST[ 'page' ]){
	$flg = $t->checkExamState($where);
	if($flg[ 'exam_state' ] == 2){
		header("Location:".D_URL_TEST."?k=".$_REQUEST[ 'k' ]);
		exit();
	}

	$obj->setStartTime($where);
	$ea->setEa($where);
}else{
	//初回以外　テストページの時
	if($temp == "page"){
		$flg = $t->checkExamState($where);
		if($flg[ 'exam_state' ] == 2){
			header("Location:".D_URL_TEST."?k=".$_REQUEST[ 'k' ]);
			exit();
		}
	}
}


//次のページ
if($_REQUEST[ 'next' ]){
	//エラーチェック
	if($pager == 2){
		if(!$_REQUEST[ 'sec' ][1]){
			$err = 1;
		}
	}
	if($pager == 3){
		for($i=1;$i<=7;$i++){
			if(!$_REQUEST[ 'sec' ][2][$i]){
				$err = 1;
			}
		}
	}
	if($pager == 4){
		for($i=1;$i<=7;$i++){
			$chk = $_REQUEST[ 'sec' ][3][$i];
			if(!$chk){
				$err = 1;
			}
		}
	}
	if($pager == 5){
		for($i=1;$i<=4;$i++){
			$chka = $_REQUEST[ 'sec' ][4][$i][a];
			$chkb = $_REQUEST[ 'sec' ][4][$i][b];
			$chkc = $_REQUEST[ 'sec' ][4][$i][c];
			if(!$chka || !$chkb || !$chkc){
				$err = 1;
			}
		}
	}

	if($pager == 6){
		for($i=5;$i<=6;$i++){
			$chka = $_REQUEST[ 'sec' ][5][$i][a];
			$chkb = $_REQUEST[ 'sec' ][5][$i][b];
			$chkc = $_REQUEST[ 'sec' ][5][$i][c];
			if(!$chka || !$chkb || !$chkc){
				$err = 1;
			}
		}
	}

	if($pager == 7){
		for($i=1;$i<=3;$i++){
			$chk = $_REQUEST[ 'sec' ][6][$i];
			if(!$chk){
				$err = 1;
			}
		}
	}

	if($pager == 8){
		for($i=4;$i<=7;$i++){
			$chk = $_REQUEST[ 'sec' ][7][$i];
			if(!$chk){
				$err = 1;
			}
		}
	}

	if($pager == 9){
		for($i=8;$i<=11;$i++){
			$chk = $_REQUEST[ 'sec' ][8][$i];
			if(!$chk){
				$err = 1;
			}
		}
	}

	if($pager == 10){
		for($i=12;$i<=13;$i++){
			$chk = $_REQUEST[ 'sec' ][9][$i];
			if(!$chk){
				$err = 1;
			}
		}
	}
	if($pager == 11){
		for($i=14;$i<=15;$i++){
			$sec = $_REQUEST[ 'sec' ][10][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}

	if($pager == 12){
		for($i=1;$i<=2;$i++){
			$sec = $_REQUEST[ 'sec' ][11][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}

	if($pager == 13){
		for($i=1;$i<=2;$i++){
			$sec = $_REQUEST[ 'sec' ][12][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}

	if($pager == 14){
		for($i=1;$i<=2;$i++){
			$sec = $_REQUEST[ 'sec' ][13][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}

	if($pager == 15){
		for($i=1;$i<=3;$i++){
			$sec = $_REQUEST[ 'sec' ][14][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}

	if($pager == 16){
		for($i=1;$i<=4;$i++){
			$sec = $_REQUEST[ 'sec' ][15][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}

	if($pager == 17){
		for($i=1;$i<=2;$i++){
			$sec = $_REQUEST[ 'sec' ][16][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}

	if($pager == 18){
		for($i=1;$i<=2;$i++){
			$sec = $_REQUEST[ 'sec' ][17][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}
	if($pager == 19){
		for($i=1;$i<=2;$i++){
			$sec = $_REQUEST[ 'sec' ][18][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}

	if($pager == 20){
		for($i=1;$i<=2;$i++){
			$sec = $_REQUEST[ 'sec' ][19][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}

	if($pager == 21){
		for($i=1;$i<=3;$i++){
			$sec = $_REQUEST[ 'sec' ][20][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}
	if($pager == 22){
		for($i=1;$i<=3;$i++){
			$sec = $_REQUEST[ 'sec' ][21][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}

	if($pager == 23){
		for($i=1;$i<=3;$i++){
			$sec = $_REQUEST[ 'sec' ][22][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}
	if($pager == 24){
		for($i=1;$i<=5;$i++){
			$sec = $_REQUEST[ 'sec' ][23][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}
	if($pager == 25){
		for($i=6;$i<=10;$i++){
			$sec = $_REQUEST[ 'sec' ][24][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}
	if($pager == 26){
		for($i=11;$i<=14;$i++){
			$sec = $_REQUEST[ 'sec' ][25][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}
	if($pager == 27){
		for($i=1;$i<=3;$i++){
			$chka = $_REQUEST[ 'sec' ][26][$i][a];
			$chkb = $_REQUEST[ 'sec' ][26][$i][b];
			$chkc = $_REQUEST[ 'sec' ][26][$i][c];
			if(!$chka || !$chkb || !$chkc){
				$err = 1;
			}
		}
	}
	if($pager == 28){
		for($i=4;$i<=5;$i++){
			$chka = $_REQUEST[ 'sec' ][27][$i][a];
			$chkb = $_REQUEST[ 'sec' ][27][$i][b];
			$chkc = $_REQUEST[ 'sec' ][27][$i][c];
			if(!$chka || !$chkb || !$chkc){
				$err = 1;
			}
		}
	}
	if($pager == 29){
		for($i=1;$i<=3;$i++){
			$sec = $_REQUEST[ 'sec' ][28][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}
	if($pager == 30){
		for($i=1;$i<=3;$i++){
			$sec = $_REQUEST[ 'sec' ][29][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}
	if($pager == 31){
		for($i=1;$i<=3;$i++){
			$sec = $_REQUEST[ 'sec' ][30][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}
	if($pager == 32){
		for($i=1;$i<=3;$i++){
			$sec = $_REQUEST[ 'sec' ][31][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}
	if($pager == 33){
		for($i=1;$i<=3;$i++){
			$sec = $_REQUEST[ 'sec' ][32][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}
	if($pager == 34){
		for($i=1;$i<=3;$i++){
			$sec = $_REQUEST[ 'sec' ][33][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}
	if($pager == 35){
		for($i=1;$i<=3;$i++){
			$sec = $_REQUEST[ 'sec' ][34][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}

	if($pager == 36){
		for($i=1;$i<=5;$i++){
			$sec = $_REQUEST[ 'sec' ][35][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}

	if($pager == 37){
		for($i=1;$i<=5;$i++){
			$sec = $_REQUEST[ 'sec' ][36][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}
	if($pager == 38){
		for($i=1;$i<=5;$i++){
			$sec = $_REQUEST[ 'sec' ][37][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}

	if($pager == 39){
		for($i=1;$i<=5;$i++){
			$sec = $_REQUEST[ 'sec' ][38][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}
	if($pager == 40){
		for($i=1;$i<=3;$i++){
			$sec = $_REQUEST[ 'sec' ][39][ $i ];
			if(!$sec){
				$err = 1;
			}
		}
	}


	if($err){
		//エラーがあった時はコチラ
		$errmsg = "チェックされていない回答があります。";
		$pager  = $_REQUEST[ 'nextPage' ]-1;
	}else
	if($max < $_REQUEST[ 'nextPage' ]){


		include_once(D_PATH_HOME."init/rsData/rsCalcData.php");
		include_once(D_PATH_HOME."lib/keisan/functionEAB.php");


		//----------------------------
		//最終ページ
		//----------------------------
		$tdetail = $obj->getTestPaper($where);
		$update = array();
		$update[ 'where' ][ 'test_id' ] = $where[ 'test_id' ];
		$update[ 'where' ][ 'exam_id' ] = $where[ 'exam_id' ];
		list($rst,$rs_id) = $ea->getScore($update);

		$array_result = EAB($array_calc,$array_vf,$rst);

		$ea->setResult($array_result,$rs_id);
		
		//-------------------------------------
		//テスト側データ
		//------------------------------------
		$s_day  = split( '/', $tdetail['exam_date'] ); 
		$s_time = split( ':', $tdetail['start_time'] ); 

		$start_timestamp = mktime($s_time[0], $s_time[1], $s_time[2], $s_day[1], $s_day[2], $s_day[0]);
		$end_timestamp   = time();

		$end_timer = $end_timestamp - $start_timestamp;
		$e_time[0] = (int)($end_timer / 60);
		$e_time[1] = $end_timer % 60;

		$set = array();
		$set[ 'exam_state' ] = 2;
		$set[ 'level'      ] = $lv;
		$set[ 'exam_time'  ] = $e_time[0].":".$e_time[1];
		$set[ 'fin_exam_date' ] = sprintf("%04d-%02d-%02d %02d:%02d:%02d"
									,date("Y"),date("m"),date("d")
									,date("H"),date("i"),date("s")
									);
		
		$tbl = "t_testpaper";
		$obj->editDetail($tbl,$set,$where);

		//complete_flgの設定
		$t->editCompleteFlg($where);
		//メール配信
		$t->sendFinMail($where);
		$fin_disp = $test[ 'fin_disp' ];
		$temp = "Fin";

		
	}
}


if($_REQUEST[ 'back' ]){
	$pager = $_REQUEST[ 'backPage' ];
	//戻るボタンの時はチェックされた項目を編集
}

//テストデータ取得
$tdetail = $ea->getEa($where);

if($pager >= 40){
	if(
		   !$tdetail[ 'secI5_1'  ]
		|| !$tdetail[ 'secI5_2'  ]
		|| !$tdetail[ 'secI5_3'  ]
	){
		$pager = 39;
		$alerts = $pager."ページに誤りがあります。";
	}
}
if($pager >= 39){
	if(
		   !$tdetail[ 'secI4_1'  ]
		|| !$tdetail[ 'secI4_2'  ]
		|| !$tdetail[ 'secI4_3'  ]
		|| !$tdetail[ 'secI4_4'  ]
		|| !$tdetail[ 'secI4_5'  ]

	){
		$pager = 38;
		$alerts = $pager."ページに誤りがあります。";
	}
}
if($pager >= 38){
	if(
		   !$tdetail[ 'secI3_1'  ]
		|| !$tdetail[ 'secI3_2'  ]
		|| !$tdetail[ 'secI3_3'  ]
		|| !$tdetail[ 'secI3_4'  ]
		|| !$tdetail[ 'secI3_5'  ]

	){
		$pager = 37;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 37){
	if(
		   !$tdetail[ 'secI2_1'  ]
		|| !$tdetail[ 'secI2_2'  ]
		|| !$tdetail[ 'secI2_3'  ]
		|| !$tdetail[ 'secI2_4'  ]
		|| !$tdetail[ 'secI2_5'  ]

	){
		$pager = 36;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 36){
	if(
		   !$tdetail[ 'secI1_1'  ]
		|| !$tdetail[ 'secI1_2'  ]
		|| !$tdetail[ 'secI1_3'  ]
		|| !$tdetail[ 'secI1_4'  ]
		|| !$tdetail[ 'secI1_5'  ]

	){
		$pager = 35;
		$alerts = $pager."ページに誤りがあります。";
	}
}
if($pager >= 35){
	if(
		   !$tdetail[ 'secH7A'  ]
		|| !$tdetail[ 'secH7B'  ]
		|| !$tdetail[ 'secH7C'  ]
	){
		$pager = 34;
		$alerts = $pager."ページに誤りがあります。";
	}
}
if($pager >= 34){
	if(
		   !$tdetail[ 'secH6A'  ]
		|| !$tdetail[ 'secH6B'  ]
		|| !$tdetail[ 'secH6C'  ]
	){
		$pager = 33;
		$alerts = $pager."ページに誤りがあります。";
	}
}
if($pager >= 33){
	if(
		   !$tdetail[ 'secH5A'  ]
		|| !$tdetail[ 'secH5B'  ]
		|| !$tdetail[ 'secH5C'  ]
	){
		$pager = 32;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 32){
	if(
		   !$tdetail[ 'secH4A'  ]
		|| !$tdetail[ 'secH4B'  ]
		|| !$tdetail[ 'secH4C'  ]
	){
		$pager = 31;
		$alerts = $pager."ページに誤りがあります。";
	}
}


if($pager >= 31){
	if(
		   !$tdetail[ 'secH3A'  ]
		|| !$tdetail[ 'secH3B'  ]
		|| !$tdetail[ 'secH3C'  ]
	){
		$pager = 30;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 30){
	if(
		   !$tdetail[ 'secH2A'  ]
		|| !$tdetail[ 'secH2B'  ]
		|| !$tdetail[ 'secH2C'  ]
	){
		$pager = 29;
		$alerts = $pager."ページに誤りがあります。";
	}
}
if($pager >= 29){
	if(
		   !$tdetail[ 'secH1A'  ]
		|| !$tdetail[ 'secH1B'  ]
		|| !$tdetail[ 'secH1C'  ]
	){
		$pager = 28;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 28){
	if(
		   !$tdetail[ 'secG4a'  ]
		|| !$tdetail[ 'secG4b'  ]
		|| !$tdetail[ 'secG4c'  ]
		|| !$tdetail[ 'secG5a'  ]
		|| !$tdetail[ 'secG5b'  ]
		|| !$tdetail[ 'secG5c'  ]
	){
		$pager = 27;
		$alerts = $pager."ページに誤りがあります。";
	}
}
if($pager >= 27){
	if(
		   !$tdetail[ 'secG1a'  ]
		|| !$tdetail[ 'secG1b'  ]
		|| !$tdetail[ 'secG1c'  ]
		|| !$tdetail[ 'secG2a'  ]
		|| !$tdetail[ 'secG2b'  ]
		|| !$tdetail[ 'secG2c'  ]
		|| !$tdetail[ 'secG3a'  ]
		|| !$tdetail[ 'secG3b'  ]
		|| !$tdetail[ 'secG3c'  ]

	){
		$pager = 26;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 26){
	if(
		   !$tdetail[ 'secF11'  ]
		|| !$tdetail[ 'secF12'  ]
		|| !$tdetail[ 'secF13'  ]
		|| !$tdetail[ 'secF14'  ]
	){
		$pager = 25;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 25){
	if(
		   !$tdetail[ 'secF6'  ]
		|| !$tdetail[ 'secF7'  ]
		|| !$tdetail[ 'secF8'  ]
		|| !$tdetail[ 'secF9'  ]
		|| !$tdetail[ 'secF10'  ]
	){
		$pager = 24;
		$alerts = $pager."ページに誤りがあります。";
	}
}


if($pager >= 24){
	if(
		   !$tdetail[ 'secF1'  ]
		|| !$tdetail[ 'secF2'  ]
		|| !$tdetail[ 'secF3'  ]
		|| !$tdetail[ 'secF4'  ]
		|| !$tdetail[ 'secF5'  ]
	){
		$pager = 23;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 23){
	if(
		   !$tdetail[ 'secE6_1'  ]
		|| !$tdetail[ 'secE6_2'  ]
		|| !$tdetail[ 'secE6_3'  ]
	){
		$pager = 22;
		$alerts = $pager."ページに誤りがあります。";
	}
}
if($pager >= 22){
	if(
		   !$tdetail[ 'secE5_1'  ]
		|| !$tdetail[ 'secE5_2'  ]
		|| !$tdetail[ 'secE5_3'  ]
	){
		$pager = 21;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 21){
	if(
		   !$tdetail[ 'secE4_1'  ]
		|| !$tdetail[ 'secE4_2'  ]
		|| !$tdetail[ 'secE4_3'  ]
	){
		$pager = 20;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 20){
	if(
		   !$tdetail[ 'secE3_1'  ]
		|| !$tdetail[ 'secE3_2'  ]
	){
		$pager = 19;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 19){
	if(
		   !$tdetail[ 'secE2_1'  ]
		|| !$tdetail[ 'secE2_2'  ]
	){
		$pager = 18;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 18){
	if(
		   !$tdetail[ 'secE1_1'  ]
		|| !$tdetail[ 'secE1_2'  ]
	){
		$pager = 17;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 17){
	if(
		   !$tdetail[ 'secD6_1'  ]
		|| !$tdetail[ 'secD6_2'  ]
	){
		$pager = 16;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 16){
	if(
		   !$tdetail[ 'secD5_1'  ]
		|| !$tdetail[ 'secD5_2'  ]
		|| !$tdetail[ 'secD5_3'  ]
		|| !$tdetail[ 'secD5_4'  ]
	){
		$pager = 15;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 15){
	if(
		   !$tdetail[ 'secD4_1'  ]
		|| !$tdetail[ 'secD4_2'  ]
		|| !$tdetail[ 'secD4_3'  ]
	){
		$pager = 14;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 14){
	if(
		   !$tdetail[ 'secD3_1'  ]
		|| !$tdetail[ 'secD3_2'  ]

	){
		$pager = 13;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 13){
	if(
		   !$tdetail[ 'secD2_1'  ]
		|| !$tdetail[ 'secD2_2'  ]

	){
		$pager = 12;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 12){
	if(
		   !$tdetail[ 'secD1_1'  ]
		|| !$tdetail[ 'secD1_2'  ]

	){
		$pager = 11;
		$alerts = $pager."ページに誤りがあります。";
	}
}
if($pager >= 11){
	if(
		   !$tdetail[ 'secC14'  ]
		|| !$tdetail[ 'secC15'  ]

	){
		$pager = 10;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 10){
	if(
		   !$tdetail[ 'secC12'  ]
		|| !$tdetail[ 'secC13'  ]

	){
		$pager = 9;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 9){
	if(
		   !$tdetail[ 'secC8'  ]
		|| !$tdetail[ 'secC9'  ]
		|| !$tdetail[ 'secC10' ]
		|| !$tdetail[ 'secC11' ]
	){
		$pager = 8;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 8){
	if(
		   !$tdetail[ 'secC4' ]
		|| !$tdetail[ 'secC5' ]
		|| !$tdetail[ 'secC6' ]
		|| !$tdetail[ 'secC7' ]
	){
		$pager = 7;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 7){
	if(
		   !$tdetail[ 'secC1' ]
		|| !$tdetail[ 'secC2' ]
		|| !$tdetail[ 'secC3' ]
	){
		$pager = 6;
		$alerts = $pager."ページに誤りがあります。";
	}
}


if($pager >= 6){
	if(
		   !$tdetail[ 'secB5a' ]
		|| !$tdetail[ 'secB5b' ]
		|| !$tdetail[ 'secB5c' ]
		|| !$tdetail[ 'secB6a' ]
		|| !$tdetail[ 'secB6b' ]
		|| !$tdetail[ 'secB6c' ]
	){
		$pager = 5;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 5){
	if(
		   !$tdetail[ 'secB1a' ]
		|| !$tdetail[ 'secB1b' ]
		|| !$tdetail[ 'secB1c' ]
		|| !$tdetail[ 'secB2a' ]
		|| !$tdetail[ 'secB2b' ]
		|| !$tdetail[ 'secB2c' ]
		|| !$tdetail[ 'secB3a' ]
        || !$tdetail[ 'secB3b' ]
        || !$tdetail[ 'secB3c' ]
        || !$tdetail[ 'secB4a' ]
        || !$tdetail[ 'secB4b' ]
        || !$tdetail[ 'secB4c' ]
	){
		$pager = 4;
		$alerts = $pager."ページに誤りがあります。";
	}
}


if($pager >= 4){
	if(
		   !$tdetail[ 'secA3a' ]
		|| !$tdetail[ 'secA3b' ]
		|| !$tdetail[ 'secA3c' ]
		|| !$tdetail[ 'secA3d' ]
		|| !$tdetail[ 'secA3e' ]
		|| !$tdetail[ 'secA3f' ]
		|| !$tdetail[ 'secA3g' ]
	){
		$pager = 3;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 3){
	if(
		!$tdetail[ 'secA2a' ]
		|| !$tdetail[ 'secA2b' ]
		|| !$tdetail[ 'secA2c' ]
		|| !$tdetail[ 'secA2d' ]
		|| !$tdetail[ 'secA2e' ]
		|| !$tdetail[ 'secA2f' ]
		|| !$tdetail[ 'secA2g' ]

	){
		$pager = 2;
		$alerts = $pager."ページに誤りがあります。";
	}
}

if($pager >= 2){
	if(!$tdetail[ 'secA1' ]){
		$pager = 1;
		$alerts = $pager."ページに誤りがあります。";
	}
}

switch($pager){
	case "1":
		$answer[1] = $tdetail[ 'secA1' ];
	break;
	case "2":
		$answer[2][0] = $tdetail[ 'secA2a' ];
		$answer[2][1] = $tdetail[ 'secA2b' ];
		$answer[2][2] = $tdetail[ 'secA2c' ];
		$answer[2][3] = $tdetail[ 'secA2d' ];
		$answer[2][4] = $tdetail[ 'secA2e' ];
		$answer[2][5] = $tdetail[ 'secA2f' ];
		$answer[2][6] = $tdetail[ 'secA2g' ];

	break;
	case "3":
		$answer[3][0] = $tdetail[ 'secA3a' ];
		$answer[3][1] = $tdetail[ 'secA3b' ];
		$answer[3][2] = $tdetail[ 'secA3c' ];
		$answer[3][3] = $tdetail[ 'secA3d' ];
		$answer[3][4] = $tdetail[ 'secA3e' ];
		$answer[3][5] = $tdetail[ 'secA3f' ];
		$answer[3][6] = $tdetail[ 'secA3g' ];

	break;
	case "4":

		$answer[4][1][0] = $tdetail[ 'secB1a' ];
		$answer[4][1][1] = $tdetail[ 'secB1b' ];
		$answer[4][1][2] = $tdetail[ 'secB1c' ];
		$answer[4][2][0] = $tdetail[ 'secB2a' ];
		$answer[4][2][1] = $tdetail[ 'secB2b' ];
		$answer[4][2][2] = $tdetail[ 'secB2c' ];
		$answer[4][3][0] = $tdetail[ 'secB3a' ];
		$answer[4][3][1] = $tdetail[ 'secB3b' ];
		$answer[4][3][2] = $tdetail[ 'secB3c' ];
		$answer[4][4][0] = $tdetail[ 'secB4a' ];
		$answer[4][4][1] = $tdetail[ 'secB4b' ];
		$answer[4][4][2] = $tdetail[ 'secB4c' ];

	break;
	case "5":
		$answer[5][5][0] = $tdetail[ 'secB5a' ];
		$answer[5][5][1] = $tdetail[ 'secB5b' ];
		$answer[5][5][2] = $tdetail[ 'secB5c' ];
		$answer[5][6][0] = $tdetail[ 'secB6a' ];
		$answer[5][6][1] = $tdetail[ 'secB6b' ];
		$answer[5][6][2] = $tdetail[ 'secB6c' ];

	break;
	case "6":
		$answer[6][1] = $tdetail[ 'secC1' ];
		$answer[6][2] = $tdetail[ 'secC2' ];
		$answer[6][3] = $tdetail[ 'secC3' ];

	break;
	case "7":
		$answer[7][4] = $tdetail[ 'secC4' ];
		$answer[7][5] = $tdetail[ 'secC5' ];
		$answer[7][6] = $tdetail[ 'secC6' ];
		$answer[7][7] = $tdetail[ 'secC7' ];
	break;
	case "8":
		$answer[8][8]  = $tdetail[ 'secC8' ];
		$answer[8][9]  = $tdetail[ 'secC9' ];
		$answer[8][10] = $tdetail[ 'secC10' ];
		$answer[8][11] = $tdetail[ 'secC11' ];
	break;
	case "9":
		$answer[9][12] = $tdetail[ 'secC12' ];
		$answer[9][13] = $tdetail[ 'secC13' ];
	break;
	case "10":
		$answer[10][14] = $tdetail[ 'secC14' ];
		$answer[10][15] = $tdetail[ 'secC15' ];
	break;
	case "11":
		$answer[11][0] = $tdetail[ 'secD1_1' ];
		$answer[11][1] = $tdetail[ 'secD1_2' ];

	break;

	case "12":
		$answer[12][0] = $tdetail[ 'secD2_1' ];
		$answer[12][1] = $tdetail[ 'secD2_2' ];
	break;
	case "13":
		$answer[13][0] = $tdetail[ 'secD3_1' ];
		$answer[13][1] = $tdetail[ 'secD3_2' ];
	break;

	case "14":
		$answer[14][0] = $tdetail[ 'secD4_1' ];
		$answer[14][1] = $tdetail[ 'secD4_2' ];
		$answer[14][2] = $tdetail[ 'secD4_3' ];

	break;
	case "15":
		$answer[15][0] = $tdetail[ 'secD5_1' ];
		$answer[15][1] = $tdetail[ 'secD5_2' ];
		$answer[15][2] = $tdetail[ 'secD5_3' ];
		$answer[15][3] = $tdetail[ 'secD5_4' ];
	break;

	case "16":
		$answer[16][0] = $tdetail[ 'secD6_1' ];
		$answer[16][1] = $tdetail[ 'secD6_2' ];
	break;
	case "17":
		$answer[17][0] = $tdetail[ 'secE1_1' ];
		$answer[17][1] = $tdetail[ 'secE1_2' ];
	break;

	case "18":
		$answer[18][0] = $tdetail[ 'secE2_1' ];
		$answer[18][1] = $tdetail[ 'secE2_2' ];
	break;
	case "19":
		$answer[19][0] = $tdetail[ 'secE3_1' ];
		$answer[19][1] = $tdetail[ 'secE3_2' ];

	break;
	case "20":
		$answer[20][0] = $tdetail[ 'secE4_1' ];
		$answer[20][1] = $tdetail[ 'secE4_2' ];
		$answer[20][2] = $tdetail[ 'secE4_3' ];

	break;

	case "21":
		$answer[21][0] = $tdetail[ 'secE5_1' ];
		$answer[21][1] = $tdetail[ 'secE5_2' ];
		$answer[21][2] = $tdetail[ 'secE5_3' ];
	break;
	case "22":
		$answer[22][0] = $tdetail[ 'secE6_1' ];
		$answer[22][1] = $tdetail[ 'secE6_2' ];
		$answer[22][2] = $tdetail[ 'secE6_3' ];
	break;

	case "23":
		$answer[23][1] = $tdetail[ 'secF1' ];
		$answer[23][2] = $tdetail[ 'secF2' ];
		$answer[23][3] = $tdetail[ 'secF3' ];
		$answer[23][4] = $tdetail[ 'secF4' ];
		$answer[23][5] = $tdetail[ 'secF5' ];

	break;
	case "24":
		$answer[24][6]  = $tdetail[ 'secF6' ];
		$answer[24][7]  = $tdetail[ 'secF7' ];
		$answer[24][8]  = $tdetail[ 'secF8' ];
		$answer[24][9]  = $tdetail[ 'secF9' ];
		$answer[24][10] = $tdetail[ 'secF10' ];

	break;
	case "25":
		$answer[25][11] = $tdetail[ 'secF11' ];
		$answer[25][12] = $tdetail[ 'secF12' ];
		$answer[25][13] = $tdetail[ 'secF13' ];
		$answer[25][14] = $tdetail[ 'secF14' ];
	break;
	case "26":
		$answer[26][1][0] = $tdetail[ 'secG1a' ];
		$answer[26][1][1] = $tdetail[ 'secG1b' ];
		$answer[26][1][2] = $tdetail[ 'secG1c' ];
		$answer[26][2][0] = $tdetail[ 'secG2a' ];
		$answer[26][2][1] = $tdetail[ 'secG2b' ];
		$answer[26][2][2] = $tdetail[ 'secG2c' ];
		$answer[26][3][0] = $tdetail[ 'secG3a' ];
		$answer[26][3][1] = $tdetail[ 'secG3b' ];
		$answer[26][3][2] = $tdetail[ 'secG3c' ];

	break;
	case "27":
		$answer[27][4][0] = $tdetail[ 'secG4a' ];
		$answer[27][4][1] = $tdetail[ 'secG4b' ];
		$answer[27][4][2] = $tdetail[ 'secG4c' ];
		$answer[27][5][0] = $tdetail[ 'secG5a' ];
		$answer[27][5][1] = $tdetail[ 'secG5b' ];
		$answer[27][5][2] = $tdetail[ 'secG5c' ];
	break;
	case "28":
		$answer[28][0] = $tdetail[ 'secH1A' ];
		$answer[28][1] = $tdetail[ 'secH1B' ];
		$answer[28][2] = $tdetail[ 'secH1C' ];
	break;
	case "29":
		$answer[29][0] = $tdetail[ 'secH2A' ];
		$answer[29][1] = $tdetail[ 'secH2B' ];
		$answer[29][2] = $tdetail[ 'secH2C' ];
	break;
	case "30":
		$answer[30][0] = $tdetail[ 'secH3A' ];
		$answer[30][1] = $tdetail[ 'secH3B' ];
		$answer[30][2] = $tdetail[ 'secH3C' ];
	break;
	case "31":
		$answer[31][0] = $tdetail[ 'secH4A' ];
		$answer[31][1] = $tdetail[ 'secH4B' ];
		$answer[31][2] = $tdetail[ 'secH4C' ];
	break;
	case "32":
		$answer[32][0] = $tdetail[ 'secH5A' ];
		$answer[32][1] = $tdetail[ 'secH5B' ];
		$answer[32][2] = $tdetail[ 'secH5C' ];
	break;
	case "33":
		$answer[33][0] = $tdetail[ 'secH6A' ];
		$answer[33][1] = $tdetail[ 'secH6B' ];
		$answer[33][2] = $tdetail[ 'secH6C' ];
	break;
	case "34":
		$answer[34][0] = $tdetail[ 'secH7A' ];
		$answer[34][1] = $tdetail[ 'secH7B' ];
		$answer[34][2] = $tdetail[ 'secH7C' ];
	break;
	case "35":
		$answer[35][0] = $tdetail[ 'secI1_1' ];
		$answer[35][1] = $tdetail[ 'secI1_2' ];
		$answer[35][2] = $tdetail[ 'secI1_3' ];
		$answer[35][3] = $tdetail[ 'secI1_4' ];
		$answer[35][4] = $tdetail[ 'secI1_5' ];
	break;

	case "36":
		$answer[36][0] = $tdetail[ 'secI2_1' ];
		$answer[36][1] = $tdetail[ 'secI2_2' ];
		$answer[36][2] = $tdetail[ 'secI2_3' ];
		$answer[36][3] = $tdetail[ 'secI2_4' ];
		$answer[36][4] = $tdetail[ 'secI2_5' ];

	break;
	case "37":
		$answer[37][0] = $tdetail[ 'secI3_1' ];
		$answer[37][1] = $tdetail[ 'secI3_2' ];
		$answer[37][2] = $tdetail[ 'secI3_3' ];
		$answer[37][3] = $tdetail[ 'secI3_4' ];
		$answer[37][4] = $tdetail[ 'secI3_5' ];

	break;
	case "38":
		$answer[38][0] = $tdetail[ 'secI4_1' ];
		$answer[38][1] = $tdetail[ 'secI4_2' ];
		$answer[38][2] = $tdetail[ 'secI4_3' ];
		$answer[38][3] = $tdetail[ 'secI4_4' ];
		$answer[38][4] = $tdetail[ 'secI4_5' ];
	break;

	case "39":
		$answer[39][0] = $tdetail[ 'secI5_1' ];
		$answer[39][1] = $tdetail[ 'secI5_2' ];
		$answer[39][2] = $tdetail[ 'secI5_3' ];
	break;


}


//ページ表示パターン選択
if($temp != "Fin"){
	switch($pager){
		case "39":
		case "38":
		case "37":
		case "36":
		case "35":
			$temp = "page5";
		break;
		case "22":
		case "21":
		case "20":
		case "19":
		case "18":
		case "17":
		case "16":
		case "15":
		case "14":
		case "13":
		case "12":
		case "11":
			$temp = "page4";
		break;

		case "25":
		case "24":
		case "23":
		case "10":
		case "9":
		case "8":
		case "7":
		case "6":
			$temp = "page3";
		break;
		case "27":
		case "26":
		case "5":
		case "4":

			$temp = "page2";
		break;

		case "34":
		case "33":
		case "32":
		case "31":
		case "30":
		case "29":
		case "28":


		case "3":
		case "2":
			$temp = "page1";
		break;
		case "1":
			$temp = "page";
		break;
		default:
			$temp = "guide";
		break;
	}
}

$nextPage = $pager+1;
$backPage = $pager-1;
	
$exam = $array_exam[$pager];

//var_dump($answer);

?>