<?PHP

//16パターンコメント
$h90 = 90;
$h70 = 70;

$type17 = array(
			"HHHH"=>array(
						 "0"=>$h90
						,"1"=>$h90
						,"2"=>$h90
						,"3"=>$h90
						,"plus"=>"他者との調和を大切にし、自分と周囲のバランスをうまく\n調整しながら、集団をまとめていけるでしょう。新たな環\n境にも、適応できる可能性が高いでしょう。\n\n"
						,"mainasu"=>"積極的な行動をしていない場合には、現状において、スト\nレスやプレッシャーを強く感じていることが原因かも知れ\nません。\n\n"
						,"type"=>"タイプ1"
					),
			"LHHH"=>array(
						 "0"=>$h70
						,"1"=>$h90
						,"2"=>$h90
						,"3"=>$h90
						,"plus"=>"自分の視点や興味が明確であり、独創性を持っている可能\\n性が高いでしょう。\n\n\n"
						,"mainasu"=>"読み取った相手の感情や周囲の雰囲気に自分なりの意味づ\nけができるでしょう。しかし、独断的すぎる場合には、周\n囲がついてこれられない場合があるかも知れません。\n\n"
						,"type"=>"タイプ2"
					),
			"HLHH"=>array(
						 "0"=>$h90
						,"1"=>$h70
						,"2"=>$h90
						,"3"=>$h90
						,"plus"=>"相手の様子や周囲の状況から影響を受けず、マイペースで、\nやりたいことに集中できる可能性が高いでしょう。\n\n\n"
						,"mainasu"=>"相手の感情やその原因についての理解が十分でなく、人が\nなぜそう感じているのかを理解しにくいでしょう。自分の\nペースで物事を進めてしまう場合があるかも知れません。\n\n"
						,"type"=>"タイプ3"
					),
			"HHLH"=>array(
						 "0"=>$h90
						,"1"=>$h90
						,"2"=>$h70
						,"3"=>$h90
						,"plus"=>"自分と周囲の状況を理解できているでしょう。一人で進め\nるような仕事では高い成果が出せる可能性が高いでしょう。\n\n\n"
						,"mainasu"=>"相手の感情に配慮した行動が取れていない可能性があるで\nしょう。なかなか相手に合わせられず、自分勝手な人だと\n受け取られる場合があるかも知れません。\n\n"
						,"type"=>"タイプ4"
					),
			"HHHL"=>array(
						 "0"=>$h90
						,"1"=>$h90
						,"2"=>$h90
						,"3"=>$h70
						,"plus"=>"自分のやりたいこと、興味があることに関しては、安定し\nた行動と成果が出せる可能性が高いでしょう。\n\n\n"
						,"mainasu"=>"急激な変化に直面すると、自分の気持ちを切り替えること\nができず、行き詰まったり、ストレスを抱えてしまう場合\nがあるかも知れません。\n\n"
						,"type"=>"タイプ5"
					),
			"HLLH"=>array(
						 "0"=>$h90
						,"1"=>$h70
						,"2"=>$h70
						,"3"=>$h90
						,"plus"=>"感覚的に判断することが多いでしょう。好きなことや、自\n分が思いついたことには、粘り強く積極的に取り組める可\n能性が高いでしょう。\n\n"
						,"mainasu"=>"状況を感覚的に判断し、客観性に欠けているため、周囲か\nら理解や納得を得られない場合があるかも知れません。\n\n\n"
						,"type"=>"タイプ6"
					),
			"HLHL"=>array(
						 "0"=>$h90
						,"1"=>$h70
						,"2"=>$h90
						,"3"=>$h70
						,"plus"=>"相手の反応を見て、どうするべきかを即座に考えられる可\n能性が高いでしょう。\n\n\n"
						,"mainasu"=>"その場を上手く収められますが、起きている事象の本質を\nよく考えずに、表面的な対応を取る場合があるかも知れま\nせん。\n\n"
						,"type"=>"タイプ7"
					),
			"HHLL"=>array(
						 "0"=>$h90
						,"1"=>$h90
						,"2"=>$h70
						,"3"=>$h70
						,"plus"=>"自分と周囲の状況を理解しながら、決められた仕事を淡々\nとこなすことができる可能性が高いでしょう。\n\n\n"
						,"mainasu"=>"気持ちの切り替えに時間がかかり、感情に振り回されてし\nまう可能性が高いでしょう。状況察知には長けますが、自\n発的に行動しようとしない場合があるかも知れません。\n\n"
						,"type"=>"タイプ8"
					),
			"LLHH"=>array(
						 "0"=>$h70
						,"1"=>$h70
						,"2"=>$h90
						,"3"=>$h90
						,"plus"=>"状況の捉え方が主観的で、独創的である可能性が高いでし\nょう。目的や目標が明確な場合には、ねばり強く取り組め\nる可能性が高いでしょう。\n\n"
						,"mainasu"=>"人間に関する洞察が十分ではなく、相手に詳しい説明を求\nめがちでしょう。思いこみが激しい場合は、空回りするこ\nとがあるかも知れません。\n\n"
						,"type"=>"タイプ9"
					),
			"LHLH"=>array(
						 "0"=>$h70
						,"1"=>$h90
						,"2"=>$h70
						,"3"=>$h90
						,"plus"=>"自分の興味のあることに対して、集中して取り組むことが\nできる可能性が高いでしょう。\n\n\n"
						,"mainasu"=>"周囲と歩調を合わせたり、相手に気を遣うことなど、他者\nへの関心が薄く、自分勝手な印象を与えている場合がある\nかも知れません。\n\n"
						,"type"=>"タイプ10"
					),
			"LHHL"=>array(
						 "0"=>$h70
						,"1"=>$h90
						,"2"=>$h90
						,"3"=>$h70
						,"plus"=>"状況を客観的に分析し、自分にも相手にも合理的に納得さ\nせることができる可能性が高いでしょう。\n\n\n"
						,"mainasu"=>"こうに違いないと理屈から自分の行動を決めますが、気持\nちがついてゆかず、行き詰まってしまう場合があるかも知\nれません。\n\n"
						,"type"=>"タイプ11"
					),
			"HLLL"=>array(
						 "0"=>$h90
						,"1"=>$h70
						,"2"=>$h70
						,"3"=>$h70
						,"plus"=>"自分や相手の反応によく気がつき、感情を敏感に読み取っ\nている可能性が高いでしょう。\n\n\n"
						,"mainasu"=>"相手の反応を判別できても、自分がとるべき行動を判断で\nきない場合があるでしょう。自分自身の感情に押し流され\nて、十分に思考できない可能性があるかも知れません。\n\n"
						,"type"=>"タイプ12"
					),
			"LHLL"=>array(
						 "0"=>$h70
						,"1"=>$h90
						,"2"=>$h70
						,"3"=>$h70
						,"plus"=>"探求心があり、人の気持ちの背景や複雑さなどに関する知\n識を十分に備えている可能性が高いでしょう。\n\n\n"
						,"mainasu"=>"傍観者になりやすく、目の前にいる相手に対する理解や関\nわりが十分でない可能性が高いでしょう。状況の変化に弱\nく、頭だけで考えて行動が伴わない場合があるかも知れま\nせん。"
						,"type"=>"タイプ13"
					),
			"LLHL"=>array(
						 "0"=>$h70
						,"1"=>$h70
						,"2"=>$h90
						,"3"=>$h70
						,"plus"=>"その場に相応しい行動を取ろうと考えることができる可能\\n性が高いでしょう。\n\n\n"
						,"mainasu"=>"状況の理解が十分でない場合が多く、単に周囲から求めら\nれる行動や、波風をたてないための行動になっている場合\nがあるかも知れません。\n\n"
						,"type"=>"タイプ14"
					),
			"LLLH"=>array(
						 "0"=>$h70
						,"1"=>$h70
						,"2"=>$h70
						,"3"=>$h90
						,"plus"=>"自分がやりたいことに対しては、根気強さを発揮して邁進\nすることができる可能性が高いでしょう。\n\n\n"
						,"mainasu"=>"人を巻き込むことが苦手な可能性が高いでしょう。イメー\nジが先行し、状況をよく理解しないまま行動を起こし、周\n囲に意図しない影響を与えてしまう場合があるかも知れま\nせん。"
						,"type"=>"タイプ15"
					),
			"LLLL"=>array(
						 "0"=>$h70
						,"1"=>$h70
						,"2"=>$h70
						,"3"=>$h70
						,"plus"=>"専門分野などの共通部分がある人とは、親密な関係を築く\nことができる可能性が高いでしょう。\n\n\n"
						,"mainasu"=>"他者や周囲の状況への関心が低く、他者に共感を示したり、\n周囲と歩調を合わせて協力し合うことは難しいでしょう。\n\n\n"
						,"type"=>"タイプ16"
					),
		);


//EI4ブランチ・バイアスコメント
		$type17_read = array(
						 0=>"相手の表情や様子から、相手がどう感じているかを読み間違うことが多い可能性があります。感情に対して\n注意を払わない状態がかなり続いている、または、相手の表情や様子を偏った受け止め方をしていたり、深\n読みしすぎたり、独自の見方で受け取っている可能性があります。より相手の感情の変化に注意を払うとよ\nいでしょう。"

						,1=>"相手の表情や様子から、相手がどう感じているかを読み間違う可能性があります。相手の感情的な表現に十\\n分に注意を払っていない、または、相手の表情や様子をやや偏った受け止め方をしていたり、ユニークな見\n方で受け取ったりしている可能性があり、思いこみにつながることもあるかもしれません。感情を言語化す\nる描写の幅を広げてみてもよいでしょう。"

						,2=>"相手の表情や様子から、相手がどのように感じているかを察知し、気持ちを読み取る能力を備えているよう\nです。相手の感情的な表現や反応に気づき、そこから相手の気持ちを読み取ることができるでしょう。自分\nや周りの感情を言語化したり、描写することができるでしょう。\n\n"

						,3=>"相手の表情や様子から、相手がどのように感じているかを敏感に察知し、気持ちを読み取ることに優れてい\nるようです。相手の感情的な表現や反応に気づき、そこから相手の気持ちを正確に読み取ることができるで\nしょう。自分や周りの感情を正しく言語化したり、描写することが的確にできるでしょう。\n\n"


						,4=>"相手の表情や様子から、相手がどのように感じているかを敏感に察知し、気持ちを読み取ることに大変優れ\nているようです。相手の感情的な表現や反応によく気づき、そこから相手の気持ちを正確に見極めることが\nできるでしょう。自分や周りの感情を正しく言語化したり、描写することがいつも的確にできるでしょう。\n\n"
						
					);
		$type17_rikai = array(
						 0=>"人がどのような時にどのような感情を抱くのか、感情が起こる原因や背景の理解の幅が狭い可能性がありま\nす。その結果、相手の反応にあなたが戸惑いを感じたり、逆に相手があなたの反応に戸惑いを感じるかもし\nれません。感情と行動の因果関係を理解するために、何が起こっているのか、何故起こっているのか、あえ\nて説明を求めるとよいでしょう。"
						,1=>"人がどのような時にどのような感情を抱くのか、感情が起こる原因や背景の理解の幅がやや狭い可能性があ\nります。その結果、相手の反応に対して、どうしてだろうと思うことがあるかもしれません。何が起こって\nいるのか何故起こっているのかの状況がわかれば、相手の反応を理解できるので、感情と行動の因果関係の\n知識を増やしていくとよいでしょう。"

						,2=>"人がどのような時にどのような感情を抱くのか、感情が起こる原因や背景を理解する能力を備えているよう\nです。人の気持ちがどのように変化するのか推測でき、相手の気持ちに沿った行動を取ったり、わかりやす\nく説明することが可能でしょう。何が起こっているのか何故起こっているのかという状況を把握することも\nできるでしょう。"


						,3=>"人がどのような時にどのような感情を抱くのか、感情が起こる原因や背景を理解することに優れているよう\nです。また、人の気持ちがどのように変化するのか十分に推測したうえで、相手の気持ちに沿った行動を取\nったり、わかりやすく説明する能力を高く備えているでしょう。相手の伝えたい心の内を理解し、状況を的\n確に把握できるでしょう。"


						,4=>"人がどのような時にどのような感情を抱くのか、感情が起こる原因や背景を正確に理解することが大変優れ\nているようです。また、人の気持ちがどのように変化するのか十分に推測したうえで、相手の気持ちに沿っ\nた行動を取ったり、わかりやすく説明する能力を大変高く備えているでしょう。相手の伝えたい心の内をよ\nく理解し、状況をいつも的確に把握できるでしょう。"
						
					);

		$type17_select = array(
						 0=>"とっさの場面で自分の感情を抑えきれず、場面によっては感情に振り回されてしまう可能性があります。そ\nの結果、周囲が戸惑うことがあるかもしれません。相手や状況に応じた適切な関わり方を考える際、自分の\n感情のありようだけに頼らず、相手の感情や状況がもたらす情報を手がかりにして、自分の行動を選択する\nと、よりよい人間関係を構築できるでしょう。"

						,1=>"とっさの場面で自分の感情を抑えきれず、自分の感情に振り回されやすい状況や、相手を振り回したりする\n状況になる可能性があります。相手や状況に応じた適切な関わり方が分かっていても、つい本意とは異なっ\nた行動をとってしまうことがあるかもしれません。感情や状況がもたらす情報を手がかりとして、自分の行\n動を選択するよう心がけるとよいでしょう。"


						,2=>"とっさの場面でも、目的のために今取るべき最善の行動は何かを考え、効果的かつ影響力のある行動を選択\nする能力を備えているようです。相手や状況に応じた適切な関わり方がわかり、それに応じて自分の感情を\nふさわしい状態に調整することができるでしょう。相手の感情に配慮した行動は何かを、よく認識している\nといえるでしょう。"


						,3=>"とっさの場面でも、目的のために今取るべき最善の行動を瞬時に考え判断し、効果的かつ影響力のある行動\nを選択することに優れているようです。相手や状況に応じた適切な関わり方ができ、それに応じて自分の感\n情を上手に調整していけるでしょう。相手の感情に配慮した効果的な行動は何かを、よく認識しているとい\nえるでしょう。"


						,4=>"とっさの場面でも、目的のために今取るべき最善の行動を瞬時に考え判断し、最も効果的かつ影響力のある\n行動を常に選択することに大変優れているようです。相手や状況に応じた最適な関わり方ができ、それに応\nじて自分の感情をとても上手に調整することができるでしょう。相手の感情に配慮した効果的な行動を、大\n変よく認識しているといえるでしょう。"
						
					);



		$type17_change = array(
						 0=>"目的達成に向けて自分の気持ちを駆り立てたり、相手がどのような感情を持ったかを想像しづらい可能性が\nあります。その結果、状況に急激な変化があった際に気持ちがついて行けないかもしれません。変化が激し\nすぎ、敢えて反応しないことで自己防衛していることも考えられます。周囲を意識し、相手の気持ちを想像\nし、相手の立場や状況に共感するとよいでしょう。"


						,1=>"目的達成に向けて自分の気持ちを駆り立てたり、落ち着かせたりするなど、気持ちを切り替えるのに少し時\n間がかかる可能性があります。安定した状況では、充分に集中できると思われますが、急激な変化に対して\nは、なかなか気持ちがついて行けないことがあるかもしれません。相手の気持ちを想像し、相手の立場や状\n況に共感するように心がけるとよいでしょう。"


						,2=>"感情によって行動や思考が変わることを理解し、目的に合わせて自分の気持ちを切り替える能力を備えてい\nるようです。また、相手の気持ちを想像する力があり、相手の立場や状況に共感することができるでしょう\n。意識的にムードや気分を変えることで視点を変え、独創的なアイデアを導き出せる可能性を持っているで\nしょう。"


						,3=>"感情によって行動や思考が変わることをよく理解し、目的に合わせて自分の気持ちを効果的に切り替えるこ\nとに優れているようです。また、相手の気持ちを想像する力が高く、相手の立場や状況を十分に共感でき、\n相手の感情に影響を与えることができるでしょう。ムードや気分を変えることで視点を変え、独創的なアイ\nデアを導き出すことも得意でしょう。"


						,4=>"感情によって行動や思考が変わることを十分に理解し、目的に合わせて自分の気持ちを効果的に切り替える\nことが大変優れているようです。また、相手の気持ちを想像する力が大変高く、相手の立場や状況に深く共\n感でき、相手の感情に影響を与えることができるでしょう。ムードや気分を変えることで視点を変え、独創\n的なアイデアを導き出すことも大変得意でしょう。"
						
					);
	
		
		$type17_bias = array(
						 0=>"現在の心理状態としては、物事を慎重に捉える傾向があるようです。入ってくる情報に対して過度に否定的に捉えることは、的\n確な状況判断を誤らせることにもつながりますので、注意が必要です。"
						,1=>"現在の心理状態としては、物事をやや慎重に捉える傾向があるようです。入ってくる情報に対する自分の捉え方が少し否定的か\nもしれないということを認識して、必要に応じて客観的な見方を心がけましょう。"
						,2=>"物事や入ってくる情報を、ニュートラルな視点から素直に受け止めています。"
						,3=>"現在の心理状態としては、物事をやや楽観的に捉える傾向があるようです。入ってくる情報に対する自分の捉え方が少し楽観的\nかもしれないということを認識して、必要に応じて客観的な見方を心がけましょう。"
						,4=>"現在の心理状態としては、物事を楽観的に捉える傾向があるようです。入ってくる情報に対して過度に楽観的に捉えることは、\n的確な状況判断を誤らせることにもつながりますので、注意が必要です。"
						);
?>