<?PHP
$next = "下一页";
$back = "返回";

/*
$title[1] = "此问卷是关于你的母亲的问卷。<br />从1～4的数字中选择一个你认为最恰当的数字，并在此数字下打“○”。";
$title[2] = "此问卷是关于你的母亲的问卷。<br />从1～6的数字中选择一个你认为最恰当的数字，并在此数字下打“○”。";
$title[3] = "此问卷是关于你的父亲的问卷。<br />从1～4的数字中选择一个你认为最恰当的数字，并在此数字下打“○”。";
$title[4] = "此问卷是关于你的父亲的问卷。<br />从1～6的数字中选择一个你认为最恰当的数字，并在此数字下打“○”。";
$title[5] = "回忆自己自身的事情<br />从1～4的数字中选择一个你认为最恰当的数字，并在此数字下打“○”。";
$title[6] = "回忆自己自身的事情<br />从1～4的数字中选择一个你认为最恰当的数字，并在此数字下打“○”。";
$title[7] = "回忆自己自身的事情<br />从1～4的数字中选择一个你认为最恰当的数字，并在此数字下打“○”。";
 * 
 */
$title[1] = $title[2] = $title[3] =  $title[4] =  "此问卷是关于你的母亲的问卷。";
$title[5] = $title[6] =     "回忆自己自身的事情";
$title[7] = "回忆自己自身的事情<br />你觉得要你就是学习。";
for($i=8;$i<=46;$i++){
    $title[$i] = "请从选项中选出一个最恰当的答案。";
}

$question[1][1] = "母亲非常理解你的心情或想法。";
$question[1][2] = "母亲会耐心聆听你说的话。";
$question[1][3] = "遇到困惑时，会想和母亲商量。";
$question[1][4] = "母亲的鼓励和批评都对自己有帮助。";
$question[1][5] = "母亲会将你所说的话作为一个大人的意见般尊重。";
$question[1][6] = "母亲会在你做了坏事后耐心地询问你为什么做了那样的事。";
$question[1][7] = "母亲将你的事情看得很重要。";
$question[1][8] = "母亲几乎不倾听你说的话。";
$question[1][9] = "母亲会将她自己的观点一味地强加到你的身上。";

$question[1][10] = "母亲会根据当时的心情决定对你的“鼓励方法”和“批评方法”。";
$question[1][11] = "母亲的“鼓励方法”和“批评方法”没有一贯性，会随时改变。";
$question[1][12] = "有时会觉得母亲很过分，有点讨厌。";
$question[1][13] = "我觉得母亲最喜欢我了。";
$question[1][14] = "我觉得母亲最信任我。";
$question[1][15] = "我觉得和我在一起母亲感到很幸福。";
$question[1][16] = "母亲对我无话不谈。";
$question[1][17] = "母亲比谁都值得信任。";
$question[1][18] = "我跟母亲在一起的时候很幸福。";
$question[1][19] = "我很喜欢我的母亲。";
$question[1][20] = "我跟母亲无话不谈。";




$question[2][21] = "母亲会对我说，不要听从别人的话，要通过她自己的思考后再行动。";
$question[2][22] = "母亲觉得我的事情最好自己做决定并坚持下去。";
$question[2][23] = "母亲会尊重我决定的事情。";
$question[2][24] = "母亲会留有与我交谈的时间。";
$question[2][25] = "母亲跟我呆在一起的时间很多。";
$question[2][26] = "母亲会花费时间和精力一直支持我。";
$question[2][27] = "母亲会为我创造良好的学习环境。";
$question[2][28] = "母亲会跟我交谈关于我的学习方法。";
$question[2][29] = "母亲有时会帮助我学习。";


$question[3][30] = "父亲非常理解你的心情或想法。";
$question[3][31] = "父亲会耐心聆听你说的话。";
$question[3][32] = "遇到困惑时，会想和父亲商量。";
$question[3][33] = "父亲的鼓励和批评都对自己有帮助。";
$question[3][34] = "父亲会将你所说的话作为一个大人的意见般尊重。";
$question[3][35] = "父亲会在你做了坏事后耐心地询问你为什么做了那样的事。";
$question[3][36] = "父亲将你的事情看得很重要。";
$question[3][37] = "父亲几乎不倾听你说的话。";
$question[3][38] = "父亲会将她自己的观点一味地强加到你的身上。";
$question[3][39] = "父亲会根据当时的心情决定对你的“鼓励方法”和“批评方法”。";
$question[3][40] = "父亲的“鼓励方法”和“批评方法”没有一贯性，会随时改变。";
$question[3][41] = "有时会觉得父亲很过分，有点讨厌。";
$question[3][42] = "我觉得父亲最喜欢我了。";
$question[3][43] = "我觉得父亲最信任我。";
$question[3][44] = "我觉得和我在一起父亲感到很幸福。";
$question[3][45] = "父亲对我无话不谈。";
$question[3][46] = "父亲比谁都值得信任。";
$question[3][47] = "我跟父亲在一起的时候很幸福。";
$question[3][48] = "我很喜欢我的父亲。";
$question[3][49] = "我跟父亲无话不谈。";


$question[4][50] = "父亲会对我说，不要听从别人的话，要通过自己的思考后再行动。";
$question[4][51] = "父亲觉得我的事情最好她自己做决定并坚持下去。";
$question[4][52] = "父亲会尊重我决定的事情。";
$question[4][53] = "父亲会留有与我交谈的时间。";
$question[4][54] = "父亲跟我呆在一起的时间很多。";
$question[4][55] = "父亲会花费时间和精力一直支持我。";
$question[4][56] = "父亲会为我创造良好的学习环境。";
$question[4][57] = "父亲会跟我交谈关于我的学习方法。";
$question[4][58] = "父亲有时会帮助我学习。";


$question[5][59] = "因为努力学习了。";
$question[5][60] = "因为聪明。";
$question[5][61] = "运气好。";
$question[5][62] = "问题简单。";
$question[5][63] = "身体状况或心情等很好。";
$question[5][64] = "因为没好好学习。";
$question[5][65] = "因为比较笨。";
$question[5][66] = "运气不好。";
$question[5][67] = "题目很难。";
$question[5][68] = "身体状况或心情等不好。";


$question[6][69] = "在学习前，会思考接下来必须要学习的内容。";
$question[6][70] = "学习中遇到不懂的问题时，会尝试改变各种学习方法。";
$question[6][71] = "要学习时，会想好接下来要学什么内容再开始学习。";
$question[6][72] = "要学习时，会考虑到当天的事情改变学习方法。";
$question[6][73] = "要学习时，会先定好计划再开始学习。";
$question[6][74] = "在学习过程中，会确认自己在做的是否正确。";
$question[6][75] = "在学习开始前，会思考接下来要学习什么、怎么学习。";
$question[6][76] = "学习前，会准备好学习中必须的书籍再学习。";
$question[6][77] = "在学习前会准备好参考书和词典以便学习时随时可以使用。";
$question[6][78] = "在学习时，会将内容浮现在脑海中进行思考。";
$question[6][79] = "学习时，会边思考重点边学习。";
$question[6][80] = "学习时，到最后会和朋友核对答案。";
$question[6][81] = "学习中遇到不懂的问题，会向朋友询问他的学习方法。";
$question[6][82] = "学习中遇到不懂的问题，会向朋友询问他的答案。";
$question[6][83] = "和会学习的朋友用相同的方法学习。";


$question[7][84]  = "因为解决问题很有趣。";
$question[7][85]  = "因为很享受挑战困难的事情。";
$question[7][86]  = "因为学习本身很有趣。";
$question[7][87]  = "因为找到新的解决方法、做法很有趣。";
$question[7][88]  = "因为自己想学习。";
$question[7][89]  = "因为和将来的成功会相关。";
$question[7][90]  = "因为想实现自己的梦想。";
$question[7][91]  = "因为想考进自己理想的大学。";
$question[7][92]  = "因为会对自己有用。";
$question[7][93]  = "因为学习很重要。";
$question[7][94]  = "因为不想在学习上输给朋友。";
$question[7][95]  = "因为想比朋友获得更好的成绩。";
$question[7][96]  = "因为不想被朋友嘲笑。";
$question[7][97]  = "因为会由于自己不会学习而很悲伤。";
$question[7][98]  = "因为不学习的话身边人会一直烦。";
$question[7][99]  = "因为被身边的人要求学习。";
$question[7][100] = "因为成绩下降的话会被骂。";
$question[7][101] = "因为学习就像规则一样的东西。";
$question[7][102] = "因为大家都在理所当然地学习。";


$question[8][103] = "思考自己现在是什么心情，「悲伤」?「担心」?";
$question[9][104] = "知道自己不擅长之处，不擅长的事情能够坦率的拜托别人";
$question[10][105] = "认为自己比别人聪明";
$question[11][106] = "即使「讨厌」也不表现在脸上，能马上恢复到平常的心情";
$question[12][107] = "决心将来从事伟大的工作";
$question[13][108] = "即使发生严重的问题也认为总会有办法";
$question[14][109] = "善于安静地倾听别人讲话";
$question[15][110] = "从对方的表情及谈话中能够想象出对方的心情";
$question[16][111] = "喜欢考虑给朋友过生日，让朋友高兴";
$question[17][112] = "朋友们经常能够听取自己的意见";
$question[18][113] = "能够让朋友不讨厌地说出自己想做的事情";
$question[19][114] = "能和朋友一起度过快乐的时光";
$question[20][115] = "被批评时，能思考自己哪里没做好";
$question[21][116] = "经常思考自己现在是什么心情";
$question[22][117] = "了解自己擅长和不擅长的事情";
$question[23][118] = "对自己的才能有信心";
$question[24][119] = "即使遇到讨厌或恼火的事情，也不立即发脾气";
$question[25][120] = "认为只要我努力，能够做的事情就会越来越多";
$question[26][121] = "即使因转校需要和新朋友打交到，也有自信能做好";
$question[27][122] = "朋友伤心时，自己也会变得伤心";
$question[28][123] = "能冷静的思考发生了什么事情";
$question[29][124] = "如果能让人感到高兴，即使讨厌的事情也能坚持做";
$question[30][125] = "我在朋友圈中是核心人物";
$question[31][126] = "谈话的内容没听懂时，能够坦率地提问";
$question[32][127] = "当朋友感到寂寞时，能够说些温柔的话";
$question[33][128] = "当没能如愿以偿时，不是想怨谁，而是认为自己要更加努力";
$question[34][129] = "确认自己现在是什么心情，想要了解自己";
$question[35][130] = "自己做错时能坦率地承认，并立即改正错误";
$question[36][131] = "喜欢自己";
$question[37][132] = "即使失败了，也不拿周围人撒气";
$question[38][133] = "认为只要自己努力，就没有做不到的事情";
$question[39][134] = "不成功时，不拘泥于一种方法，能不断地尝试不同的方法";
$question[40][135] = "当朋友遇到困难时，能主动帮忙";
$question[41][136] = "对方没说实话时能立即知道";
$question[42][137] = "和难以相处的朋友也能很好地一起玩";
$question[43][138] = "善于让吵架的朋友和好";
$question[44][139] = "当朋友做了讨厌的事情时，能不生气的告诉他不要做了";
$question[45][140] = "能注意周围是否有被排斥或没有朋友的人";
$question[46][141] = "失败时会反省自己的做法不够好";

$selects[1][1] = "不是";
$selects[1][2] = "基本不是";
$selects[1][3] = "基本是";
$selects[1][4] = "是";

$selects[2][1] = "完全不符合";
$selects[2][2] = "不符合";
$selects[2][3] = "基本不符合";
$selects[2][4] = "基本符合";
$selects[2][5] = "符合";
$selects[2][6] = "完全符合";

$selects[3][1] = "不是";
$selects[3][2] = "基本不是";
$selects[3][3] = "基本是";
$selects[3][4] = "是";

$selects[4][1] = "完全不符合";
$selects[4][2] = "不符合";
$selects[4][3] = "基本不符合";
$selects[4][4] = "基本符合";
$selects[4][5] = "符合";
$selects[4][6] = "完全符合";

$selects[5][1] = "不是";
$selects[5][2] = "基本不是";
$selects[5][3] = "基本是";
$selects[5][4] = "是";

$selects[6][1] = "不是";
$selects[6][2] = "基本不是";
$selects[6][3] = "基本是";
$selects[6][4] = "是";

$selects[7][1] = "不是";
$selects[7][2] = "基本不是";
$selects[7][3] = "基本是";
$selects[7][4] = "是";

for($i=8;$i<=46;$i++){
    $selects[$i][1] = "完全不是";
    $selects[$i][2] = "不太是";
    $selects[$i][3] = "有一点点是";
    $selects[$i][4] = "完全是";
}

$sub[5][59] = "【你觉得你为什么会取得好成绩？】";
$sub[5][64] = "【你觉得你为什么会考差？】";

$img[8]  = "img8.jpg";
$img[9]  = "img9.jpg";
$img[10] = "img10.jpg";
$img[11] = "img11.jpg";
$img[12] = "img12.jpg";
$img[13] = "img13.jpg";
$img[14] = "img14.jpg";
$img[15] = "img15.jpg";
$img[16] = "img16.jpg";
$img[17] = "img17.jpg";
$img[18] = "img18.jpg";
$img[19] = "img19.jpg";
$img[20] = "img20.jpg";
$img[21] = "img21.jpg";
$img[22] = "img22.jpg";

$ave = array(8.1,8.1,8.1,8.1,8.1,8.1,8.1,8.1,8.1,8.1,8.1,8.1,8.1);
$hensa = array(2.43,2.43,2.43,2.43,2.43,2.43,2.43,2.43,2.43,2.43,2.43,2.43,2.43);

?>