<?PHP
$array_answer = array(
					 "ans1"=>5
					,"ans2"=>2
					,"ans3"=>2
					,"ans4"=>3
					,"ans5"=>1
					,"ans6"=>1
					,"ans7"=>4
					,"ans8"=>2
					,"ans9"=>3
					,"ans10"=>4

				);
$array_number = array(
					1=>"①"
					,2=>"②"
					,3=>"③"
					,4=>"④"
					,5=>"⑤"
					,6=>"⑥"
					,7=>"⑦"
					,8=>"⑧"
					,9=>"⑨"
					,10=>"⑩"

				);

$question[1][1][0] = "";
$question[1][1][1] = "「人権は大事である」と思ってはいるのですが、実際に「人権とは何か」について良くわかっていない方は多いと思います。たとえば、どんなことをすると人権侵害にあたるのでしょうか。以下の選択肢からもっとも当てはまるものを１つ選んでください。";

$question[1][2][0] = "事象";
$question[1][2][1] = "ア．他者が信じている宗教をけなすこと";
$question[1][2][2] = "イ．採用時に男性を優先すること";
$question[1][2][3] = "ウ．無理に一気飲みをさせること";
$question[1][2][4] = "エ．衆人環境において大声で叱り飛ばすこと";

$question[1][3][1] = "① ア、ウ";
$question[1][3][2] = "② イ、エ";
$question[1][3][3] = "③ ア、イ、ウ";
$question[1][3][4] = "④ ア、ウ、エ";
$question[1][3][5] = "⑤ ア、イ、ウ、エ";


$interprete[1][0] = "⑤";
$interprete[1][1] = "アとイとウとエ";
$interprete[1][2] = "人権とは、すべての人が生まれながらにもっている人間らしく幸せに生きる権利です。具体的には、法の下での平等、経済的自由権、身体的自由権（人身の自由）、信教の自由などの権利を保有していることを言います。人権侵害とは、本人の同意なく強制して何かをさせたり、許容範囲を超えて精神的に追い詰めたり、性的な嫌がらせを行うことなどが該当します。基本的な考え方として、自分自身が楽しくても、他人が嫌がることはしないことです。例えば、無理に一気飲みさせることなどは、させる人・したい人は楽しいかもしれませんが、実際には嫌がっていることが多いものです。本問では、ア～エのすべてが人権侵害に当たります。";
$css[1][3][1] = "mt10";
$css[1][3][2] = "mt50";
$css[1][3][3] = "mt90";
$css[1][3][4] = "mt130";
$css[1][3][5] = "mt170";




$question[2][1][0] = "";
$question[2][1][1] = "わが社が従業員の皆さんに「人権を尊重してほしい」と考える<u>もっともふさわしい理由</u>を以下から1つ選んでください。";

$question[2][3][1] = "① 親会社をはじめグループ全体で人権を尊重することで社会的な評価を上げ、企業価値の向上に貢献することができるから。";
$question[2][3][2] = "② 組織の内外を問わず、よりよい人間関係の構築が期待でき、職場の活性化や勤労意欲の増大につながるから。";
$question[2][3][3] = "③ 世界人権宣言や、国連グローバルコンパクトなど、世界の潮流が人権を配慮することを求めているから。";

$interprete[2][0] = "②";
$interprete[2][1] = "組織の内外を問わず、よりよい人間関係の構築が期待でき、職場の活性化や勤労意欲の増大につながるから。";
$interprete[2][2] = "世界の潮流や、企業価値の向上への貢献も間違いではありませんが、わが社では人権の尊重を行うことで、組織の内外を問わず、よりよい人間関係の構築ができ、職場の活性化や勤労意欲の増大につながることができると考えています。";

$css[2][3][1] = "mt10";
$css[2][3][2] = "mt60";
$css[2][3][3] = "mt110";
$css[2][3][4] = "mt120";
$css[2][3][5] = "mt160";
$imgmt[2] = "mt180";



$question[3][1][0] = "";
$question[3][1][1] = "男女が互いに人権を尊重しつつ責任を分かち合い、性別に関わりなく、その個性と能力を十分に発揮できる社会を、「男女共同参画社会」と言います。男女共同参画社会を実現するためには、過去からの「意識」と「制度・慣行」を変える必要があると考えられているのですが、以下の選択肢から、男女共同参画社会の実現を阻む「意識」や「制度・慣行」に該当<u>しない</u>ものを1つ選んでください。";


$question[3][2][0] = "事象";
$question[3][2][1] = "ア．管理職登用の条件に、転勤を要件としている。";
$question[3][2][2] = "イ．お茶くみは女性の仕事としている。";
$question[3][2][3] = "ウ．管理職に女性を積極的に登用している。";
$question[3][2][4] = "エ．募集・採用に当たって、身長170㎝以上という要件をあげている。";
$question[3][2][5] = "オ．妊娠・出産時には、退職を勧めている。";


$question[3][3][1] = "① イ";
$question[3][3][2] = "② ウ";
$question[3][3][3] = "③ ア、エ";
$question[3][3][4] = "④ イ、オ";
$question[3][3][5] = "⑤ ア、ウ、エ";
$question[3][3][6] = "⑥ ア、イ、ウ、エ、オ";




$interprete[3][0] = "②";
$interprete[3][1] = "ウ";
$interprete[3][2] = "管理職登用の条件に転勤経験を入れたり、募集の際に性別不問といいながらも身長170センチ以上といった体格の要件を入れることは、結果として多くの女性を対象外にしており、間接差別といわれる「制度」となっています。またお茶くみは女性の仕事という意識や、妊娠・出産時には退職を勧めるといった慣行（いわゆるマタニティハラスメント）も、男女共同参画社会の実現を阻んでいます。
一方、女性を管理職に積極的に登用することは、ポジティブアクションと呼ばれており、男女間の格差の解消をめざすための是正措置として認識されています。世界的に見ると、日本は男女格差が大きい国として認識されており、世界経済フォーラムが発表している「ジェンダーギャップ指数」においては、2014年の日本の順位は142カ国中104位とたいへん低い状況であり、今後の改善が求められています。";

$css[3][3][1] = "mt10";
$css[3][3][2] = "mt50";
$css[3][3][3] = "mt90";
$css[3][3][4] = "mt130";
$css[3][3][5] = "mt170";
$css[3][3][6] = "mt210";

$imgmt[3] = "mt180";





$question[4][1][0] = "";
$question[4][1][1] = "セクシャルハラスメントの代表的なものとして、職務上の地位を利用して性的な関係を強要する「対価型セクシャルハラスメント」と、職場内での性的な言動により働く人を不快にする「環境型セクシャルハラスメント」があります。以下の選択肢から、この２つのハラスメントの具体的内容について正しく記述されたものを１つ選んでください。";


$question[4][2][0] = "事象";
$question[4][2][1] = "ア．人事考課での高評価を条件に性的な関係を求められた。";
$question[4][2][2] = "イ．上司から恋愛経験を執拗に尋ねられた。";
$question[4][2][3] = "ウ．宴会で男性が裸踊りを行った。";
$question[4][2][4] = "エ．上司の休日のゴルフに無理やり付き合わされた。";

$question[4][3][1] = "①「対価型」ア　：「環境型」ウ";
$question[4][3][2] = "②「対価型」イ　：「環境型」ウ、エ";
$question[4][3][3] = "③「対価型」ア　：「環境型」イ、ウ";
$question[4][3][4] = "④「対価型」ア、ウ、エ　：「環境型」イ";
$question[4][3][5] = "⑤「対価型」ア、ウ　：「環境型」 イ、エ";



$interprete[4][0] = "③";
$interprete[4][1] = "「対価型」ア「環境型」イ、ウ";
$interprete[4][2] = "対価型は、地位の利用をもとに性的な関係を強要するもので、人事考課や配置転換などを地位の高い人がそれを利用することで生み出す事象が相当します。また環境型は、性的な言動で不快な環境を作るもので、恋愛関係を執拗に尋ねられたり、裸踊りをするなどの行為も該当する可能性が高いものです。上司の休日ゴルフへの付き合いは、セクシャルハラスメントではなく、パワーハラスメントに相当する可能性があります。";

$css[4][3][1] = "mt10";
$css[4][3][2] = "mt50";
$css[4][3][3] = "mt90";
$css[4][3][4] = "mt130";
$css[4][3][5] = "mt170";
$imgmt[4] = "";






$question[5][1][0] = "";
$question[5][1][1] = "上司とはもともとウマが合わなかったのですが、最近はとくに目ざわりに思うらしく、部署内でも私にだけ声をかけなかったり露骨に無視するので、仕事がやりにくくて仕方がありません。先日思いきってそのことを伝えてみたら、「お前の代わりなんか、いくらでもいる。嫌なら辞めろ」とまで言われてしまいました。これってパワハラではないでしょうか。以下の選択肢から正しいと思われるものを１つ選んでください。";

$question[5][3][1] = "① 露骨に無視することも、「お前の代わりなどいくらでもいる」などと言ことも、相手の人格や存在を否定する言動であり、<br />パワハラに該当する。";
$question[5][3][2] = "② 仕事をスムーズに進めるために、上司と良い関係を築くのも１つの能力である。パワハラと非難する前に、自分自身の行動を<br />振り返って問題がないかを考えるべきであり、その上でないとパワハラかどうかは判断できない。";
$question[5][3][3] = "③ 人間関係がこじれれば、辛辣なことを言われたり無視されることもあり得ることであり、上司の言動もパワハラとは言い難い。";

$heights[5][1] = "l20";
$heights[5][2] = "l20";



$interprete[5][0] = "①";
$interprete[5][1] = "露骨に無視することも、「お前の代わりなどいくらでもいる」などと言ことも、相手の人格や存在を否定する言動であり、<br />パワハラに該当する。";
$interprete[5][2] = "仕事をスムーズに進めるために、職場の人間関係を良好に保つことは必要な能力の一つとはいえますが、上司が部下を露骨に無視したり、「お前の代わりなどいくらでもいる」と言うのはやりすぎです。職場の権力を背景に部下を一方的に否定する行為は人格を否定する行為であり、パワハラの一つとみなされる可能性が大です。パワハラというのは、怒鳴りちらすことを指すのではなく、権力をかさに相手の人格を尊重しない行為すべてが該当すると考えてください。";
$css[5][3][3] = "mt40";

$css[5][3][1] = "mt10";
$css[5][3][2] = "mt60";
$css[5][3][3] = "mt110";

//$css2[5][3][2] = "mt0";


$imgmt[5] = "mt220";




$question[6][1][0] = "";
$question[6][1][1] = "2015年3月、東京渋谷区は、同性パートナーシップ条例を可決しましたが、この条例は、「区内の20歳以上の同性カップルが対象で、互いを後見人とする公正証書や同居を証明する資料を提出すれば、「パートナーシップ証明」を発行する」というものです。では、このパートナーシップ証明はどのような場面で使われることを想定しているのでしょうか。以下の選択肢から正しいと思われるものを１つ選んでください。";

$question[6][3][1] = "① 家族での入居が前提としているために同性カップルが入居できなかった賃貸住宅に入居できるようになったり、パートナーがケガや病気で手術したり入院したりしたときも付き添いができるようになる。";
$question[6][3][2] = "② 正式に婚姻関係が結べるようになり、財産の相続権も得られるようになるため、その際に使用できる。";
$question[6][3][3] = "③ 証明をもらったときに同時に貰えるバッチを付けておくことで、LGBT（レズ、ゲイ、バイ、トランスジェンダー）として、各種の優遇措置を受けることができる。";

$interprete[6][0] = "①";
$interprete[6][1] = "家族での入居が前提としているために同性カップルが入居できなかった賃貸住宅に入居できるようになったり、パートナーがケガや病気で手術したり入院したりしたときも付き添いができるようになる。";
$interprete[6][2] = "同性同士のカップルは、家族ではないという理由から、賃貸住宅での入居や病院で付き添いを断られたりすることがありました。そこで、パートナーシップ証明を出すことで、これらの解消を図ろうとしています。同性結婚を認めるものではありません。LGBTのような性的マイノリティの人権擁護のための施策の一つと考えられています。この条例は一つ例ですが、今後、あらゆる場面で性的マイノリティの人権を尊重していくことに留意していく必要があります。";
$css[6][3][1] = "mt0";
$css[6][3][2] = "mt10";
$css[6][3][3] = "mt40";

$heights[6][1] = "ml20";
$heights[6][2] = "l20";
$heights[6][3] = "ml20";

$css2[6][3][2] = "mt0";
$css2[6][3][3] = "mt0";

$imgmt[6] = "mt60";



$question[7][1][0] = "";
$question[7][1][1] = "日本には約744万人もの障害のある人がいて、特別な存在ではありません。誰もが自分の能力を発揮して地域の中でいきいきと生きる社会を目指すためには、障害のある人の活動を阻む様々なバリアをなくす必要があると言われています。以下の選択肢は、さまざまなバリアとその内容を示したものです。正しい組み合わせを１つ選んでください。";

$question[7][2][0] = "（バリア）";
$question[7][2][1] = "ア　物理的バリア";
$question[7][2][2] = "イ　制度的バリア";
$question[7][2][3] = "ウ　文化・情報面のバリア";
$question[7][2][4] = "エ　意識のバリア";

$question[7][2][5] = "<br />（内容）<br /><br />";
$question[7][2][6] = "Ⅰ　読む、聞く、話すといった機能に障害があるため、そのままでは情報のやりとりがしにくい状態にあること";
$question[7][2][7] = "Ⅱ　心のバリアとも呼ばれ、人々が障害のある人に無理解や無関心であること";
$question[7][2][8] = "Ⅲ　歩道の段差、車イス使用者の通行を妨げる障害物などのこと";
$question[7][2][9] = "Ⅳ　障害を理由に、資格や免許などが所得できない決まりなどのこと";



$question[7][3][1] = "① ア・Ⅰ、イ・Ⅱ、ウ・Ⅲ、エ・Ⅳ";
$question[7][3][2] = "② ア・Ⅱ、イ・Ⅰ、ウ・Ⅳ、エ・Ⅲ";
$question[7][3][3] = "③ ア・Ⅳ、イ・Ⅲ、ウ・Ⅱ、エ・Ⅰ";
$question[7][3][4] = "④ ア・Ⅲ、イ・Ⅳ、ウ・Ⅰ、エ・Ⅱ";

$interprete[7][0] = "④";
$interprete[7][1] = "ア・Ⅲ、イ・Ⅳ、ウ・Ⅰ、エ・Ⅱ";
$interprete[7][2] = "障害のある人が普通に働けるようにしていくことを「ノーマライゼーション」と呼びます。そのためには、本問で述べたように、物理的バリア、制度的バリア、文化・情報面のバリア、意識のバリアなどの様々なバリアを無くしていくことが必要です。職場の段差をなくすといった物理的バリアを無くしていくような身近なところからバリアの解消を進めていきたいものです。";
$css[7][3][1] = "mt10";
$css[7][3][2] = "mt50";
$css[7][3][3] = "mt90";
$css[7][3][4] = "mt130";
$css[7][3][5] = "mt170";

$imgmt[7] = "";




$question[8][1][0] = "";

$question[8][1][1] = "職場全員で食事に行くイベントがあり、あるお店に入ろうとしたところ、職場の外国人が「私はその食材は食べないし飲まない」と何も口をつけませんでした。皆の一体感も大事だと思うので、どうにか一緒に行ってほしかったのですが、どんなことに気を付ければよかったのでしょうか。以下の選択肢から正しいと思われるものを１つ選んでください。";

$question[8][3][1] = "① あまり神経質になってもしかたがないので、外国人は気にせず、日本人だけで食事にいけばよい。";
$question[8][3][2] = "② 宗教上の理由などで、特定の食材を食べたり飲んだりしないことはよくあるので、お店の選択をする前に事前に<br />確認することが必要。";
$question[8][3][3] = "③ 外国人は、仕事は仕事、プライベートはプライベートと割り切るので、そもそも業務外の食事に誘うのがNG。";

$interprete[8][0] = "②";
$interprete[8][1] = "宗教上の理由などで、特定の食材を食べたり飲んだりしないことはよくあるので、お店の選択をする前に事前に確認することが必要。";
$interprete[8][2] = "外国人に限らず、食習慣や宗教上の理由、体調の問題などによって、食材や飲み物を選ぶ人がいます。それらのことを考えて、食事の場面では、事前に確認をすることが必要です。とくに外国人の場合、育った地域や環境が大きく異なるので、私たちが知らないような禁忌（タブー）があることもありますので、あらゆる場面でコミュニケーションを良くして、お互いの意識のギャップを埋めていくことが必要です。";
$css[8][3][2] = "mt40";
$css[8][3][3] = "mt40";

$css[8][3][1] = "mt10";
$css[8][3][2] = "mt70";
$css[8][3][3] = "mt130";

$heights[8][2] = "l20";

$imgmt[8] = "mt200";





$question[9][1][0] = "";
$question[9][1][1] = "同和問題とは同和地区、被差別部落などと呼ばれる特定の地域出身であることや、そこに住んでいることを理由に、結婚に反対されたり、就職や日常生活で様々な差別を受ける問題です。一方で、同和問題を口実に、企業などに対して、「差別をした」という言いがかりをつけて金品を請求されたり、高額な寄付を要求するといった不当な「えせ同和行為」を行う団体もいます。こういった不当な要求を受けた場合、企業としてどのように対応すべきでしょうか。以下の選択肢から正しいと思われるものを１つ選んでください。";

$question[9][3][1] = "① 同和問題は揉めると企業に悪影響を及ぼす恐れがあるので、穏便にすませるために、金品等を提供する。";
$question[9][3][2] = "② 相手の団体を調べ、社会的インパクトや政治的影響力の大きさなどによって、対応を判断する。";
$question[9][3][3] = "③ えせ同和行為は「断固拒否する」ことが企業の社会的責任であり、同和問題の解決にもつながる。";

$interprete[9][0] = "③";
$interprete[9][1] = "えせ同和行為は「断固拒否する」ことが企業の社会的責任であり、同和問題の解決にもつながる。";
$interprete[9][2] = "不当な要求には毅然とした態度で断固拒否しなくてはなりません。不当な要求を受けた場合は、法務部などの関連部署にただちに連絡をいれて相談してください。個人の弱みに付け込んで要求をしてくる場合もありますが、その場合も、まずは相談してください。会社としてバックアップをして問題解決につなげていきます。また、もし相談する前に先方からの要求を受けるような場合があったとしたときには、①自社応接室で会う。②複数人で応対する。③面接や電話の内容を録音し（録画）、または詳細に記録に取る。といったことを行ってください。";

$css[9][3][1] = "mt10";
$css[9][3][2] = "mt60";
$css[9][3][3] = "mt110";


$imgmt[9] = "mt130";


$question[10][1][0] = "";
$question[10][1][1] = "SNS（ソーシャルネットワークサービス）を活用し、友人たちの活動や、地域でのイベントの情報などを楽しんでいます。ただ、中には眉をひそめるような書き込みがあったりして、人権を侵害しているのではないかと不快な思いをすることがあります。以下の選択肢の中から、人権侵害に当たるものを表したものを1つ選んでください。";

$question[10][2][0] = "事象";
$question[10][2][1] = "ア．外国人に対する侮蔑";
$question[10][2][2] = "イ．誹謗中傷の書き込み";
$question[10][2][3] = "ウ．政府の政策への意見の書き込み";
$question[10][2][4] = "エ．他人のプライバシーに関する情報";
$question[10][2][5] = "オ．部下や同僚の失敗事例の書き込み";


$question[10][3][1] = "① ア、イ、エ";
$question[10][3][2] = "② ア、エ、オ";
$question[10][3][3] = "③ ア、イ、ウ、エ";
$question[10][3][4] = "④ ア、イ、エ、オ";
$question[10][3][5] = "⑤ ア、イ、ウ、エ、オ";



$interprete[10][0] = "④";
$interprete[10][1] = "ア、イ、エ、オ";
$interprete[10][2] = "解説SNSやインターネットの掲示板などは、非常に便利で使用するメリットも大きい反面で、多数の人に公開されるため、ちょっとした不注意の情報発信から人権侵害の問題になることが多く発生しています。たとえば、外国人への差別的な発言や、他人への誹謗中傷、個人に紐づけられるプライバシー情報、会社の部下や同僚に関することなどを書き込んでしまい、他人を不快な思いにさせたり、迷惑をかけたりしてしまうことがあります。政治や経済などの問題に対する意見の表明は、人権侵害にもなりませんし、憲法で認められている思想信条の表明ですから人権問題ではありませんが、反対意見を述べる人との間でヒートアップし、SNS上での言い合いから相手の人格を否定するような発言をすることも多いので、慎重に発言するようにお願いします。";

$css[10][3][1] = "mt10";
$css[10][3][2] = "mt50";
$css[10][3][3] = "mt90";
$css[10][3][4] = "mt130";
$css[10][3][5] = "mt170";

$imgmt[10] = "mt100";


?>